Repository: Addivsyou/python-docs-it
Catalog: tutorial/appendix.po
Languages: it_it

source: Appendix
it_it: Appendice

source: Interactive Mode
it_it: Modalità Interattiva

source: Error Handling
it_it: Gestione degli Errori

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit status; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
it_it: Quando si verifica un errore, l'interprete stampa un messaggio di errore e una traccia dello stack. In modalità interattiva, quindi ritorna al prompt principale; quando l'input proviene da un file, esce con uno stato di uscita diverso da zero dopo aver stampato la traccia dello stack. (Le eccezioni gestite da una clausola :keyword:`except` in un'istruzione :keyword:`try` non sono errori in questo contesto.) Alcuni errori sono incondizionatamente fatali e causano un'uscita con uno stato di uscita diverso da zero; questo si applica alle incoerenze interne e a certi casi di esaurimento della memoria. Tutti i messaggi di errore sono scritti sul flusso standard degli errori; l'output normale dei comandi eseguiti è scritto sul flusso standard dell'output.

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
it_it: Digitare il carattere d'interruzione (di solito :kbd:`Control-C` o :kbd:`Delete`) al prompt principale o secondario cancella l'input e ritorna al prompt principale. [#]_ Digitando un'interruzione mentre un comando è in esecuzione si solleva l'eccezione :exc:`KeyboardInterrupt`, che può essere gestita da un'istruzione :keyword:`try`.

source: Executable Python Scripts
it_it: Script Eseguibili Python

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
it_it: Nei sistemi Unix di tipo BSD, gli script Python possono essere resi direttamente eseguibili, come gli script di shell, aggiungendo la riga ::

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
it_it: (supponendo che l'interprete sia nel :envvar:`PATH` dell'utente) all'inizio dello script e dando al file un permesso eseguibile. Il ``#!`` deve essere i primi due caratteri del file. Su alcune piattaforme, questa prima riga deve terminare con un fine riga in stile Unix (``'\n'``), non con un fine riga in stile Windows (``'\r\n'``). Nota che il carattere cancelleto, ``'#'``, è usato per iniziare un commento in Python.

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
it_it: Lo script può essere reso eseguibile, o avere i permessi, usando il comando :program:`chmod`.

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
it_it: Nei sistemi Windows, non esiste il concetto di "modalità eseguibile". L'installatore Python associa automaticamente i file ``.py`` con ``python.exe`` in modo che un doppio clic su un file Python lo esegua come uno script. L'estensione può anche essere ``.pyw``; in tal caso, la finestra della console che appare normalmente viene soppressa.

source: The Interactive Startup File
it_it: Il File di Avvio Interattivo

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
it_it: Quando usi Python in modalità interattiva, è spesso utile avere alcuni comandi standard eseguiti ogni volta che l'interprete viene avviato. Puoi fare ciò impostando una variabile di ambiente chiamata :envvar:`PYTHONSTARTUP` al nome di un file contenente i tuoi comandi di avvio. Questo è simile alla funzionalità :file:`.profile` delle shell Unix.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
it_it: Questo file viene letto solo nelle sessioni interattive, non quando Python legge i comandi da uno script, e non quando :file:`/dev/tty` è dato come fonte esplicita dei comandi (che altrimenti si comporta come una sessione interattiva). Viene eseguito nello stesso namespace dove vengono eseguiti i comandi interattivi, quindi gli oggetti che definisce o importa possono essere usati senza qualificazioni nella sessione interattiva. Puoi anche cambiare i prompt ``sys.ps1`` e ``sys.ps2`` in questo file.

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
it_it: Se vuoi leggere un file di avvio aggiuntivo dalla directory corrente, puoi programmare questo nel file di avvio globale usando il codice come ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. Se vuoi usare il file di avvio in uno script, devi farlo esplicitamente nello script::

source: The Customization Modules
it_it: I Moduli di Personalizzazione

source: Python provides two hooks to let you customize it: :index:`sitecustomize` and :index:`usercustomize`. To see how it works, you need first to find the location of your user site-packages directory. Start Python and run this code::
it_it: Python fornisce due hook per permetterti di personalizzarlo: :index:`sitecustomize` e :index:`usercustomize`. Per vedere come funziona, devi prima trovare la posizione della directory user site-packages. Avvia Python ed esegui questo codice::

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
it_it: Ora puoi creare un file chiamato :file:`usercustomize.py` in quella directory e inserire ciò che vuoi in esso. Questo influenzerà ogni invocazione di Python, a meno che non sia avviato con l'opzione :option:`-s` per disabilitare l'importazione automatica.

source: :index:`sitecustomize` works in the same way, but is typically created by an administrator of the computer in the global site-packages directory, and is imported before :index:`usercustomize`. See the documentation of the :mod:`site` module for more details.
it_it: :index:`sitecustomize` funziona allo stesso modo, ma è tipicamente creato da un amministratore del computer nella directory globale site-packages e viene importato prima di :index:`usercustomize`. Per maggiori dettagli, vedi la documentazione del modulo :mod:`site`.

source: Footnotes
it_it: Note a pie' di pagina

source: A problem with the GNU Readline package may prevent this.
it_it: Un problema con il pacchetto GNU Readline potrebbe impedirlo.
