Repository: Addivsyou/python-docs-it
Catalog: tutorial/classes.po
Languages: it_it

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
it_it: Python supporta anche una forma di ereditarietà multipla. Una definizione di classe con più classi base è simile::

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`!DerivedClassName`, it is searched for in :class:`!Base1`, then (recursively) in the base classes of :class:`!Base1`, and if it was not found there, it was searched for in :class:`!Base2`, and so on.
it_it: Per la maggior parte degli scopi, nei casi più semplici, si può pensare alla ricerca di attributi ereditati da una classe padre come alla profondità prima, da sinistra a destra, senza cercare due volte nella stessa classe dove c'è una sovrapposizione nella gerarchia. Pertanto, se un attributo non viene trovato in :class:`!DerivedClassName`, viene cercato in :class:`!Base1`, quindi (ricorsivamente) nelle classi base di :class:`!Base1`, e se non è stato trovato lì, viene cercato in :class:`!Base2`, e così via.

source: In fact, it is slightly more complex than that; the method resolution order changes dynamically to support cooperative calls to :func:`super`. This approach is known in some other multiple-inheritance languages as call-next-method and is more powerful than the super call found in single-inheritance languages.
it_it: Infatti, è leggermente più complesso di così; l'ordine di risoluzione del metodo cambia dinamicamente per supportare le chiamate cooperative a :func:`super`. Questo approccio è noto in altri linguaggi con ereditarietà multipla come call-next-method ed è più potente della chiamata super trovata nei linguaggi a ereditarietà singola.

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see :ref:`python_2.3_mro`.
it_it: L'ordinamento dinamico è necessario perché tutti i casi di ereditarietà multipla mostrano una o più relazioni di diamante (dove almeno una delle classi padre può essere accessibile attraverso percorsi multipli dalla classe più bassa). Per esempio, tutte le classi ereditano da :class:`object`, quindi qualsiasi caso di ereditarietà multipla fornisce più di un percorso per raggiungere :class:`object`. Per evitare che le classi base vengano accessibili più di una volta, l'algoritmo dinamico linearizza l'ordine di ricerca in modo che preserva l'ordunquezione da sinistra a destra specificata in ogni classe, che chiama ogni genitore solo una volta, e che è monotònico (significando che una classe può essere sottoclasse senza influenzare l'ordine di precedenza dei suoi genitori). Insieme, queste proprietà rendono possibile progettare classi affidabili ed estensibili con ereditarietà multipla. Per maggiori dettagli, vedi :ref:`python_2.3_mro`.

source: Private Variables
it_it: Variabili Private

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
it_it: Non esistono variabili di istanza "private" che non possono essere accessibili se non all'interno di un oggetto in Python. Tuttavia, c'è una convenzione seguita dalla maggior parte del codice Python: un nome prefisso con un trattino basso (es. ``_spam``) dovrebbe essere trattato come una parte non pubblica dell'API (sia che sia una funzione, un metodo o un membro dato). Dovrebbe essere considerato un dettaglio di implementazione e soggetto a cambiamento senza preavviso.

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
it_it: Poiché esiste un caso d'uso valido per i membri privati della classe (ovvero per evitare conflitti di nomi con nomi definiti dalle sottoclassi), c'è un supporto limitato per tale meccanismo, chiamato :dfn:`offuscamento dei nomi`. Qualsiasi identificatore della forma ``__spam`` (almeno due trattini bassi iniziali, al massimo uno finale) è testualmente sostituito con ``_classname__spam``, dove ``classname`` è il nome attuale della classe con i trattini bassi iniziali rimossi. Questo offuscamento viene eseguito senza riguardo alla posizione sintattica dell'identificatore, purché si trovi all'interno della definizione di una classe.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
it_it: L'offuscamento dei nomi è utile per permettere alle sottoclassi di sovrascrivere i metodi senza rompere le chiamate ai metodi interni alla classe. Per esempio::

source: The above example would work even if ``MappingSubclass`` were to introduce a ``__update`` identifier since it is replaced with ``_Mapping__update`` in the ``Mapping`` class and ``_MappingSubclass__update`` in the ``MappingSubclass`` class respectively.
it_it: L'esempio sopra funzionerebbe anche se ``MappingSubclass`` dovesse introdurre un identificatore ``__update`` poiché viene sostituito con ``_Mapping__update`` nella classe ``Mapping`` e ``_MappingSubclass__update`` nella classe ``MappingSubclass`` rispettivamente.

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
it_it: Si noti che le regole di offuscamento sono progettate soprattutto per evitare incidenti; è ancora possibile accedere o modificare una variabile considerata privata. Questo può essere utile in circostanze speciali, come nel debugger.

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
it_it: Si noti che il codice passato a ``exec()`` o ``eval()`` non considera la classe nome dell'invocante per essere la classe attuale; questo è simile all'effetto della dichiarazione ``global``, l'effetto del quale è analogamente limitato al codice che è compilato insieme. La stessa restrizione si applica a ``getattr()``, ``setattr()`` e ``delattr()``, così come quando si fa riferimento direttamente a ``__dict__``.

source: Odds and Ends
it_it: Varie ed Eventuali

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. The idiomatic approach is to use :mod:`dataclasses` for this purpose::
it_it: A volte è utile avere un tipo di dato simile al "record" del Pascal o al "struct" del C, raggruppando insieme alcuni elementi dati con nome. L'approccio idiomatico è utilizzare :mod:`dataclasses` per questo scopo::

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.readline` that get the data from a string buffer instead, and pass it as an argument.
it_it: Un pezzo di codice Python che si aspetta un particolare tipo di dato astratto può spesso essere passato a una classe che emula i metodi di quel tipo di dato. Per esempio, se hai una funzione che formatta alcuni dati da un oggetto file, puoi definire una classe con i metodi :meth:`~io.TextIOBase.read` e :meth:`~io.TextIOBase.readline` che ottengono i dati da un buffer di stringhe, e passarla come argomento.

source: :ref:`Instance method objects <instance-methods>` have attributes, too: :attr:`m.__self__ <method.__self__>` is the instance object with the method :meth:`!m`, and :attr:`m.__func__ <method.__func__>` is the :ref:`function object <user-defined-funcs>` corresponding to the method.
it_it: Gli :ref:`oggetti metodo d'istanza <instance-methods>` hanno anch'essi attributi: :attr:`m.__self__ <method.__self__>` è l'oggetto istanza con il metodo :meth:`!m`, e :attr:`m.__func__ <method.__func__>` è l':ref:`oggetto funzione <user-defined-funcs>` corrispondente al metodo.

source: Iterators
it_it: Iteratori

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
it_it: Ormai avrai probabilmente notato che la maggior parte degli oggetti contenitori può essere iterata utilizzando un'istruzione :keyword:`for`::

source: This style of access is clear, concise, and convenient. The use of iterators pervades and unifies Python. Behind the scenes, the :keyword:`for` statement calls :func:`iter` on the container object. The function returns an iterator object that defines the method :meth:`~iterator.__next__` which accesses elements in the container one at a time. When there are no more elements, :meth:`~iterator.__next__` raises a :exc:`StopIteration` exception which tells the :keyword:`!for` loop to terminate. You can call the :meth:`~iterator.__next__` method using the :func:`next` built-in function; this example shows how it all works::
it_it: Questo stile di accesso è chiaro, conciso e conveniente. L'uso degli iteratori permea e unifica Python. Dietro le quinte, l'istruzione :keyword:`for` chiama la funzione :func:`iter` sull'oggetto contenitore. La funzione restituisce un oggetto iteratore che definisce il metodo :meth:`~iterator.__next__` che accede agli elementi del contenitore uno alla volta. Quando non ci sono più elementi, :meth:`~iterator.__next__` solleva un'eccezione :exc:`StopIteration` che indica al ciclo :keyword:`!for` di terminare. Puoi chiamare il metodo :meth:`~iterator.__next__` utilizzando la funzione built-in :func:`next`; questo esempio mostra come funziona tutto::

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`~container.__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`!__next__`, then :meth:`!__iter__` can just return ``self``::
it_it: Avendo visto la meccanica dietro il protocollo dell'iteratore, è facile aggiungere il comportamento di iteratore alle tue classi. Definisci un metodo :meth:`~container.__iter__` che restituisce un oggetto con un metodo :meth:`~iterator.__next__`. Se la classe definisce :meth:`!__next__`, allora :meth:`!__iter__` può semplicemente restituire ``self``::

source: Generators
it_it: Generatori

source: :term:`Generators <generator>` are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
it_it: I :term:`generatori <generator>` sono uno strumento semplice e potente per creare iteratori. Sono scritti come funzioni regolari ma utilizzano l'istruzione :keyword:`yield` ogni volta che vogliono restituire dati. Ogni volta che si chiama :func:`next` su di esso, il generatore riprende da dove si era interrotto (ricorda tutti i valori dei dati e quale istruzione è stata eseguita per ultima). Un esempio mostra che i generatori possono essere creati con estrema facilità::

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`~iterator.__iter__` and :meth:`~generator.__next__` methods are created automatically.
it_it: Tutto ciò che può essere fatto con i generatori può essere fatto anche con gli iteratori basati su classi come descritto nella sezione precedente. Ciò che rende i generatori così compatti è che i metodi :meth:`~iterator.__iter__` e :meth:`~generator.__next__` sono creati automaticamente.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
it_it: Un'altra caratteristica chiave è che le variabili locali e lo stato di esecuzione sono salvati automaticamente tra le chiamate. Questo rende la funzione più facile da scrivere e molto più chiara rispetto a un approccio che utilizza variabili di istanza come ``self.index`` e ``self.data``.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
it_it: Oltre alla creazione automatica dei metodi e al salvataggio dello stato del programma, quando i generatori terminano, sollevano automaticamente :exc:`StopIteration`. In combinazione, queste caratteristiche rendono facile creare iteratori con lo stesso sforzo di scrivere una funzione regolare.

source: Generator Expressions
it_it: Espressioni di Generatore

source: Some simple generators can be coded succinctly as expressions using a syntax similar to list comprehensions but with parentheses instead of square brackets. These expressions are designed for situations where the generator is used right away by an enclosing function. Generator expressions are more compact but less versatile than full generator definitions and tend to be more memory friendly than equivalent list comprehensions.
it_it: Alcuni generatori semplici possono essere codificati in modo conciso come espressioni utilizzando una sintassi simile alle comprensioni di lista ma con parentesi tonde anziché quadre. Queste espressioni sono progettate per situazioni in cui il generatore viene utilizzato immediatamente da una funzione racchiudente. Le espressioni di generatore sono più compatte ma meno versatili rispetto alle definizioni complete di generatore e tendono a essere più efficienti in termini di memoria rispetto alle comprensioni di lista equivalenti.

source: Examples::
it_it: Esempi::

source: Footnotes
it_it: Note a piè di pagina

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`~object.__dict__` which returns the dictionary used to implement the module's namespace; the name :attr:`~object.__dict__` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
it_it: Tranne per una cosa. Gli oggetti modulo hanno un attributo segreto di sola lettura chiamato :attr:`~object.__dict__` che restituisce il dizionario usato per implementare lo spazio dei nomi del modulo; il nome :attr:`~object.__dict__` è un attributo ma non un nome globale. Ovviamente, l'uso di questo violerebbe l'astrazione dell'implementazione dello spazio dei nomi e dovrebbe essere limitato a cose come debugger post-mortem.

source: object
it_it: oggetto

source: method
it_it: metodo

source: name
it_it: nome

source: mangling
it_it: offuscamento
