Repository: Addivsyou/python-docs-it
Catalog: tutorial/classes.po
Languages: it_it

source: Classes
it_it: Classi

source: Classes provide a means of bundling data and functionality together. Creating a new class creates a new *type* of object, allowing new *instances* of that type to be made. Each class instance can have attributes attached to it for maintaining its state. Class instances can also have methods (defined by its class) for modifying its state.
it_it: Le classi forniscono un mezzo per raggruppare dati e funzionalità insieme. Creare una nuova classe crea un nuovo *tipo* di oggetto, consentendo la creazione di nuove *istanze* di quel tipo. Ogni istanza di classe può avere attributi ad essa associati per mantenere il suo stato. Le istanze di classe possono anche avere metodi (definiti dalla sua classe) per modificarne lo stato.

source: Compared with other programming languages, Python's class mechanism adds classes with a minimum of new syntax and semantics. It is a mixture of the class mechanisms found in C++ and Modula-3. Python classes provide all the standard features of Object Oriented Programming: the class inheritance mechanism allows multiple base classes, a derived class can override any methods of its base class or classes, and a method can call the method of a base class with the same name. Objects can contain arbitrary amounts and kinds of data. As is true for modules, classes partake of the dynamic nature of Python: they are created at runtime, and can be modified further after creation.
it_it: Rispetto ad altri linguaggi di programmazione, il meccanismo delle classi di Python aggiunge classi con un minimo di nuova sintassi e semantica. È un misto dei meccanismi di classe trovati in C++ e Modula-3. Le classi Python forniscono tutte le funzionalità standard della programmazione orientata agli oggetti: il meccanismo di ereditarietà delle classi consente più classi di base, una classe derivata può sovrascrivere qualsiasi metodo della sua classe base o classi, e un metodo può chiamare il metodo di una classe di base con lo stesso nome. Gli oggetti possono contenere quantità e tipi di dati arbitrari. Come è vero per i moduli, le classi partecipano alla natura dinamica di Python: sono create a tempo di esecuzione e possono essere modificate ulteriormente dopo la creazione.

source: In C++ terminology, normally class members (including the data members) are *public* (except see below :ref:`tut-private`), and all member functions are *virtual*. As in Modula-3, there are no shorthands for referencing the object's members from its methods: the method function is declared with an explicit first argument representing the object, which is provided implicitly by the call. As in Smalltalk, classes themselves are objects. This provides semantics for importing and renaming. Unlike C++ and Modula-3, built-in types can be used as base classes for extension by the user. Also, like in C++, most built-in operators with special syntax (arithmetic operators, subscripting etc.) can be redefined for class instances.
it_it: Nella terminologia di C++, normalmente i membri della classe (compresi i membri dei dati) sono *pubblici* (tranne vedere sotto :ref:`tut-private`), e tutte le funzioni membro sono *virtuali*. Come in Modula-3, non ci sono abbreviazioni per fare riferimento ai membri dell'oggetto dai suoi metodi: la funzione del metodo è dichiarata con un primo argomento esplicito che rappresenta l'oggetto, che è fornito implicitamente dalla chiamata. Come in Smalltalk, le classi stesse sono oggetti. Questo fornisce la semantica per l'importazione e il ridenominare. A differenza di C++ e Modula-3, i tipi integrati possono essere utilizzati come classi di base per l'estensione da parte dell'utente. Inoltre, come in C++, la maggior parte degli operatori integrati con una sintassi speciale (operatori aritmetici, indicizzazione ecc.) possono essere ridefiniti per le istanze della classe.

source: (Lacking universally accepted terminology to talk about classes, I will make occasional use of Smalltalk and C++ terms. I would use Modula-3 terms, since its object-oriented semantics are closer to those of Python than C++, but I expect that few readers have heard of it.)
it_it: (Mancando una terminologia universalmente accettata per parlare di classi, farò un uso occasionale dei termini Smalltalk e C++. Utilizzerei i termini di Modula-3, poiché la sua semantica orientata agli oggetti è più vicina a quella di Python rispetto a C++, ma mi aspetto che pochi lettori ne abbiano sentito parlare.)

source: A Word About Names and Objects
it_it: Una parola su nomi e oggetti

source: Objects have individuality, and multiple names (in multiple scopes) can be bound to the same object. This is known as aliasing in other languages. This is usually not appreciated on a first glance at Python, and can be safely ignored when dealing with immutable basic types (numbers, strings, tuples). However, aliasing has a possibly surprising effect on the semantics of Python code involving mutable objects such as lists, dictionaries, and most other types. This is usually used to the benefit of the program, since aliases behave like pointers in some respects. For example, passing an object is cheap since only a pointer is passed by the implementation; and if a function modifies an object passed as an argument, the caller will see the change --- this eliminates the need for two different argument passing mechanisms as in Pascal.
it_it: Gli oggetti hanno individualità e più nomi (in più ambiti) possono essere vincolati allo stesso oggetto. Questo è noto come aliasing in altri linguaggi. Questo di solito non è apprezzato a una prima occhiata a Python e può essere tranquillamente ignorato quando si tratta di tipi di base immutabili (numeri, stringhe, tuple). Tuttavia, l'aliasing ha un effetto possibilmente sorprendente sulla semantica del codice Python che coinvolge oggetti mutabili come liste, dizionari e la maggior parte degli altri tipi. Questo è di solito usato a vantaggio del programma, poiché gli alias si comportano come puntatori in alcuni aspetti. Ad esempio, passare un oggetto è economico poiché viene passato solo un puntatore dall'implementazione; e se una funzione modifica un oggetto passato come argomento, il chiamante vedrà il cambiamento --- questo elimina la necessità di due diversi meccanismi di passaggio degli argomenti come in Pascal.

source: Python Scopes and Namespaces
it_it: Visibilità e spazi dei nomi in Python

source: Before introducing classes, I first have to tell you something about Python's scope rules. Class definitions play some neat tricks with namespaces, and you need to know how scopes and namespaces work to fully understand what's going on. Incidentally, knowledge about this subject is useful for any advanced Python programmer.
it_it: Prima di introdurre le classi, devo prima dirti qualcosa sulle regole di visibilità di Python. Le definizioni di classe fanno alcuni trucchi interessanti con gli spazi dei nomi e devi sapere come funzionano le visibilità e gli spazi dei nomi per capire appieno cosa sta succedendo. Per inciso, la conoscenza su questo argomento è utile per qualsiasi programmatore Python avanzato.

source: Let's begin with some definitions.
it_it: Iniziamo con alcune definizioni.

source: A *namespace* is a mapping from names to objects. Most namespaces are currently implemented as Python dictionaries, but that's normally not noticeable in any way (except for performance), and it may change in the future. Examples of namespaces are: the set of built-in names (containing functions such as :func:`abs`, and built-in exception names); the global names in a module; and the local names in a function invocation. In a sense the set of attributes of an object also form a namespace. The important thing to know about namespaces is that there is absolutely no relation between names in different namespaces; for instance, two different modules may both define a function ``maximize`` without confusion --- users of the modules must prefix it with the module name.
it_it: Uno *spazio dei nomi* è una mappatura da nomi a oggetti. La maggior parte degli spazi dei nomi è attualmente implementata come dizionari Python, ma normalmente non è percepibile in alcun modo (tranne per le prestazioni) e potrebbe cambiare in futuro. Esempi di spazi dei nomi sono: l'insieme di nomi integrati (contenente funzioni come :func:`abs` e nomi di eccezioni integrate); i nomi globali in un modulo; e i nomi locali in una chiamata di funzione. In un certo senso, l'insieme di attributi di un oggetto forma anche uno spazio dei nomi. La cosa importante da sapere sugli spazi dei nomi è che non c'è assolutamente alcuna relazione tra nomi in spazi dei nomi diversi; ad esempio, due moduli diversi possono entrambi definire una funzione ``massimizza`` senza confusione --- gli utenti dei moduli devono prefissarlo con il nome del modulo.

source: By the way, I use the word *attribute* for any name following a dot --- for example, in the expression ``z.real``, ``real`` is an attribute of the object ``z``. Strictly speaking, references to names in modules are attribute references: in the expression ``modname.funcname``, ``modname`` is a module object and ``funcname`` is an attribute of it. In this case there happens to be a straightforward mapping between the module's attributes and the global names defined in the module: they share the same namespace! [#]_
it_it: A proposito, uso la parola *attributo* per qualsiasi nome che segue un punto --- ad esempio, nell'espressione ``z.reale``, ``reale`` è un attributo dell'oggetto ``z``. Più precisamente, i riferimenti ai nomi nei moduli sono riferimenti agli attributi: nell'espressione ``nomemodulo.nomefunzione``, ``nomemodulo`` è un oggetto modulo e ``nomefunzione`` è un suo attributo. In questo caso c'è una corrispondenza diretta tra gli attributi del modulo e i nomi globali definiti nel modulo: condividono lo stesso spazio dei nomi! [#]_

source: Attributes may be read-only or writable. In the latter case, assignment to attributes is possible. Module attributes are writable: you can write ``modname.the_answer = 42``. Writable attributes may also be deleted with the :keyword:`del` statement. For example, ``del modname.the_answer`` will remove the attribute :attr:`!the_answer` from the object named by ``modname``.
it_it: Gli attributi possono essere di sola lettura o scrivibili. In quest'ultimo caso, l'assegnazione agli attributi è possibile. Gli attributi del modulo sono scrivibili: puoi scrivere ``nomemodulo.larisposta = 42``. Gli attributi scrivibili possono anche essere eliminati con l'istruzione :keyword:`del`. Ad esempio, ``del nomemodulo.larisposta`` rimuoverà l'attributo :attr:`!larisposta` dall'oggetto denominato da ``nomemodulo``.

source: Namespaces are created at different moments and have different lifetimes. The namespace containing the built-in names is created when the Python interpreter starts up, and is never deleted. The global namespace for a module is created when the module definition is read in; normally, module namespaces also last until the interpreter quits. The statements executed by the top-level invocation of the interpreter, either read from a script file or interactively, are considered part of a module called :mod:`__main__`, so they have their own global namespace. (The built-in names actually also live in a module; this is called :mod:`builtins`.)
it_it: Gli spazi dei nomi sono creati in momenti diversi e hanno durate diverse. Lo spazio dei nomi che contiene i nomi integrati è creato quando l'interprete Python si avvia e non viene mai eliminato. Lo spazio dei nomi globale per un modulo è creato quando la definizione del modulo viene letta; normalmente, gli spazi dei nomi dei moduli durano anche fino a quando l'interprete non si arresta. Le istruzioni eseguite dall'invocazione di livello superiore dell'interprete, lette da un file di script o interattivamente, sono considerate parte di un modulo chiamato :mod:`__main__`, quindi hanno il loro proprio spazio dei nomi globale. (I nomi integrati in realtà vivono anche in un modulo; questo si chiama :mod:`builtins`.)

source: The local namespace for a function is created when the function is called, and deleted when the function returns or raises an exception that is not handled within the function. (Actually, forgetting would be a better way to describe what actually happens.) Of course, recursive invocations each have their own local namespace.
it_it: Lo spazio dei nomi locale per una funzione è creato quando la funzione viene chiamata e eliminato quando la funzione restituisce o genera un'eccezione che non viene gestita all'interno della funzione. (In realtà, dimenticare sarebbe un modo migliore per descrivere ciò che accade effettivamente.) Naturalmente, le invocazioni ricorsive hanno ciascuna il proprio spazio dei nomi locale.

source: A *scope* is a textual region of a Python program where a namespace is directly accessible. "Directly accessible" here means that an unqualified reference to a name attempts to find the name in the namespace.
it_it: Uno *scope* è una regione testuale di un programma Python in cui uno spazio dei nomi è direttamente accessibile. "Direttamente accessibile" qui significa che un riferimento non qualificato a un nome tenta di trovare il nome nello spazio dei nomi.

source: Although scopes are determined statically, they are used dynamically. At any time during execution, there are 3 or 4 nested scopes whose namespaces are directly accessible:
it_it: Anche se gli scope sono determinati staticamente, vengono utilizzati dinamicamente. In qualsiasi momento durante l'esecuzione, ci sono 3 o 4 scope annidati i cui spazi dei nomi sono direttamente accessibili:

source: the innermost scope, which is searched first, contains the local names
it_it: lo scope più interno, che viene cercato per primo, contiene i nomi locali

source: the scopes of any enclosing functions, which are searched starting with the nearest enclosing scope, contain non-local, but also non-global names
it_it: gli scope di eventuali funzioni contenenti, che vengono cercati a partire dallo scope contenente più vicino, contengono nomi non locali, ma anche non globali

source: the next-to-last scope contains the current module's global names
it_it: il penultimo scope contiene i nomi globali del modulo corrente

source: the outermost scope (searched last) is the namespace containing built-in names
it_it: lo scope più esterno (cercato per ultimo) è lo spazio dei nomi che contiene i nomi integrati

source: If a name is declared global, then all references and assignments go directly to the next-to-last scope containing the module's global names. To rebind variables found outside of the innermost scope, the :keyword:`nonlocal` statement can be used; if not declared nonlocal, those variables are read-only (an attempt to write to such a variable will simply create a *new* local variable in the innermost scope, leaving the identically named outer variable unchanged).
it_it: Se un nome è dichiarato globale, allora tutti i riferimenti e le assegnazioni vanno direttamente allo scope penultimo contenente i nomi globali del modulo. Per rilegare le variabili trovate al di fuori dello scope più interno, può essere utilizzata l'istruzione :keyword:`nonlocal`; se non dichiarate nonlocal, quelle variabili sono di sola lettura (un tentativo di scrivere su una variabile del genere creerà semplicemente una *nuova* variabile locale nello scope più interno, lasciando invariata la variabile esterna con lo stesso nome).

source: Usually, the local scope references the local names of the (textually) current function. Outside functions, the local scope references the same namespace as the global scope: the module's namespace. Class definitions place yet another namespace in the local scope.
it_it: Di solito, lo scope locale fa riferimento ai nomi locali della funzione (testualmente) corrente. Al di fuori delle funzioni, lo scope locale fa riferimento allo stesso spazio dei nomi dello scope globale: lo spazio dei nomi del modulo. Le definizioni di classe pongono un altro spazio dei nomi nello scope locale.

source: It is important to realize that scopes are determined textually: the global scope of a function defined in a module is that module's namespace, no matter from where or by what alias the function is called. On the other hand, the actual search for names is done dynamically, at run time --- however, the language definition is evolving towards static name resolution, at "compile" time, so don't rely on dynamic name resolution! (In fact, local variables are already determined statically.)
it_it: È importante rendersi conto che gli scope sono determinati testualmente: lo scope globale di una funzione definita in un modulo è lo spazio dei nomi del modulo, non importa da dove o con quale alias la funzione viene chiamata. D'altra parte, la ricerca effettiva dei nomi viene fatta dinamicamente, a tempo di esecuzione --- tuttavia, la definizione del linguaggio sta evolvendo verso la risoluzione statica dei nomi, a tempo di "compilazione", quindi non fare affidamento sulla risoluzione dinamica dei nomi! (Infatti, le variabili locali sono già determinate staticamente.)

source: A special quirk of Python is that -- if no :keyword:`global` or :keyword:`nonlocal` statement is in effect -- assignments to names always go into the innermost scope. Assignments do not copy data --- they just bind names to objects. The same is true for deletions: the statement ``del x`` removes the binding of ``x`` from the namespace referenced by the local scope. In fact, all operations that introduce new names use the local scope: in particular, :keyword:`import` statements and function definitions bind the module or function name in the local scope.
it_it: Una particolarità speciale di Python è che -- se non è in vigore alcuna istruzione :keyword:`global` o :keyword:`nonlocal` -- le assegnazioni ai nomi vanno sempre nello scope più interno. Le assegnazioni non copiano i dati --- vincolano solo i nomi agli oggetti. Lo stesso vale per le eliminazioni: l'istruzione ``del x`` rimuove il vincolo di ``x`` dallo spazio dei nomi riferito dallo scope locale. In realtà, tutte le operazioni che introducono nuovi nomi utilizzano lo scope locale: in particolare, le istruzioni :keyword:`import` e le definizioni di funzioni vincolano il nome del modulo o della funzione nello scope locale.

source: The :keyword:`global` statement can be used to indicate that particular variables live in the global scope and should be rebound there; the :keyword:`nonlocal` statement indicates that particular variables live in an enclosing scope and should be rebound there.
it_it: L'istruzione :keyword:`global` può essere utilizzata per indicare che particolari variabili vivono nello scope globale e dovrebbero essere rilegate lì; l'istruzione :keyword:`nonlocal` indica che particolari variabili vivono in uno scope circoscritto e dovrebbero essere rilegate lì.

source: Scopes and Namespaces Example
it_it: Esempio di visibilità e spazi dei nomi

source: This is an example demonstrating how to reference the different scopes and namespaces, and how :keyword:`global` and :keyword:`nonlocal` affect variable binding::
it_it: Questo è un esempio che dimostra come fare riferimento ai diversi scope e spazi dei nomi e come :keyword:`global` e :keyword:`nonlocal` influenzano il vincolo delle variabili::

source: The output of the example code is:
it_it: L'output del codice di esempio è:

source: Note how the *local* assignment (which is default) didn't change *scope_test*\'s binding of *spam*. The :keyword:`nonlocal` assignment changed *scope_test*\'s binding of *spam*, and the :keyword:`global` assignment changed the module-level binding.
it_it: Nota come l'assegnazione *locale* (che è predefinita) non abbia cambiato il vincolo di *spam* di *scope_test*. L'assegnazione :keyword:`nonlocal` ha cambiato il vincolo di *spam* di *scope_test* e l'assegnazione :keyword:`global` ha cambiato il vincolo a livello di modulo.

source: You can also see that there was no previous binding for *spam* before the :keyword:`global` assignment.
it_it: Si può anche vedere che non c'era alcun vincolo precedente per *spam* prima dell'assegnazione :keyword:`global`.

source: A First Look at Classes
it_it: Una prima occhiata alle classi

source: Classes introduce a little bit of new syntax, three new object types, and some new semantics.
it_it: Le classi introducono un po' di nuova sintassi, tre nuovi tipi di oggetti e alcune nuove semantiche.

source: Class Definition Syntax
it_it: Sintassi della definizione di classe

source: The simplest form of class definition looks like this::
it_it: La forma più semplice di definizione di classe appare così::

source: Class definitions, like function definitions (:keyword:`def` statements) must be executed before they have any effect. (You could conceivably place a class definition in a branch of an :keyword:`if` statement, or inside a function.)
it_it: Le definizioni di classe, come le definizioni di funzione (istruzioni :keyword:`def`), devono essere eseguite prima di avere effetto. (Potresti concepibilmente collocare una definizione di classe in un ramo di un'istruzione :keyword:`if` o all'interno di una funzione.)

source: In practice, the statements inside a class definition will usually be function definitions, but other statements are allowed, and sometimes useful --- we'll come back to this later. The function definitions inside a class normally have a peculiar form of argument list, dictated by the calling conventions for methods --- again, this is explained later.
it_it: In pratica, le istruzioni all'interno di una definizione di classe saranno solitamente definizioni di funzioni, ma sono ammesse e talvolta utili --- torneremo su questo più tardi. Le definizioni di funzioni all'interno di una classe hanno normalmente una forma peculiare di elenco degli argomenti, dettata dalle convenzioni di chiamata per i metodi --- anche questo è spiegato più tardi.

source: When a class definition is entered, a new namespace is created, and used as the local scope --- thus, all assignments to local variables go into this new namespace. In particular, function definitions bind the name of the new function here.
it_it: Quando una definizione di classe viene inserita, viene creato un nuovo spazio dei nomi e utilizzato come scope locale --- quindi, tutte le assegnazioni alle variabili locali vanno in questo nuovo spazio dei nomi. In particolare, qui le definizioni di funzioni vincolano il nome della nuova funzione.

source: When a class definition is left normally (via the end), a *class object* is created. This is basically a wrapper around the contents of the namespace created by the class definition; we'll learn more about class objects in the next section. The original local scope (the one in effect just before the class definition was entered) is reinstated, and the class object is bound here to the class name given in the class definition header (:class:`!ClassName` in the example).
it_it: Quando una definizione di classe viene lasciata normalmente (tramite la fine), viene creato un *oggetto classe*. Questo è essenzialmente un wrapper attorno ai contenuti dello spazio dei nomi creato dalla definizione di classe; impareremo di più sugli oggetti classe nella sezione successiva. Lo scope locale originale (quello in vigore appena prima che la definizione di classe fosse inserita) viene ripristinato e l'oggetto classe è vincolato qui al nome della classe dato dall'intestazione della definizione di classe (:class:`!NomeClasse` nell'esempio).

source: Class Objects
it_it: Oggetti della Classe
