Repository: Addivsyou/python-docs-it
Catalog: tutorial/classes.po
Languages: it_it

source: Class objects support two kinds of operations: attribute references and instantiation.
it_it: Gli oggetti della classe supportano due tipi di operazioni: riferimenti agli attributi e istanziazione.

source: *Attribute references* use the standard syntax used for all attribute references in Python: ``obj.name``. Valid attribute names are all the names that were in the class's namespace when the class object was created. So, if the class definition looked like this::
it_it: I *riferimenti agli attributi* utilizzano la sintassi standard utilizzata per tutti i riferimenti agli attributi in Python: ``oggetto.nome``. I nomi degli attributi validi sono tutti i nomi che erano nello spazio dei nomi della classe quando l'oggetto classe è stato creato. Quindi, se la definizione della classe apparisse così::

source: then ``MyClass.i`` and ``MyClass.f`` are valid attribute references, returning an integer and a function object, respectively. Class attributes can also be assigned to, so you can change the value of ``MyClass.i`` by assignment. :attr:`!__doc__` is also a valid attribute, returning the docstring belonging to the class: ``"A simple example class"``.
it_it: allora ``MyClass.i`` e ``MyClass.f`` sono riferimenti agli attributi validi, restituendo rispettivamente un intero e un oggetto funzione. Gli attributi di classe possono anche essere assegnati, quindi puoi cambiare il valore di ``MyClass.i`` per assegnazione. :attr:`!__doc__` è anche un attributo valido, restituendo la stringa di documentazione appartenente alla classe: ``"Una classe di esempio semplice"``.

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
it_it: L'*istanziamento* della classe utilizza la notazione funzionale. Basta immaginare che l'oggetto classe sia una funzione senza parametri che restituisce una nuova istanza della classe. Per esempio (assumendo la classe sopra menzionata)::

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
it_it: crea una nuova *istanza* della classe e assegna questo oggetto alla variabile locale ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`~object.__init__`, like this::
it_it: L'operazione di istanziazione ("chiamare" un oggetto classe) crea un oggetto vuoto. Molte classi preferiscono creare oggetti con istanze personalizzate per uno stato iniziale specifico. Pertanto, una classe può definire un metodo speciale chiamato :meth:`~object.__init__`, come questo::

source: When a class defines an :meth:`~object.__init__` method, class instantiation automatically invokes :meth:`!__init__` for the newly created class instance. So in this example, a new, initialized instance can be obtained by::
it_it: Quando una classe definisce un metodo :meth:`~object.__init__`, l'istanziamento della classe invoca automaticamente :meth:`!__init__` per la nuova istanza della classe creata. Quindi, in questo esempio, una nuova istanza inizializzata può essere ottenuta con::

source: Of course, the :meth:`~object.__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`!__init__`. For example, ::
it_it: Ovviamente, il metodo :meth:`~object.__init__` può avere argomenti per una maggiore flessibilità. In tal caso, gli argomenti forniti all'operatore di istanziazione della classe vengono passati a :meth:`!__init__`. Per esempio, ::

source: Instance Objects
it_it: Oggetti Istanza

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names: data attributes and methods.
it_it: Ora, cosa possiamo fare con gli oggetti istanza? Le uniche operazioni comprese dagli oggetti istanza sono i riferimenti agli attributi. Ci sono due tipi di nomi di attributi validi: attributi dati e metodi.

source: *data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`!MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
it_it: Gli *attributi dati* corrispondono alle "variabili di istanza" in Smalltalk, e ai "membri dati" in C++. Gli attributi dati non devono essere dichiarati; come le variabili locali, nascono nel momento in cui vengono assegnati per la prima volta. Per esempio, se ``x`` è l'istanza di :class:`!MyClass` creata sopra, il seguente pezzo di codice stamperà il valore ``16``, senza lasciare traccia::

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object. (In Python, the term method is not unique to class instances: other object types can have methods as well. For example, list objects have methods called append, insert, remove, sort, and so on. However, in the following discussion, we'll use the term method exclusively to mean methods of class instance objects, unless explicitly stated otherwise.)
it_it: L'altro tipo di riferimento agli attributi dell'istanza è un *metodo*. Un metodo è una funzione che "appartiene a" un oggetto. (In Python, il termine metodo non è unico per le istanze di classe: altri tipi di oggetti possono avere metodi. Ad esempio, gli oggetti lista hanno metodi chiamati append, insert, remove, sort, e così via. Tuttavia, nella discussione che segue, useremo il termine metodo esclusivamente per indicare i metodi degli oggetti istanza di classe, a meno che non sia esplicitamente dichiarato diversamente.)

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
it_it: I nomi dei metodi validi di un oggetto istanza dipendono dalla sua classe. Per definizione, tutti gli attributi di una classe che sono oggetti funzione definiscono i metodi corrispondenti delle sue istanze. Quindi nel nostro esempio, ``x.f`` è un riferimento a un metodo valido, poiché ``MyClass.f`` è una funzione, ma ``x.i`` no, poiché ``MyClass.i`` non lo è. Tuttavia, ``x.f`` non è la stessa cosa di ``MyClass.f`` --- è un *oggetto metodo*, non un oggetto funzione.

source: Method Objects
it_it: Oggetti Metodo

source: Usually, a method is called right after it is bound::
it_it: Di solito, un metodo viene chiamato subito dopo essere stato associato::

source: In the :class:`!MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
it_it: Nell'esempio :class:`!MyClass`, questo restituirà la stringa ``'hello world'``. Tuttavia, non è necessario chiamare un metodo subito: ``x.f`` è un oggetto metodo e può essere memorizzato e chiamato in un secondo momento. Per esempio::

source: will continue to print ``hello world`` until the end of time.
it_it: continuerà a stampare ``hello world`` fino alla fine dei tempi.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`!f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
it_it: Cosa succede esattamente quando un metodo viene chiamato? Potreste aver notato che ``x.f()`` è stato chiamato senza argomento sopra, anche se la definizione della funzione per :meth:`!f` specifica un argomento. Che fine ha fatto l'argomento? Sicuramente Python solleva un'eccezione quando una funzione che richiede un argomento viene chiamata senza alcuno --- anche se l'argomento non è effettivamente usato...

source: Actually, you may have guessed the answer: the special thing about methods is that the instance object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's instance object before the first argument.
it_it: In realtà, potreste aver indovinato la risposta: la caratteristica speciale dei metodi è che l'istanza dell'oggetto viene passata come primo argomento della funzione. Nel nostro esempio, la chiamata ``x.f()`` è esattamente equivalente a ``MyClass.f(x)``. In generale, chiamare un metodo con una lista di *n* argomenti è equivalente a chiamare la funzione corrispondente con una lista di argomenti creata inserendo l'istanza del metodo prima del primo argomento.

source: In general, methods work as follows. When a non-data attribute of an instance is referenced, the instance's class is searched. If the name denotes a valid class attribute that is a function object, references to both the instance object and the function object are packed into a method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
it_it: In generale, i metodi funzionano come segue. Quando viene referenziato un attributo non dato di un'istanza, viene cercata la classe dell'istanza. Se il nome denota un attributo di classe valido che è un oggetto funzione, i riferimenti all'istanza dell'oggetto e all'oggetto funzione vengono impacchettati in un oggetto metodo. Quando l'oggetto metodo viene chiamato con una lista di argomenti, viene costruita una nuova lista di argomenti dall'istanza dell'oggetto e la lista degli argomenti, e l'oggetto funzione viene chiamato con questa nuova lista di argomenti.

source: Class and Instance Variables
it_it: Variabili di Classe e Istanza

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
it_it: Generalmente parlando, le variabili di istanza sono per i dati unici a ciascuna istanza e le variabili di classe sono per gli attributi e i metodi condivisi da tutte le istanze della classe::

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
it_it: Come discusso in :ref:`tut-object`, i dati condivisi possono avere effetti potenzialmente sorprendenti coinvolgendo oggetti :term:`mutable` come liste e dizionari. Per esempio, la lista *tricks* nel seguente codice non dovrebbe essere usata come variabile di classe perché solo una singola lista verrebbe condivisa da tutte le istanze di *Dog*::

source: Correct design of the class should use an instance variable instead::
it_it: Il design corretto della classe dovrebbe usare una variabile di istanza invece::

source: Random Remarks
it_it: Osservazioni Varie

source: If the same attribute name occurs in both an instance and in a class, then attribute lookup prioritizes the instance::
it_it: Se lo stesso nome di attributo appare sia in un'istanza che in una classe, la ricerca degli attributi dà priorità all'istanza::

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
it_it: Gli attributi dati possono essere referenziati dai metodi così come dagli utenti ordinari ("clienti") di un oggetto. In altre parole, le classi non sono utilizzabili per implementare tipi di dati astratti puri. Infatti, nulla in Python permette di imporre l'incapsulamento dei dati --- è tutto basato su convenzioni. (D'altra parte, l'implementazione di Python, scritta in C, può nascondere completamente i dettagli di implementazione e controllare l'accesso a un oggetto se necessario; questo può essere utilizzato dalle estensioni a Python scritte in C.)

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
it_it: I clienti dovrebbero usare gli attributi dati con cautela --- i clienti potrebbero infrangere gli invarianti mantenuti dai metodi alterando i loro attributi dati. Si noti che i clienti possono aggiungere attributi dati propri a un oggetto istanza senza influenzare la validità dei metodi, purché vengano evitati conflitti di nomi --- ancora una volta, una convenzione di nomenclatura può risparmiare molti mal di testa.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
it_it: Non c'è alcuna scorciatoia per riferirsi agli attributi dati (o ad altri metodi!) dall'interno dei metodi. Trovo che questo in realtà aumenti la leggibilità dei metodi: non c'è possibilità di confondere variabili locali e variabili di istanza quando si scorre un metodo.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
it_it: Spesso, il primo argomento di un metodo è chiamato ``self``. Questa è niente più che una convenzione: il nome ``self`` non ha assolutamente alcun significato speciale per Python. Tieni presente, tuttavia, che non seguire la convenzione potrebbe rendere il tuo codice meno leggibile per altri programmatori Python, e non è nemmeno impossibile che venga scritto un programma *class browser* che si basa su tale convenzione.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
it_it: Qualsiasi oggetto funzione che è un attributo di classe definisce un metodo per le istanze di quella classe. Non è necessario che la definizione della funzione sia testualmente inclusa nella definizione della classe: è anche possibile assegnare un oggetto funzione a una variabile locale nella classe. Per esempio::

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`!C` that refer to function objects, and consequently they are all methods of instances of :class:`!C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
it_it: Ora ``f``, ``g`` e ``h`` sono tutti attributi della classe :class:`!C` che si riferiscono a oggetti funzione, e di conseguenza sono tutti metodi delle istanze della classe :class:`!C` --- ``h`` essendo esattamente equivalente a ``g``. Si noti che questa pratica di solito solo serve a confondere il lettore di un programma.

source: Methods may call other methods by using method attributes of the ``self`` argument::
it_it: I metodi possono chiamare altri metodi utilizzando gli attributi di metodo dell'argomento ``self``::

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
it_it: I metodi possono referenziare nomi globali allo stesso modo delle funzioni ordinarie. Lo scope globale associato a un metodo è il modulo contenente la sua definizione. (Una classe non è mai utilizzata come uno scope globale.) Sebbene raramente si incontri una buona ragione per usare dati globali in un metodo, ci sono molti usi legittimi dello scope globale: ad esempio, le funzioni e i moduli importati nello scope globale possono essere utilizzati dai metodi, così come le funzioni e le classi definite in esso. Di solito, la classe contenente il metodo è definita anch'essa in tale scope globale, e nella sezione successiva troveremo alcune buone ragioni per cui un metodo potrebbe voler referenziare la propria classe.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
it_it: Ogni valore è un oggetto e quindi ha una *classe* (chiamata anche il suo *tipo*). È memorizzato come ``object.__class__``.

source: Inheritance
it_it: Ereditarietà

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
it_it: Naturalmente, una caratteristica del linguaggio non sarebbe degna del nome "classe" senza supportare l'ereditarietà. La sintassi per la definizione di una classe derivata è simile::

source: The name :class:`!BaseClassName` must be defined in a namespace accessible from the scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
it_it: Il nome :class:`!BaseClassName` deve essere definito in uno spazio dei nomi accessibile dallo scope contenente la definizione della classe derivata. Al posto di un nome di classe base, sono permesse anche altre espressioni arbitrarie. Questo può essere utile, per esempio, quando la classe base è definita in un altro modulo::

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
it_it: L'esecuzione di una definizione di classe derivata procede nello stesso modo di una classe base. Quando viene costruito l'oggetto classe, viene ricordata la classe base. Questo viene utilizzato per risolvere i riferimenti agli attributi: se un attributo richiesto non è trovato nella classe, la ricerca procede a cercarlo nella classe base. Questa regola viene applicata ricorsivamente se la classe base stessa è derivata da un'altra classe.

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
it_it: Non c'è nulla di speciale nell'istanza di classi derivate: ``DerivedClassName()`` crea una nuova istanza della classe. I riferimenti ai metodi vengono risolti come segue: viene cercato l'attributo di classe corrispondente, scendendo lungo la catena delle classi base se necessario, e il riferimento al metodo è valido se questo produce un oggetto funzione.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
it_it: Le classi derivate possono ignorare i metodi delle loro classi base. Poiché i metodi non hanno privilegi speciali quando chiamano altri metodi dello stesso oggetto, un metodo di una classe base che chiama un altro metodo definito nella stessa classe base può finire per chiamare un metodo di una classe derivata che lo sostituisce. (Per programmatori C++: tutti i metodi in Python sono effettivamente ``virtual``.)

source: An overriding method in a derived class may in fact want to extend rather than simply replace the base class method of the same name. There is a simple way to call the base class method directly: just call ``BaseClassName.methodname(self, arguments)``. This is occasionally useful to clients as well. (Note that this only works if the base class is accessible as ``BaseClassName`` in the global scope.)
it_it: Un metodo sovrascritto in una classe derivata può in realtà voler estendere piuttosto che semplicemente sostituire il metodo della classe base con lo stesso nome. C'è un modo semplice per chiamare direttamente il metodo della classe base: basta chiamare ``BaseClassName.methodname(self, arguments)``. Questo è occasionalmente utile anche per i clienti. (Si noti che questo funziona solo se la classe base è accessibile come ``BaseClassName`` nello scope globale.)

source: Python has two built-in functions that work with inheritance:
it_it: Python ha due funzioni built-in che funzionano con l'ereditarietà:

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
it_it: Usa :func:`isinstance` per controllare il tipo di un'istanza: ``isinstance(obj, int)`` sarà ``True`` solo se ``obj.__class__`` è :class:`int` o una classe derivata da :class:`int`.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
it_it: Usa :func:`issubclass` per controllare l'ereditarietà delle classi: ``issubclass(bool, int)`` è ``True`` poiché :class:`bool` è una sottoclasse di :class:`int`. Tuttavia, ``issubclass(float, int)`` è ``False`` poiché :class:`float` non è una sottoclasse di :class:`int`.

source: Multiple Inheritance
it_it: Ereditarietà Multipla
