Repository: Addivsyou/python-docs-it
Catalog: tutorial/controlflow.po
Languages: it_it

source: More Control Flow Tools
it_it: Altri Strumenti di Controllo del Flusso

source: As well as the :keyword:`while` statement just introduced, Python uses a few more that we will encounter in this chapter.
it_it: Oltre all'istruzione :keyword:`while` appena introdotta, Python ne utilizza altre che incontreremo in questo capitolo.

source: :keyword:`!if` Statements
it_it: Istruzioni :keyword:`!if`

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
it_it: Forse il tipo di istruzione più conosciuto è l'istruzione :keyword:`if`. Ad esempio::

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
it_it: Possiamo avere zero o più parti :keyword:`elif`, e la parte :keyword:`else` è facoltativa. La parola chiave ':keyword:`!elif`' è l'abbreviazione di 'else if', ed è utile per evitare un'eccessiva indentazione. Una sequenza :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... è un sostituto per le istruzioni ``switch`` o ``case`` trovate in altri linguaggi.

source: If you're comparing the same value to several constants, or checking for specific types or attributes, you may also find the :keyword:`!match` statement useful. For more details see :ref:`tut-match`.
it_it: Se stai confrontando lo stesso valore con diverse costanti, o controllando tipi o attributi specifici, potresti trovare utile l'istruzione :keyword:`!match`. Per maggiori dettagli, consulta :ref:`tut-match`.

source: :keyword:`!for` Statements
it_it: Istruzioni :keyword:`!for`

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
it_it: L'istruzione :keyword:`for` in Python differisce leggermente da ciò a cui potresti essere abitualmente abituato in C o Pascal. Piuttosto che iterare sempre su una progressione aritmetica di numeri (come in Pascal), o dare all'utente la possibilità di definire sia il passo di iterazione che la condizione di arresto (come in C), l'istruzione :keyword:`!for` di Python itera sugli elementi di qualsiasi sequenza (una lista o una stringa), nell'ordine in cui appaiono nella sequenza. Ad esempio:

source: Code that modifies a collection while iterating over that same collection can be tricky to get right. Instead, it is usually more straight-forward to loop over a copy of the collection or to create a new collection::
it_it: Il codice che modifica una collezione durante l'iterazione sulla stessa può essere difficile da scrivere correttamente. Invece, è generalmente più semplice iterare su una copia della collezione o crearne una nuova:

source: The :func:`range` Function
it_it: La Funzione :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
it_it: Se hai bisogno di iterare su una sequenza di numeri, la funzione integrata :func:`range` è utile. Genera progressioni aritmetiche::

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
it_it: Il valore finale fornito non fa parte della sequenza generata; ``range(10)`` genera 10 valori, gli indici legali per gli elementi di una sequenza di lunghezza 10. È possibile far partire l'intervallo da un altro numero, o specificare un incremento diverso (anche negativo; talvolta questo è chiamato 'passo')::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
it_it: Per iterare sugli indici di una sequenza, puoi combinare :func:`range` e :func:`len` nel seguente modo::

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
it_it: Nella maggior parte di questi casi, però, è conveniente utilizzare la funzione :func:`enumerate`, vedi :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
it_it: Attenzione: succede una cosa strana se provi a stampare un range::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
it_it: In molti casi, l'oggetto restituito da :func:`range` si comporta come se fosse una lista, ma in realtà non lo è. È un oggetto che restituisce gli elementi successivi della sequenza desiderata quando ci si itera sopra, ma non crea effettivamente la lista, risparmiando così spazio.

source: We say such an object is :term:`iterable`, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such a construct, while an example of a function that takes an iterable is :func:`sum`::
it_it: Diciamo che un tale oggetto è un :term:`iterable`, cioè adatto per funzioni e costrutti che si aspettano qualcosa da cui possono ottenere elementi fino a quando il contenitore è vuoto. Abbiamo visto che l'istruzione :keyword:`for` è un tale costrutto, mentre un esempio di una funzione che prende come argomento un oggetto iterabile è :func:`sum`::

source: Later we will see more functions that return iterables and take iterables as arguments. In chapter :ref:`tut-structures`, we will discuss in more detail about :func:`list`.
it_it: In seguito vedremo altre funzioni che restituiscono oggetti iterabili e prendono oggetti iterabili come argomenti. Nel capitolo :ref:`tut-structures`, discuteremo in modo più dettagliato riguardo a :func:`list`.

source: :keyword:`!break` and :keyword:`!continue` Statements, and :keyword:`!else` Clauses on Loops
it_it: Istruzioni :keyword:`!break` e :keyword:`!continue`, e clausole :keyword:`!else` nei cicli

source: The :keyword:`break` statement breaks out of the innermost enclosing :keyword:`for` or :keyword:`while` loop.
it_it: L'istruzione :keyword:`break` esce dal ciclo :keyword:`for` o :keyword:`while` più interno.

source: A :keyword:`!for` or :keyword:`!while` loop can include an :keyword:`!else` clause.
it_it: Un ciclo :keyword:`!for` o :keyword:`!while` può includere una clausola :keyword:`!else`.

source: In a :keyword:`for` loop, the :keyword:`!else` clause is executed after the loop reaches its final iteration.
it_it: In un ciclo :keyword:`for`, la clausola :keyword:`!else` viene eseguita dopo che il ciclo ha raggiunto la sua iterazione finale.

source: In a :keyword:`while` loop, it's executed after the loop's condition becomes false.
it_it: In un ciclo :keyword:`while`, viene eseguita dopo che la condizione del ciclo diventa falsa.

source: In either kind of loop, the :keyword:`!else` clause is **not** executed if the loop was terminated by a :keyword:`break`.
it_it: In entrambi i tipi di ciclo, la clausola :keyword:`!else` **non** viene eseguita se il ciclo è stato terminato da un :keyword:`break`.

source: This is exemplified in the following :keyword:`!for` loop, which searches for prime numbers::
it_it: Questo è esemplificato nel seguente ciclo :keyword:`!for`, che cerca numeri primi::

source: (Yes, this is the correct code. Look closely: the ``else`` clause belongs to the :keyword:`for` loop, **not** the :keyword:`if` statement.)
it_it: (Sì, questo codice è corretto. Guarda attentamente: la clausola ``else`` appartiene al ciclo :keyword:`for`, **non** all'istruzione :keyword:`if`.)

source: When used with a loop, the ``else`` clause has more in common with the ``else`` clause of a :keyword:`try` statement than it does with that of :keyword:`if` statements: a :keyword:`try` statement's ``else`` clause runs when no exception occurs, and a loop's ``else`` clause runs when no ``break`` occurs. For more on the :keyword:`!try` statement and exceptions, see :ref:`tut-handling`.
it_it: Quando viene utilizzata con un ciclo, la clausola ``else`` ha più in comune con la clausola ``else`` di un'istruzione :keyword:`try` rispetto a quella delle istruzioni :keyword:`if`: la clausola ``else`` di un'istruzione :keyword:`try` viene eseguita quando non si verifica alcuna eccezione, e la clausola ``else`` di un ciclo viene eseguita quando non si verifica alcun ``break``. Per ulteriori informazioni sull'istruzione :keyword:`!try` e sulle eccezioni, consulta :ref:`tut-handling`.

source: The :keyword:`continue` statement, also borrowed from C, continues with the next iteration of the loop::
it_it: L'istruzione :keyword:`continue`, presa in prestito dal C, continua con la prossima iterazione del ciclo::

source: :keyword:`!pass` Statements
it_it: Istruzioni :keyword:`!pass`

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
it_it: L'istruzione :keyword:`pass` non fa nulla. Può essere utilizzata quando è richiesta un'istruzione sintatticamente, ma il programma non richiede alcuna azione. Per esempio::

source: This is commonly used for creating minimal classes::
it_it: Questo è comunemente usato per creare classi minime::

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
it_it: Un altro posto in cui :keyword:`pass` può essere usato è come segnaposto per il corpo di una funzione o condizionale quando si sta lavorando su nuovo codice, permettendo di continuare a pensare a un livello più astratto. L'istruzione :keyword:`!pass` viene ignorata silenziosamente::

source: :keyword:`!match` Statements
it_it: Istruzioni :keyword:`!match`

source: A :keyword:`match` statement takes an expression and compares its value to successive patterns given as one or more case blocks. This is superficially similar to a switch statement in C, Java or JavaScript (and many other languages), but it's more similar to pattern matching in languages like Rust or Haskell. Only the first pattern that matches gets executed and it can also extract components (sequence elements or object attributes) from the value into variables.
it_it: Un'istruzione :keyword:`match` prende un'espressione e confronta il suo valore con schemi successivi forniti come uno o più blocchi case. Questo è superficialmente simile a un'istruzione switch in C, Java o JavaScript (e molti altri linguaggi), ma è più simile al pattern matching in linguaggi come Rust o Haskell. Solo il primo schema che corrisponde viene eseguito e può anche estrarre componenti (elementi di sequenze o attributi di oggetti) dal valore in variabili.

source: The simplest form compares a subject value against one or more literals::
it_it: La forma più semplice confronta un valore con uno o più letterali::

source: Note the last block: the "variable name" ``_`` acts as a *wildcard* and never fails to match. If no case matches, none of the branches is executed.
it_it: Nota l'ultimo blocco: il "nome della variabile" ``_`` funge da *wildcard* e non fallisce mai. Se nessun case corrisponde, nessuno dei rami viene eseguito.

source: You can combine several literals in a single pattern using ``|`` ("or")::
it_it: Puoi combinare diversi letterali in un singolo schema usando ``|`` ("or")::

source: Patterns can look like unpacking assignments, and can be used to bind variables::
it_it: Gli schemi possono sembrare assegnazioni di decomposizione e possono essere utilizzati per associare variabili::

source: Study that one carefully! The first pattern has two literals, and can be thought of as an extension of the literal pattern shown above. But the next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
it_it: Studialo attentamente! Il primo schema ha due letterali, e può essere pensato come un'estensione dello schema letterale mostrato sopra. Ma i successivi due schemi combinano un letterale e una variabile, e la variabile *associa* un valore dal soggetto (``point``). Il quarto schema cattura due valori, che lo rende concettualmente simile all'assegnazione con *unpacking* ``(x, y) = point``.

source: If you are using classes to structure your data you can use the class name followed by an argument list resembling a constructor, but with the ability to capture attributes into variables::
it_it: Se stai utilizzando classi per strutturare i tuoi dati, puoi usare il nome della classe seguito da un elenco di argomenti che assomiglia a un costruttore, ma con la capacità di catturare attributi in variabili::

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
it_it: Puoi utilizzare parametri posizionali con alcune classi integrate che forniscono un ordinamento per i loro attributi (ad esempio le dataclassi). Puoi anche definire una posizione specifica per gli attributi negli schemi impostando l'attributo speciale ``__match_args__`` nelle tue classi. Se è impostato su ("x", "y"), gli schemi seguenti sono tutti equivalenti (e tutti associano l'attributo ``y`` alla variabile ``var``)::

source: A recommended way to read patterns is to look at them as an extended form of what you would put on the left of an assignment, to understand which variables would be set to what. Only the standalone names (like ``var`` above) are assigned to by a match statement. Dotted names (like ``foo.bar``), attribute names (the ``x=`` and ``y=`` above) or class names (recognized by the "(...)" next to them like ``Point`` above) are never assigned to.
it_it: Un modo consigliato per leggere gli schemi è considerarli come una forma estesa di quello che metteresti a sinistra di un'assegnazione, per capire quali variabili verrebbero impostate su cosa. Solo i nomi autonomi (come ``var`` qui sopra) vengono assegnati da un'istruzione di match. I nomi puntati (come ``foo.bar``), i nomi degli attributi (il ``x=`` e ``y=`` qui sopra) o i nomi delle classi (riconosciuti dalle "(...)" accanto a loro come ``Point`` qui sopra) non vengono mai assegnati.

source: Patterns can be arbitrarily nested. For example, if we have a short list of Points, with ``__match_args__`` added, we could match it like this::
it_it: Gli schemi possono essere arbitrariamente nidificati. Ad esempio, se abbiamo una breve lista di Punti, con ``__match_args__`` aggiunto, potremmo abbinarla così::

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
it_it: Possiamo aggiungere una clausola ``if`` a uno schema, nota come "guardia". Se la guardia è falsa, ``match`` passa a provare il blocco case successivo. Nota che la cattura del valore avviene prima che la guardia venga valutata::

source: Several other key features of this statement:
it_it: Altre caratteristiche chiave di questa istruzione:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. An important exception is that they don't match iterators or strings.
it_it: Come le assegnazioni di decomposizione, gli schemi di tuple e liste hanno esattamente lo stesso significato e corrispondono effettivamente a sequenze arbitrarie. Un'importante eccezione è che non corrispondano a iteratori o stringhe.

source: Sequence patterns support extended unpacking: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
it_it: Le sequenze di schemi supportano l'unpacking esteso: ``[x, y, *rest]`` e ``(x, y, *rest)`` funzionano in modo simile alle assegnazioni di decomposizione. Il nome dopo ``*`` può anche essere ``_``, quindi ``(x, y, *_)`` corrisponde a una sequenza di almeno due elementi senza la necessità di associare gli elementi rimanenti.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dictionary. Unlike sequence patterns, extra keys are ignored. An unpacking like ``**rest`` is also supported. (But ``**_`` would be redundant, so it is not allowed.)
it_it: Schemi di mapping: ``{"bandwidth": b, "latency": l}`` cattura i valori ``"bandwidth"`` e ``"latency"`` da un dizionario. A differenza degli schemi di sequenza, le chiavi aggiuntive vengono ignorate. È supportato anche un unpacking come ``**rest``. (Ma ``**_`` sarebbe ridondante, quindi non è possibile utilizzarlo.)

source: Subpatterns may be captured using the ``as`` keyword::
it_it: I sotto-schemi possono essere catturati utilizzando la parola chiave ``as``::

source: will capture the second element of the input as ``p2`` (as long as the input is a sequence of two points)
it_it: acquisirà il secondo elemento dell'input come ``p2`` (a patto che l'input sia una sequenza di due punti)

source: Most literals are compared by equality, however the singletons ``True``, ``False`` and ``None`` are compared by identity.
it_it: La maggior parte dei letterali sono confrontati per uguaglianza, tuttavia i *singleton* ``True``, ``False`` e ``None`` sono confrontati per identità.

source: Patterns may use named constants. These must be dotted names to prevent them from being interpreted as capture variable::
it_it: Gli schemi possono utilizzare costanti nominate. Queste devono essere nomi puntati per impedire che vengano interpretati come variabili di cattura::

source: For a more detailed explanation and additional examples, you can look into :pep:`636` which is written in a tutorial format.
it_it: Per una spiegazione più dettagliata e ulteriori esempi, puoi consultare :pep:`636` che è scritta in un formato simile a un tutorial.

source: Defining Functions
it_it: Definizione di Funzioni

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
it_it: Possiamo creare una funzione che scrive la serie di Fibonacci fino a un limite arbitrario::

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
it_it: La parola chiave :keyword:`def` introduce una *definizione* di funzione. Deve essere seguita dal nome della funzione e dall'elenco tra parentesi dei parametri formali. Le istruzioni che formano il corpo della funzione iniziano alla riga successiva, e devono essere indentate.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
it_it: La prima istruzione del corpo della funzione può opzionalmente essere una stringa letterale; questa stringa letterale è la stringa di documentazione della funzione, o :dfn:`docstring`. (Maggiori informazioni sulle docstring possono essere trovate nella sezione :ref:`tut-docstrings`.) Ci sono strumenti che utilizzano le docstring per produrre automaticamente documentazione online o stampata, o per consentire all'utente di navigare interattivamente attraverso il codice; è una buona pratica includere le docstring nel codice che scrivi, quindi prendilo come abitudine.

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
it_it: L'*esecuzione* di una funzione introduce una nuova tabella dei simboli utilizzata per le variabili locali della funzione. Più precisamente, tutte le assegnazioni di variabili in una funzione memorizzano il valore nella tabella dei simboli locali; mentre i riferimenti alle variabili cercano prima nella tabella dei simboli locali, poi nelle tabelle dei simboli locali delle funzioni circostanti, poi nella tabella dei simboli globali, e infine nella tabella dei nomi incorporati. Pertanto, le variabili globali e le variabili delle funzioni circostanti non possono essere direttamente assegnate un valore all'interno di una funzione (a meno che, per le variabili globali, siano nominate in un'istruzione :keyword:`global`, o, per le variabili delle funzioni circostanti, siano nominate in un'istruzione :keyword:`nonlocal`), anche se possono essere referenziate.

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, or calls itself recursively, a new local symbol table is created for that call.
it_it: I parametri effettivi (argomenti) di una chiamata di funzione vengono introdotti nella tabella dei simboli locali della funzione chiamata quando viene chiamata; quindi, gli argomenti sono passati utilizzando il *passaggio per valore* (dove il *valore* è sempre un *riferimento* all'oggetto, non il valore dell'oggetto). [#]_ Quando una funzione chiama un'altra funzione, o si chiama ricorsivamente, viene creata una nuova tabella dei simboli locali per quella chiamata.
