Repository: Addivsyou/python-docs-it
Catalog: tutorial/controlflow.po
Languages: it_it

source: A function definition associates the function name with the function object in the current symbol table. The interpreter recognizes the object pointed to by that name as a user-defined function. Other names can also point to that same function object and can also be used to access the function::
it_it: Una definizione di funzione associa il nome della funzione all'oggetto funzione nella tabella dei simboli corrente. L'interprete riconosce l'oggetto puntato da quel nome come una funzione definita dall'utente. Altri nomi possono anche puntare a quello stesso oggetto funzione e possono anche essere utilizzati per accedere alla funzione::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
it_it: Provenendo da altri linguaggi, potresti obiettare che ``fib`` non è una funzione ma una procedura poiché non restituisce un valore. Infatti, anche le funzioni senza un'istruzione :keyword:`return` restituiscono un valore, sebbene piuttosto noioso. Questo valore si chiama ``None`` (è un nome riservato del linguaggio). Scrivere il valore ``None`` è normalmente soppresso dall'interprete se sarebbe l'unico valore scritto. Puoi vederlo se lo desideri davvero utilizzando :func:`print`::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
it_it: È semplice scrivere una funzione che restituisce una lista dei numeri della serie di Fibonacci, invece di stamparla::

source: This example, as usual, demonstrates some new Python features:
it_it: Questo esempio, come al solito, dimostra alcune nuove funzionalità di Python:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
it_it: L'istruzione :keyword:`return` restituisce un valore da una funzione. :keyword:`!return` senza un argomento espressione restituisce ``None``. Anche uscire dalla fine di una funzione restituisce ``None``.

source: The statement ``result.append(a)`` calls a *method* of the list object ``result``. A method is a function that 'belongs' to an object and is named ``obj.methodname``, where ``obj`` is some object (this may be an expression), and ``methodname`` is the name of a method that is defined by the object's type. Different types define different methods. Methods of different types may have the same name without causing ambiguity. (It is possible to define your own object types and methods, using *classes*, see :ref:`tut-classes`) The method :meth:`!append` shown in the example is defined for list objects; it adds a new element at the end of the list. In this example it is equivalent to ``result = result + [a]``, but more efficient.
it_it: L'istruzione ``result.append(a)`` chiama un *metodo* dell'oggetto lista ``result``. Un metodo è una funzione che 'appartiene' a un oggetto e si chiama ``obj.methodname``, dove ``obj`` è un qualche oggetto (questo può essere un'espressione), e ``methodname`` è il nome di un metodo definito dal tipo dell'oggetto. Diversi tipi definiscono metodi diversi. Metodi di tipi diversi possono avere lo stesso nome senza causare ambiguità. (È possibile definire i propri tipi di oggetto e metodi, utilizzando *classi*, vedi :ref:`tut-classes`) Il metodo :meth:`!append` mostrato nell'esempio è definito per gli oggetti lista; aggiunge un nuovo elemento alla fine della lista. In questo esempio è equivalente a ``result = result + [a]``, ma più efficiente.

source: More on Defining Functions
it_it: Ulteriori informazioni sulla Definizione di Funzioni

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
it_it: È anche possibile definire funzioni con un numero variabile di argomenti. Esistono tre forme, che possono essere combinate.

source: Default Argument Values
it_it: Valori predefiniti degli argomenti

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
it_it: La forma più utile è specificare un valore predefinito per uno o più argomenti. Questo crea una funzione che può essere chiamata con meno argomenti di quelli che è definita per consentire. Ad esempio::

source: This function can be called in several ways:
it_it: Questa funzione può essere chiamata in diversi modi:

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
it_it: dando solo l'argomento obbligatorio: ``ask_ok('Vuoi davvero uscire?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
it_it: dando uno degli argomenti opzionali: ``ask_ok('OK sovrascrivere il file?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
it_it: o addirittura dando tutti gli argomenti: ``ask_ok('OK sovrascrivere il file?', 2, 'Dai su, solo sì o no!')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
it_it: Questo esempio introduce anche la parola chiave :keyword:`in`. Questo testa se una sequenza contiene o meno un certo valore.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
it_it: I valori predefiniti vengono valutati nel punto di definizione della funzione nello *scope* di definizione, in modo che ::

source: will print ``5``.
it_it: stamperà ``5``.

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
it_it: **Avvertenza importante:** Il valore predefinito viene valutato solo una volta. Questo fa la differenza quando il valore predefinito è un oggetto mutabile come una lista, un dizionario, o istanze della maggior parte delle classi. Ad esempio, la seguente funzione accumula gli argomenti passati ad essa nelle chiamate successive::

source: This will print ::
it_it: Questo stamperà ::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
it_it: Se non vuoi che il valore predefinito sia condiviso tra le chiamate successive, puoi scrivere la funzione in questo modo::

source: Keyword Arguments
it_it: Argomenti chiave-valore

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
it_it: Le funzioni possono anche essere chiamate utilizzando :term:`argomenti chiave-valore <keyword argument>` della forma ``kwarg=value``. Ad esempio, la seguente funzione::

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
it_it: accetta un argomento obbligatorio (``voltage``) e tre argomenti opzionali (``state``, ``action``, e ``type``). Questa funzione può essere chiamata in uno dei seguenti modi::

source: but all the following calls would be invalid::
it_it: ma tutte le chiamate seguenti non sarebbero valide::

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
it_it: In una chiamata di funzione, gli argomenti chiave-valore devono seguire gli argomenti posizionali. Tutti gli argomenti chiave passati devono corrispondere a uno degli argomenti accettati dalla funzione (ad esempio, ``actor`` non è un argomento valido per la funzione ``parrot``), e il loro ordine non è importante. Questo include anche gli argomenti non opzionali (ad esempio, ``parrot(voltage=1000)`` è valido). Nessun argomento può ricevere un valore più di una volta. Ecco un esempio che fallisce a causa di questa restrizione::

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
it_it: Quando è presente un parametro formale finale della forma ``**name``, riceve un dizionario (vedi :ref:`typesmapping`) contenente tutti gli argomenti chiave tranne quelli corrispondenti a un parametro formale. Questo può essere combinato con un parametro formale della forma ``*name`` (descritto nella prossima sottosezione) che riceve una :ref:`tupla <tut-tuples>` contenente gli argomenti posizionali oltre all'elenco dei parametri formali. (``*name`` deve occorrere prima di ``**name``.) Ad esempio, se definiamo una funzione in questo modo::

source: It could be called like this::
it_it: Potrebbe essere chiamato in questo modo::

source: and of course it would print:
it_it: e naturalmente stamperà:

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
it_it: Nota che l'ordine in cui gli argomenti chiave-valore vengono stampati è garantito corrispondere all'ordine in cui sono stati forniti nella chiamata della funzione.

source: Special parameters
it_it: Parametri speciali

source: By default, arguments may be passed to a Python function either by position or explicitly by keyword. For readability and performance, it makes sense to restrict the way arguments can be passed so that a developer need only look at the function definition to determine if items are passed by position, by position or keyword, or by keyword.
it_it: Per impostazione predefinita, gli argomenti possono essere passati a una funzione Python sia per posizione che esplicitamente per chiave. Per leggibilità e prestazioni, ha senso limitare il modo in cui gli argomenti possono essere passati in modo che uno sviluppatore debba solo guardare la definizione della funzione per determinare se gli elementi sono passati per posizione, per posizione o per chiave, o per chiave.

source: A function definition may look like:
it_it: Ecco come potrebbe essere la definizione di una funzione:

source: where ``/`` and ``*`` are optional. If used, these symbols indicate the kind of parameter by how the arguments may be passed to the function: positional-only, positional-or-keyword, and keyword-only. Keyword parameters are also referred to as named parameters.
it_it: dove ``/`` e ``*`` sono opzionali. Se utilizzati, questi simboli indicano il tipo di parametro in base a come gli argomenti possono essere passati alla funzione: solo per posizione, per posizione o per chiave, e solo per chiave. I parametri chiave-valore sono anche chiamati parametri nominali.

source: Positional-or-Keyword Arguments
it_it: Argomenti Posizionali o per Chiave

source: If ``/`` and ``*`` are not present in the function definition, arguments may be passed to a function by position or by keyword.
it_it: Se ``/`` e ``*`` non sono presenti nella definizione della funzione, gli argomenti possono essere passati a una funzione per posizione o per chiave.

source: Positional-Only Parameters
it_it: Parametri Solo per Posizione

source: Looking at this in a bit more detail, it is possible to mark certain parameters as *positional-only*. If *positional-only*, the parameters' order matters, and the parameters cannot be passed by keyword. Positional-only parameters are placed before a ``/`` (forward-slash). The ``/`` is used to logically separate the positional-only parameters from the rest of the parameters. If there is no ``/`` in the function definition, there are no positional-only parameters.
it_it: Guardando questo in modo più dettagliato, è possibile contrassegnare certi parametri come *solo per posizione*. Se lo sono, l'ordine dei parametri è importante, e i parametri non possono essere passati per chiave. I parametri solo per posizione sono posizionati prima di un ``/`` (barra obliqua). Il ``/`` è utilizzato per separare logicamente i parametri posizionali dal resto dei parametri. Se non c'è un ``/`` nella definizione della funzione, non ci sono parametri posizionali.

source: Parameters following the ``/`` may be *positional-or-keyword* or *keyword-only*.
it_it: I parametri che seguono il ``/`` possono essere *posizionali o per chiave* o *solo per chiave*.

source: Keyword-Only Arguments
it_it: Argomenti Solo per Chiave

source: To mark parameters as *keyword-only*, indicating the parameters must be passed by keyword argument, place an ``*`` in the arguments list just before the first *keyword-only* parameter.
it_it: Per contrassegnare i parametri come *solo per chiave*, indicando che i parametri devono essere passati per argomento chiave, posiziona un ``*`` nell'elenco degli argomenti subito prima del primo parametro *solo per chiave*.

source: Function Examples
it_it: Esempi di Funzioni

source: Consider the following example function definitions paying close attention to the markers ``/`` and ``*``::
it_it: Considera le seguenti definizioni di funzioni di esempio prestando particolare attenzione ai marcatori ``/`` e ``*``::

source: The first function definition, ``standard_arg``, the most familiar form, places no restrictions on the calling convention and arguments may be passed by position or keyword::
it_it: Nella prima definizione di funzione, ``standard_arg``, la forma più familiare, non pone restrizioni sulla convenzione di chiamata e gli argomenti possono essere passati per posizione o per chiave::

source: The second function ``pos_only_arg`` is restricted to only use positional parameters as there is a ``/`` in the function definition::
it_it: La seconda funzione ``pos_only_arg`` è limitata a utilizzare solo parametri posizionali poiché c'è un ``/`` nella definizione della funzione::

source: The third function ``kwd_only_args`` only allows keyword arguments as indicated by a ``*`` in the function definition::
it_it: La terza funzione ``kwd_only_args`` consente solo argomenti chiave-valore come indicato da un ``*`` nella definizione della funzione::

source: And the last uses all three calling conventions in the same function definition::
it_it: E l'ultimo utilizza tutte e tre le convenzioni di chiamata nella stessa definizione di funzione::

source: Finally, consider this function definition which has a potential collision between the positional argument ``name`` and ``**kwds`` which has ``name`` as a key::
it_it: Infine, considera questa definizione di funzione che ha un potenziale conflitto tra l'argomento posizionale ``name`` e ``**kwds`` che ha ``name`` come chiave::

source: There is no possible call that will make it return ``True`` as the keyword ``'name'`` will always bind to the first parameter. For example::
it_it: Non esiste una chiamata possibile che lo farà restituire ``True`` poiché la chiave ``'name'`` si legherà sempre al primo parametro. Ad esempio::

source: But using ``/`` (positional only arguments), it is possible since it allows ``name`` as a positional argument and ``'name'`` as a key in the keyword arguments::
it_it: Ma utilizzando ``/`` (argomenti solo per posizione), è possibile poiché consente ``name`` come argomento posizionale e ``'name'`` come chiave negli argomenti chiave-valore::

source: In other words, the names of positional-only parameters can be used in ``**kwds`` without ambiguity.
it_it: In altre parole, i nomi dei parametri solo per posizione possono essere utilizzati in ``**kwds`` senza ambiguità.

source: Recap
it_it: Riepilogo

source: The use case will determine which parameters to use in the function definition::
it_it: Il caso d'uso determinerà quali parametri utilizzare nella definizione della funzione::

source: As guidance:
it_it: Come guida:

source: Use positional-only if you want the name of the parameters to not be available to the user. This is useful when parameter names have no real meaning, if you want to enforce the order of the arguments when the function is called or if you need to take some positional parameters and arbitrary keywords.
it_it: Usa solo argomenti per posizione se vuoi che il nome dei parametri non sia disponibile per l'utente. Questo è utile quando i nomi dei parametri non hanno un vero significato, se vuoi imporre l'ordine degli argomenti quando la funzione viene chiamata o se devi prendere alcuni parametri posizionali e argomenti chiave arbitrari.

source: Use keyword-only when names have meaning and the function definition is more understandable by being explicit with names or you want to prevent users relying on the position of the argument being passed.
it_it: Usa solo argomenti per chiave quando i nomi hanno significato e la definizione della funzione è più comprensibile essendo esplicita con i nomi o vuoi impedire agli utenti di fare affidamento sulla posizione dell'argomento passato.

source: For an API, use positional-only to prevent breaking API changes if the parameter's name is modified in the future.
it_it: Per un'API, usa solo per posizione per evitare rotture delle modifiche API se il nome del parametro viene modificato in futuro.

source: Arbitrary Argument Lists
it_it: Liste di Argomenti Arbitrarie

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
it_it: Infine, l'opzione meno utilizzata è specificare che una funzione può essere chiamata con un numero arbitrario di argomenti. Questi argomenti saranno racchiusi in una tupla (vedi :ref:`tut-tuples`). Prima del numero variabile di argomenti, possono verificarsi zero o più argomenti normali. ::

source: Normally, these *variadic* arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
it_it: Normalmente, questi argomenti *variadici* saranno gli ultimi nell'elenco dei parametri formali, perché raccolgono tutti gli argomenti di input rimanenti che vengono passati alla funzione. Qualsiasi parametro formale che si verifica dopo il parametro ``*args`` sono argomenti 'solo per chiave', il che significa che possono essere utilizzati solo come argomenti chiave piuttosto che argomenti posizionali. ::

source: Unpacking Argument Lists
it_it: Spacchettamento delle Liste di Argomenti

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
it_it: La situazione inversa si verifica quando gli argomenti sono già in una lista o tupla ma devono essere spacchettati per una chiamata di funzione che richiede argomenti posizionali separati. Ad esempio, la funzione built-in :func:`range` si aspetta argomenti *start* e *stop* separati. Se non sono disponibili separatamente, scrivi la chiamata di funzione con l'operatore ``*``\ per spacchettare gli argomenti da una lista o tupla::

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
it_it: Nello stesso modo, i dizionari possono fornire argomenti chiave-valore con l'operatore ``**``\::

source: Lambda Expressions
it_it: Espressioni Lambda

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
it_it: Piccole funzioni anonime possono essere create con la parola chiave :keyword:`lambda`. Questa funzione restituisce la somma dei suoi due argomenti: ``lambda a, b: a+b``. Le funzioni lambda possono essere utilizzate ovunque siano richiesti oggetti funzione. Sono sintatticamente limitate a una singola espressione. Semanticamente, sono solo zucchero sintattico per una normale definizione di funzione. Come le definizioni di funzione nidificate, le funzioni lambda possono fare riferimento a variabili dallo scope contenente::

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument::
it_it: Nell'esempio precedente viene utilizzata un'espressione lambda per restituire una funzione. Un altro uso è passare una piccola funzione come argomento::

source: Documentation Strings
it_it: Stringhe di Documentazione

source: Here are some conventions about the content and formatting of documentation strings.
it_it: Ecco alcune convenzioni sul contenuto e la formattazione delle stringhe di documentazione.

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
it_it: La prima riga dovrebbe essere sempre un breve e conciso riassunto dello scopo dell'oggetto. Per brevità, non dovrebbe esplicitamente indicare il nome o il tipo dell'oggetto, poiché questi sono disponibili in altri modi (tranne se il nome è un verbo che descrive l'operazione di una funzione). Questa riga dovrebbe iniziare con una lettera maiuscola e terminare con un punto.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
it_it: Se ci sono più righe nella stringa di documentazione, la seconda riga dovrebbe essere vuota, separando visivamente il riassunto dal resto della descrizione. Le righe seguenti dovrebbero essere uno o più paragrafi che descrivono le convenzioni di chiamata dell'oggetto, i suoi effetti collaterali, ecc.
