Repository: Addivsyou/python-docs-it
Catalog: tutorial/controlflow.po
Languages: it_it

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
it_it: Il parser di Python non rimuove l'indentazione dalle stringhe letterali multilinea in Python, quindi gli strumenti che elaborano la documentazione devono rimuovere l'indentazione se desiderato. Questo viene fatto utilizzando la seguente convenzione. La prima riga non vuota *dopo* la prima riga della stringa determina la quantità di indentazione per l'intera stringa di documentazione. (Non possiamo usare la prima riga poiché è generalmente adiacente alle virgolette di apertura della stringa quindi la sua indentazione non è evidente nella stringa letterale.) Lo spazio bianco "equivalente" a questa indentazione viene quindi rimosso dall'inizio di tutte le righe della stringa. Le righe che sono indentate di meno non dovrebbero verificarsi, ma se si verificano tutto il loro spazio bianco iniziale dovrebbe essere rimosso. L'equivalenza dello spazio bianco dovrebbe essere testata dopo l'espansione delle tabulazioni (a 8 spazi, normalmente).

source: Here is an example of a multi-line docstring::
it_it: Di seguito è riportato un esempio di una stringa di documentazione multilinea::

source: Function Annotations
it_it: Annotationi delle Funzioni

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
it_it: :ref:`Le annotationi delle funzioni <function>` sono informazioni di metadati completamente opzionali sui tipi utilizzati dalle funzioni definite dall'utente (vedi :pep:`3107` e :pep:`484` per ulteriori informazioni).

source: :term:`Annotations <function annotation>` are stored in the :attr:`!__annotations__` attribute of the function as a dictionary and have no effect on any other part of the function. Parameter annotations are defined by a colon after the parameter name, followed by an expression evaluating to the value of the annotation. Return annotations are defined by a literal ``->``, followed by an expression, between the parameter list and the colon denoting the end of the :keyword:`def` statement. The following example has a required argument, an optional argument, and the return value annotated::
it_it: :term:`Le annotazioni <function annotation>` sono memorizzate nell'attributo :attr:`!__annotations__` della funzione come un dizionario e non hanno alcun effetto su qualsiasi altra parte della funzione. Le annotazioni dei parametri sono definite da due punti dopo il nome del parametro, seguito da un'espressione che valuta il valore dell'annotazione. Le annotazioni di ritorno sono definite da una freccia ``->``, seguita da un'espressione, tra l'elenco dei parametri e i due punti che indicano la fine della dichiarazione :keyword:`def`. L'esempio seguente ha un argomento obbligatorio, un argomento opzionale, e il valore di ritorno annotato::

source: Intermezzo: Coding Style
it_it: Intermezzo: Stile di Codifica

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
it_it: Ora che stai per scrivere pezzi di Python più lunghi e complessi, è un buon momento per parlare dello *stile di codifica*. La maggior parte dei linguaggi può essere scritta (o più concisamente, *formattata*) in stili diversi; alcuni sono più leggibili di altri. Rendere facile per gli altri leggere il tuo codice è sempre una buona idea, e adottare uno stile di codifica piacevole aiuta enormemente.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
it_it: Per Python, la :pep:`8` è la guida di stile a cui aderiscono la maggior parte dei progetti; promuove uno stile di codifica molto leggibile e piacevole alla vista. Ogni sviluppatore Python dovrebbe leggerla prima o poi; ecco i punti più importanti estratti per te:

source: Use 4-space indentation, and no tabs.
it_it: Usa l'indentazione a 4 spazi, e niente tabulazioni.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
it_it: 4 spazi sono un buon compromesso tra una piccola indentazione (permette una maggiore profondità di nidificazione) e una grande indentazione (più facile da leggere). Le tabulazioni introducono confusione, ed è preferibile non usarle.

source: Wrap lines so that they don't exceed 79 characters.
it_it: Manda a capo le righe in modo che non superino i 79 caratteri.

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
it_it: Questo aiuta gli utenti con schermi piccoli e rende possibile avere diversi file di codice affiancati su schermi più grandi.

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
it_it: Usa righe vuote per separare funzioni e classi, e blocchi di codice più grandi all'interno delle funzioni.

source: When possible, put comments on a line of their own.
it_it: Quando possibile, metti i commenti su una riga a parte.

source: Use docstrings.
it_it: Usa le stringhe di documentazione.

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
it_it: Usa spazi attorno agli operatori e dopo le virgole, ma non direttamente all'interno dei costrutti tra parentesi: ``a = f(1, 2) + g(3, 4)``.

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
it_it: Nomina le tue classi e funzioni in modo coerente; la convenzione è utilizzare ``UpperCamelCase`` per le classi e ``lowercase_with_underscores`` per le funzioni e i metodi. Usa sempre ``self`` come nome per il primo argomento del metodo (vedi :ref:`tut-firstclasses` per ulteriori informazioni su classi e metodi).

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
it_it: Non utilizzare codifiche complesse se il tuo codice è destinato ad essere utilizzato in ambienti internazionali. Il predefinito di Python, UTF-8, o anche il semplice ASCII funzionano meglio in ogni caso.

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
it_it: Allo stesso modo, non utilizzare caratteri non-ASCII negli identificatori se c'è solo la minima possibilità che persone che parlano una lingua diversa leggano o mantengano il codice.

source: Footnotes
it_it: Note a piè di pagina

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
it_it: In realtà, *chiamata per riferimento all'oggetto* sarebbe una descrizione migliore, poiché se viene passato un oggetto mutabile, il chiamante vedrà qualsiasi modifica che il chiamato fa ad esso (elementi inseriti in una lista).

source: statement
it_it: definizione

source: documentation strings
it_it: stringhe di documentazione

source: strings, documentation
it_it: stringhe, documentazione

source: * (asterisk)
it_it: * (asterisco)

source: in function calls
it_it: nelle chiamate di funzione

source: function
it_it: funzione

source: annotations
it_it: annotazioni

source: function annotations
it_it: annotazioni delle funzioni

source: : (colon)
it_it: : (due punti)

source: coding
it_it: codifica

source: style
it_it: stile
