Repository: Addivsyou/python-docs-it
Catalog: tutorial/datastructures.po
Languages: it_it

source: Data Structures
it_it: Strutture Dati

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
it_it: Questo capitolo descrive alcune cose che hai già imparato in maggiore dettaglio, e aggiunge anche alcune nuove cose.

source: More on Lists
it_it: Più sulle Liste

source: The list data type has some more methods. Here are all of the methods of list objects:
it_it: Il tipo di dato lista ha alcuni metodi aggiuntivi. Ecco tutti i metodi degli oggetti lista:

source: Add an item to the end of the list. Equivalent to ``a[len(a):] = [x]``.
it_it: Aggiunge un elemento alla fine della lista. Equivalente a ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Equivalent to ``a[len(a):] = iterable``.
it_it: Estende la lista aggiungendo tutti gli elementi dall'iterabile. Equivalente a ``a[len(a):] = iterable``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
it_it: Inserisce un elemento in una posizione specificata. Il primo argomento è l'indice dell'elemento prima del quale inserire, quindi ``a.insert(0, x)`` inserisce all'inizio della lista, e ``a.insert(len(a), x)`` è equivalente a ``a.append(x)``.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
it_it: Rimuove il primo elemento dalla lista il cui valore è uguale a *x*. Solleva una :exc:`ValueError` se non c'è un tale elemento.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. It raises an :exc:`IndexError` if the list is empty or the index is outside the list range.
it_it: Rimuove l'elemento nella posizione specificata nella lista e lo restituisce. Se non viene specificato un indice, ``a.pop()`` rimuove e restituisce l'ultimo elemento della lista. Solleva un :exc:`IndexError` se la lista è vuota o l'indice è fuori dal range della lista.

source: Remove all items from the list. Equivalent to ``del a[:]``.
it_it: Rimuove tutti gli elementi dalla lista. Equivalente a ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
it_it: Restituisce l'indice zero-based del primo elemento nella lista il cui valore è uguale a *x*. Solleva una :exc:`ValueError` se non c'è un tale elemento.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
it_it: Gli argomenti opzionali *start* e *end* sono interpretati come nella notazione delle slice e sono usati per limitare la ricerca a una particolare sottosequenza della lista. L'indice restituito è calcolato rispetto all'inizio della sequenza completa piuttosto che all'argomento *start*.

source: Return the number of times *x* appears in the list.
it_it: Restituisce il numero di volte che *x* appare nella lista.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
it_it: Ordina gli elementi della lista in loco (gli argomenti possono essere usati per la personalizzazione dell'ordinamento, vedere :func:`sorted` per la loro spiegazione).

source: Reverse the elements of the list in place.
it_it: Inverte gli elementi della lista in loco.

source: Return a shallow copy of the list. Equivalent to ``a[:]``.
it_it: Restituisce una copia superficiale della lista. Equivalente a ``a[:]``.

source: An example that uses most of the list methods::
it_it: Un esempio che utilizza la maggior parte dei metodi della lista::

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [#]_ This is a design principle for all mutable data structures in Python.
it_it: Avrai notato che metodi come ``insert``, ``remove`` o ``sort`` che modificano solo la lista non stampano alcun valore di ritorno -- ritornano il default ``None``. [#]_ Questo è un principio di design per tutte le strutture dati mutabili in Python.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and ``None`` can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
it_it: Un'altra cosa che potresti notare è che non tutti i dati possono essere ordinati o confrontati. Per esempio, ``[None, 'hello', 10]`` non può essere ordinata perché gli interi non possono essere confrontati con le stringhe e ``None`` non può essere confrontato con altri tipi. Inoltre, ci sono alcuni tipi che non hanno una relazione di ordinamento definita. Ad esempio, ``3+4j < 5+7j`` non è un confronto valido.

source: Using Lists as Stacks
it_it: Usare le Liste come Pile

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`~list.append`. To retrieve an item from the top of the stack, use :meth:`~list.pop` without an explicit index. For example::
it_it: I metodi delle liste rendono molto facile usare una lista come una pila, dove l'ultimo elemento aggiunto è il primo elemento recuperato ("last-in, first-out"). Per aggiungere un elemento alla cima della pila, usa :meth:`~list.append`. Per recuperare un elemento dalla cima della pila, usa :meth:`~list.pop` senza un indice esplicito. Per esempio::

source: Using Lists as Queues
it_it: Usare le Liste come Code

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
it_it: È anche possibile usare una lista come una coda, dove il primo elemento aggiunto è il primo elemento recuperato ("first-in, first-out"); tuttavia, le liste non sono efficienti per questo scopo. Mentre gli append e i pop dalla fine della lista sono veloci, fare inserzioni o pop dall'inizio di una lista è lento (perché tutti gli altri elementi devono essere spostati di uno).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
it_it: Per implementare una coda, usa :class:`collections.deque` che è stata progettata per avere append e pop veloci da entrambi i lati. Per esempio::

source: List Comprehensions
it_it: Comprensioni di Lista

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
it_it: Le comprensioni di lista forniscono un modo conciso per creare liste. Le applicazioni comuni sono creare nuove liste dove ogni elemento è il risultato di alcune operazioni applicate a ciascun membro di un'altra sequenza o iterabile, o creare una sottosequenza di quegli elementi che soddisfano una certa condizione.

source: For example, assume we want to create a list of squares, like::
it_it: Per esempio, supponiamo di voler creare una lista di quadrati, come::

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
it_it: Nota che questo crea (o sovrascrive) una variabile chiamata ``x`` che esiste ancora dopo che il ciclo è completo. Possiamo calcolare la lista dei quadrati senza effetti collaterali usando::

source: or, equivalently::
it_it: oppure, equivalentemente::

source: which is more concise and readable.
it_it: il che è più conciso e leggibile.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
it_it: Una comprensione di lista consiste di parentesi contenenti un'espressione seguita da una clausola :keyword:`!for`, quindi zero o più clausole :keyword:`!for` o :keyword:`!if`. Il risultato sarà una nuova lista risultante dalla valutazione dell'espressione nel contesto delle clausole :keyword:`!for` e :keyword:`!if` che la seguono. Per esempio, questa listcomp combina gli elementi di due liste se non sono uguali::

source: and it's equivalent to::
it_it: e equivale a::

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
it_it: Nota come l'ordine delle istruzioni :keyword:`for` e :keyword:`if` sia lo stesso in entrambi questi snippet.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
it_it: Se l'espressione è una tupla (per es. il ``(x, y)`` nell'esempio precedente), deve essere racchiusa tra parentesi. ::

source: List comprehensions can contain complex expressions and nested functions::
it_it: Le comprensioni di lista possono contenere espressioni complesse e funzioni nidificate::

source: Nested List Comprehensions
it_it: Comprensioni di Lista Nidificate

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
it_it: L'espressione iniziale in una comprensione di lista può essere qualsiasi espressione arbitraria, inclusa un'altra comprensione di lista.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
it_it: Considera il seguente esempio di una matrice 3x4 implementata come una lista di 3 liste di lunghezza 4::

source: The following list comprehension will transpose rows and columns::
it_it: La seguente comprensione di lista trasporrà righe e colonne::

source: As we saw in the previous section, the inner list comprehension is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
it_it: Come abbiamo visto nella sezione precedente, la comprensione di lista interna è valutata nel contesto del :keyword:`for` che la segue, quindi questo esempio è equivalente a::

source: which, in turn, is the same as::
it_it: che, a sua volta, è lo stesso di::

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
it_it: Nel mondo reale, dovresti preferire le funzioni built-in a strutture di controllo complesse. La funzione :func:`zip` farebbe un ottimo lavoro per questo caso d'uso::

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
it_it: Vedi :ref:`tut-unpacking-arguments` per dettagli sull'asterisco in questa riga.

source: The :keyword:`!del` statement
it_it: L'istruzione :keyword:`!del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`~list.pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
it_it: Esiste un modo per rimuovere un elemento da una lista dato il suo indice invece del suo valore: l'istruzione :keyword:`del`. Questo differisce dal metodo :meth:`~list.pop` che restituisce un valore. L'istruzione :keyword:`!del` può essere usata anche per rimuovere slice da una lista o per cancellare l'intera lista (cosa che abbiamo fatto prima assegnando una lista vuota alla slice). Per esempio::

source: :keyword:`del` can also be used to delete entire variables::
it_it: :keyword:`del` può anche essere usato per cancellare variabili intere::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
it_it: Fare riferimento al nome ``a`` d'ora in poi è un errore (almeno finché un altro valore non viene assegnato ad esso). Troveremo altri usi per :keyword:`del` più avanti.

source: Tuples and Sequences
it_it: Tuple e Sequenze

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
it_it: Abbiamo visto che liste e stringhe hanno molte proprietà comuni, come le operazioni di indicizzazione e slicing. Sono due esempi di tipi di dati *sequenza* (vedi :ref:`typesseq`). Poiché Python è un linguaggio in evoluzione, possono essere aggiunti altri tipi di dati sequenza. Esiste anche un altro tipo di dati sequenza standard: la *tupla*.

source: A tuple consists of a number of values separated by commas, for instance::
it_it: Una tupla consiste in un numero di valori separati da virgole, ad esempio::

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
it_it: Come vedi, in uscita le tuple sono sempre racchiuse tra parentesi, in modo che le tuple annidate siano interpretate correttamente; possono essere inserite con o senza parentesi, anche se spesso le parentesi sono comunque necessarie (se la tupla fa parte di un'espressione più grande). Tuttavia, non è possibile assegnare ai singoli elementi di una tupla, mentre è possibile creare tuple che contengono oggetti mutabili, come le liste.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
it_it: Sebbene le tuple possano sembrare simili alle liste, vengono spesso utilizzate in situazioni diverse e per scopi diversi. Le tuple sono :term:`immutable`, e di solito contengono una sequenza eterogenea di elementi che sono accessibili tramite unpacking (vedi più avanti in questa sezione) o indicizzazione (o anche per attributo nel caso di :func:`namedtuples <collections.namedtuple>`). Le liste sono :term:`mutable`, e i loro elementi sono di solito omogenei e sono accessibili iterando sulla lista.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
it_it: Un problema speciale è la costruzione di tuple contenenti 0 o 1 elemento: la sintassi presenta alcune peculiarità per accogliere questi casi. Le tuple vuote sono costruite da una coppia di parentesi vuota; una tupla con un solo elemento è costruita seguendo un valore con una virgola (non è sufficiente racchiudere un singolo valore tra parentesi). Brutto, ma efficace. Ad esempio::

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
it_it: L'istruzione ``t = 12345, 54321, 'hello!'`` è un esempio di *tuple packing*: i valori ``12345``, ``54321`` e ``'hello!'`` sono racchiusi insieme in una tupla. L'operazione inversa è anche possibile::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
it_it: Questo è chiamato, appropriatamente, *sequence unpacking* e funziona per qualsiasi sequenza sul lato destro. Lo sequence unpacking richiede che ci siano tante variabili sul lato sinistro del segno di uguale quante sono gli elementi nella sequenza. Nota che l'assegnazione multipla è davvero solo una combinazione di tuple packing e sequence unpacking.

source: Sets
it_it: Insiemi

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
it_it: Python include anche un tipo di dato per gli *insiemi*. Un insieme è una collezione non ordinata senza elementi duplicati. Gli usi principali includono il controllo dell'appartenenza e l'eliminazione degli elementi duplicati. Gli oggetti set supportano anche operazioni matematiche come unione, intersezione, differenza e differenza simmetrica.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
it_it: Le parentesi graffe o la funzione :func:`set` possono essere utilizzate per creare insiemi. Nota: per creare un insieme vuoto devi utilizzare ``set()``, non ``{}``; quest'ultimo crea un dizionario vuoto, una struttura dati che discuteremo nella sezione successiva.

source: Here is a brief demonstration::
it_it: Ecco una breve dimostrazione::

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
it_it: Analogamente alle :ref:`list comprehensions <tut-listcomps>`, sono supportate anche le set comprehensions::

source: Dictionaries
it_it: Dizionari

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`~list.append` and :meth:`~list.extend`.
it_it: Un altro tipo di dato utile incorporato in Python è il *dizionario* (vedi :ref:`typesmapping`). I dizionari sono a volte conosciuti in altre lingue come "memorie associative" o "array associativi". A differenza delle sequenze, che sono indicizzate da un intervallo di numeri, i dizionari sono indicizzati da *chiavi*, che possono essere di qualsiasi tipo immutabile; stringhe e numeri possono sempre essere chiavi. Le tuple possono essere usate come chiavi se contengono solo stringhe, numeri o tuple; se una tupla contiene un qualsiasi oggetto mutabile direttamente o indirettamente, non può essere utilizzata come chiave. Non puoi usare le liste come chiavi, poiché le liste possono essere modificate in loco usando assegnazioni di indice, assegnazioni di slice o metodi come :meth:`~list.append` e :meth:`~list.extend`.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
it_it: È meglio pensare a un dizionario come a un insieme di coppie *chiave: valore*, con il requisito che le chiavi siano uniche (all'interno di un dizionario). Una coppia di parentesi crea un dizionario vuoto: ``{}``. Inserendo una lista di coppie chiave:valore separate da virgole dentro le parentesi si aggiungono le coppie iniziali al dizionario; questo è anche il modo in cui i dizionari vengono scritti in uscita.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
it_it: Le principali operazioni su un dizionario sono memorizzare un valore con una chiave e estrarre il valore data la chiave. È anche possibile eliminare una coppia chiave:valore con ``del``. Se memorizzi usando una chiave già in uso, il vecchio valore associato a quella chiave viene dimenticato. È un errore estrarre un valore usando una chiave inesistente.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
it_it: Eseguendo ``list(d)`` su un dizionario si ottiene una lista di tutte le chiavi utilizzate nel dizionario, in ordine di inserimento (se la vuoi ordinata, basta usare ``sorted(d)``). Per controllare se una singola chiave è nel dizionario, usa la parola chiave :keyword:`in`.

source: Here is a small example using a dictionary::
it_it: Ecco un piccolo esempio usando un dizionario::

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
it_it: Il costruttore :func:`dict` costruisce dizionari direttamente da sequenze di coppie chiave-valore::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
it_it: Inoltre, le dict comprehensions possono essere utilizzate per creare dizionari da espressioni di chiave e valore arbitrarie::

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
it_it: Quando le chiavi sono semplici stringhe, a volte è più facile specificare le coppie utilizzando gli argomenti per parola chiave::

source: Looping Techniques
it_it: Tecniche di Looping
