Repository: Addivsyou/python-docs-it
Catalog: tutorial/datastructures.po
Languages: it_it

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`~dict.items` method. ::
it_it: Quando si scorre un dizionario, è possibile recuperare contemporaneamente la chiave e il valore corrispondente usando il metodo :meth:`~dict.items`. ::

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
it_it: Quando si scorre una sequenza, è possibile recuperare contemporaneamente l'indice di posizione e il valore corrispondente usando la funzione :func:`enumerate`. ::

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
it_it: Per scorrere due o più sequenze contemporaneamente, le voci possono essere abbinate con la funzione :func:`zip`. ::

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
it_it: Per scorrere una sequenza al contrario, specifica prima la sequenza in direzione avanti e poi chiama la funzione :func:`reversed`. ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
it_it: Per scorrere una sequenza in ordine ordinato, usa la funzione :func:`sorted` che restituisce una nuova lista ordinata lasciando invariata la sorgente. ::

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
it_it: Usare :func:`set` su una sequenza elimina gli elementi duplicati. L'uso di :func:`sorted` in combinazione con :func:`set` su una sequenza è un modo idiomatico di scorrere gli elementi unici della sequenza in ordine ordinato. ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
it_it: A volte è allettante modificare una lista mentre la stai scorrendo; tuttavia, è spesso più semplice e sicuro creare una nuova lista invece. ::

source: More on Conditions
it_it: Maggiori informazioni sulle Condizioni

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
it_it: Le condizioni utilizzate nelle istruzioni ``while`` e ``if`` possono contenere qualsiasi operatore, non solo confronti.

source: The comparison operators ``in`` and ``not in`` are membership tests that determine whether a value is in (or not in) a container. The operators ``is`` and ``is not`` compare whether two objects are really the same object. All comparison operators have the same priority, which is lower than that of all numerical operators.
it_it: Gli operatori di confronto ``in`` e ``not in`` sono test di appartenenza che determinano se un valore è (o non è) in un contenitore. Gli operatori ``is`` e ``is not`` confrontano se due oggetti sono davvero lo stesso oggetto. Tutti gli operatori di confronto hanno la stessa priorità, che è inferiore a quella di tutti gli operatori numerici.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
it_it: I confronti possono essere concatenati. Ad esempio, ``a < b == c`` verifica se ``a`` è minore di ``b`` e inoltre se ``b`` è uguale a ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
it_it: I confronti possono essere combinati usando gli operatori booleani ``and`` e ``or``, e il risultato di un confronto (o di qualsiasi altra espressione booleana) può essere negato con ``not``. Questi hanno una priorità inferiore rispetto agli operatori di confronto; tra di loro, ``not`` ha la priorità più alta e ``or`` la più bassa, in modo che ``A and not B or C`` sia equivalente a ``(A and (not B)) or C``. Come sempre, le parentesi possono essere utilizzate per esprimere la composizione desiderata.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
it_it: Gli operatori booleani ``and`` e ``or`` sono i cosiddetti operatori *short-circuit*: i loro argomenti vengono valutati da sinistra a destra, e la valutazione si arresta non appena l'esito è determinato. Ad esempio, se ``A`` e ``C`` sono veri ma ``B`` è falso, ``A and B and C`` non valuta l'espressione ``C``. Quando vengono utilizzati come un valore generale e non come booleani, il valore restituito di un operatore short-circuit è l'ultimo argomento valutato.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
it_it: È possibile assegnare il risultato di un confronto o di un'altra espressione booleana a una variabile. Ad esempio, ::

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
it_it: Nota che in Python, a differenza del C, l'assegnazione dentro espressioni deve essere fatta esplicitamente con l'operatore detto :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. Questo evita una comune classe di problemi incontrati nei programmi C: digitare ``=`` in un'espressione quando si intendeva ``==``.

source: Comparing Sequences and Other Types
it_it: Confronto tra Sequenze e Altri Tipi

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
it_it: Gli oggetti sequenza possono essere tipicamente confrontati con altri oggetti dello stesso tipo di sequenza. Il confronto usa l'ordinamento *lessicografico*: prima vengono confrontati i primi due elementi, e se differiscono questo determina il risultato del confronto; se sono uguali, vengono confrontati i due successivi, e così via, fino a quando una delle due sequenze è esaurita. Se gli elementi da confrontare sono essi stessi sequenze dello stesso tipo, il confronto lessicografico viene effettuato ricorsivamente. Se tutti gli elementi di due sequenze sono uguali tra di loro, le sequenze sono considerate uguali. Se una sequenza è una sottosequenza iniziale dell'altra, la sequenza più corta è considerata la minore. L'ordinamento lessicografico per le stringhe utilizza il numero del punto di codice Unicode per ordinare i singoli caratteri. Alcuni esempi di confronti tra sequenze dello stesso tipo::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
it_it: Nota che confrontare oggetti di tipi diversi con ``<`` o ``>`` è legale a condizione che gli oggetti abbiano metodi di confronto appropriati. Ad esempio, i tipi numerici misti sono confrontati in base al loro valore numerico, quindi 0 è uguale a 0.0, ecc. Altrimenti, invece di fornire un ordinamento arbitrario, l'interprete alzerà un'eccezione :exc:`TypeError`.

source: Footnotes
it_it: Note a piè di pagina

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
it_it: Altri linguaggi possono restituire l'oggetto mutato, il che consente di concatenare i metodi, come ``d->insert("a")->remove("b")->sort();``.
