Repository: Addivsyou/python-docs-it
Catalog: tutorial/errors.po
Languages: it_it

source: The problem with this code is that it leaves the file open for an indeterminate amount of time after this part of the code has finished executing. This is not an issue in simple scripts, but can be a problem for larger applications. The :keyword:`with` statement allows objects like files to be used in a way that ensures they are always cleaned up promptly and correctly. ::
it_it: Il problema con questo codice è che lascia il file aperto per un tempo indeterminato dopo che questa parte del codice ha terminato l'esecuzione. Questo non è un problema negli script semplici, ma può essere un problema per applicazioni più grandi. L'istruzione :keyword:`with` consente agli oggetti come i file di essere usati in modo tale da garantire che siano sempre puliti rapidamente e correttamente. ::

source: After the statement is executed, the file *f* is always closed, even if a problem was encountered while processing the lines. Objects which, like files, provide predefined clean-up actions will indicate this in their documentation.
it_it: Dopo che l'istruzione è stata eseguita, il file *f* è sempre chiuso, anche se si è verificato un problema durante l'elaborazione delle linee. Gli oggetti che, come i file, forniscono azioni di pulizia predefinite indicheranno ciò nella loro documentazione.

source: Raising and Handling Multiple Unrelated Exceptions
it_it: Sollevare e Gestire Eccezioni Multiple e Non Correlate

source: There are situations where it is necessary to report several exceptions that have occurred. This is often the case in concurrency frameworks, when several tasks may have failed in parallel, but there are also other use cases where it is desirable to continue execution and collect multiple errors rather than raise the first exception.
it_it: Ci sono situazioni in cui è necessario segnalare diverse eccezioni che si sono verificate. Questo è spesso il caso nei framework di concorrenza, quando diversi compiti possono aver fallito in parallelo, ma ci sono anche altri casi d'uso in cui è desiderabile continuare l'esecuzione e raccogliere più errori piuttosto che sollevare la prima eccezione.

source: The builtin :exc:`ExceptionGroup` wraps a list of exception instances so that they can be raised together. It is an exception itself, so it can be caught like any other exception. ::
it_it: L'eccezione built-in :exc:`ExceptionGroup` avvolge una lista di istanze di eccezione in modo tale che possano essere sollevate insieme. È un'eccezione a sé stante, quindi può essere catturata come qualsiasi altra eccezione. ::

source: By using ``except*`` instead of ``except``, we can selectively handle only the exceptions in the group that match a certain type. In the following example, which shows a nested exception group, each ``except*`` clause extracts from the group exceptions of a certain type while letting all other exceptions propagate to other clauses and eventually to be reraised. ::
it_it: Usando ``except*`` invece di ``except``, possiamo gestire selettivamente solo le eccezioni nel gruppo che corrispondono a un certo tipo. Nell'esempio seguente, che mostra un gruppo di eccezioni annidato, ogni clausola ``except*`` estrae dal gruppo le eccezioni di un certo tipo lasciando che tutte le altre eccezioni si propaghino ad altre clausole e, infine, vengano rilanciate. ::

source: Note that the exceptions nested in an exception group must be instances, not types. This is because in practice the exceptions would typically be ones that have already been raised and caught by the program, along the following pattern::
it_it: Nota che le eccezioni annidate in un gruppo di eccezioni devono essere istanze, non tipi. Questo perché in pratica le eccezioni sarebbero tipicamente quelle che sono state già sollevate e catturate dal programma, seguendo il seguente pattern::

source: Enriching Exceptions with Notes
it_it: Arricchire le Eccezioni con Note

source: When an exception is created in order to be raised, it is usually initialized with information that describes the error that has occurred. There are cases where it is useful to add information after the exception was caught. For this purpose, exceptions have a method ``add_note(note)`` that accepts a string and adds it to the exception's notes list. The standard traceback rendering includes all notes, in the order they were added, after the exception. ::
it_it: Quando un'eccezione viene creata per essere sollevata, viene solitamente inizializzata con informazioni che descrivono l'errore verificatosi. Ci sono casi in cui è utile aggiungere informazioni dopo che l'eccezione è stata catturata. Per questo scopo, le eccezioni hanno un metodo ``add_note(note)`` che accetta una stringa e la aggiunge alla lista di note dell'eccezione. Il rendering standard del traceback include tutte le note, nell'ordine in cui sono state aggiunte, dopo l'eccezione. ::

source: For example, when collecting exceptions into an exception group, we may want to add context information for the individual errors. In the following each exception in the group has a note indicating when this error has occurred. ::
it_it: Per esempio, quando si raccolgono eccezioni in un gruppo di eccezioni, potremmo voler aggiungere informazioni di contesto per gli errori individuali. Nel seguente esempio, ogni eccezione nel gruppo ha una nota che indica quando si è verificato l'errore. ::
