Repository: Addivsyou/python-docs-it
Catalog: tutorial/inputoutput.po
Languages: it_it

source: To change the file object's position, use ``f.seek(offset, whence)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *whence* argument. A *whence* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *whence* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
it_it: Per cambiare la posizione dell'oggetto file, usa ``f.seek(offset, whence)``. La posizione è calcolata sommando *offset* a un punto di riferimento; il punto di riferimento è selezionato dall'argomento *whence*. Un valore *whence* di 0 misura dall'inizio del file, 1 usa la posizione corrente del file, e 2 usa la fine del file come punto di riferimento. *whence* può essere omesso e predefinito a 0, utilizzando l'inizio del file come punto di riferimento. ::

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
it_it: Nei file di testo (quelli aperti senza una ``b`` nella stringa di modalità), sono consentiti solo i seek relativi all'inizio del file (con l'eccezione del seek alla fine del file con ``seek(0, 2)``) e gli unici valori *offset* validi sono quelli restituiti da ``f.tell()``, o zero. Qualsiasi altro valore *offset* produce un comportamento non definito.

source: File objects have some additional methods, such as :meth:`~io.IOBase.isatty` and :meth:`~io.IOBase.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
it_it: Gli oggetti file hanno alcuni metodi aggiuntivi, come :meth:`~io.IOBase.isatty` e :meth:`~io.IOBase.truncate` che sono meno frequentemente usati; consulta la Libreria di Riferimento per una guida completa agli oggetti file.

source: Saving structured data with :mod:`json`
it_it: Salvare dati strutturati con :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`~io.TextIOBase.read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
it_it: Le stringhe possono essere facilmente scritte su e lette da un file. I numeri richiedono un po' più di sforzo, poiché il metodo :meth:`~io.TextIOBase.read` restituisce solo stringhe, che dovranno essere passate a una funzione come :func:`int`, che prende una stringa come ``'123'`` e restituisce il suo valore numerico 123. Quando vuoi salvare tipi di dati più complessi come liste annidate e dizionari, il parsing e la serializzazione manuale diventano complicati.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <https://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
it_it: Piuttosto che avere utenti che scrivono e fanno debug costantemente di codice per salvare tipi di dati complicati nei file, Python ti permette di usare il popolare formato di interscambio dati chiamato `JSON (JavaScript Object Notation) <https://json.org>`_. Il modulo standard chiamato :mod:`json` può prendere gerarchie di dati Python e convertirle in rappresentazioni di stringhe; questo processo è chiamato :dfn:`serializzazione`. Ricostruire i dati dalla rappresentazione di stringa è chiamato :dfn:`deserializzazione`. Tra la serializzazione e la deserializzazione, la stringa che rappresenta l'oggetto può essere stata memorizzata in un file o dato, o inviata su una connessione di rete a una macchina lontana.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
it_it: Il formato JSON è comunemente usato dalle applicazioni moderne per permettere lo scambio di dati. Molti programmatori sono già familiari con esso, il che lo rende una buona scelta per l'interoperabilità.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
it_it: Se hai un oggetto ``x``, puoi visualizzare la sua rappresentazione JSON della stringa con una semplice riga di codice::

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
it_it: Un'altra variante della funzione :func:`~json.dumps`, chiamata :func:`~json.dump`, semplicemente serializza l'oggetto in un oggetto :term:`text file`. Quindi se ``f`` è un oggetto :term:`text file` aperto per la scrittura, possiamo fare questo::

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
it_it: Per decodificare l'oggetto di nuovo, se ``f`` è un oggetto :term:`binary file` o :term:`text file` che è stato aperto per la lettura::

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
it_it: I file JSON devono essere codificati in UTF-8. Usa ``encoding="utf-8"`` quando apri il file JSON come :term:`text file` sia per la lettura che per la scrittura.

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
it_it: Questa semplice tecnica di serializzazione può gestire liste e dizionari, ma serializzare istanze di classi arbitrari in JSON richiede un po' di sforzo extra. Il riferimento per il modulo :mod:`json` contiene una spiegazione di questo.

source: :mod:`pickle` - the pickle module
it_it: :mod:`pickle` - il modulo pickle

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
it_it: Contrariamente a :ref:`JSON <tut-json>`, *pickle* è un protocollo che permette la serializzazione di oggetti Python arbitrariamente complessi. Come tale, è specifico per Python e non può essere usato

source: built-in function
it_it: funzione incorporata

source: open
it_it: apri

source: object
it_it: oggetto

source: module
it_it: modulo
