Repository: Addivsyou/python-docs-it
Catalog: tutorial/interpreter.po
Languages: it_it

source: Using the Python Interpreter
it_it: Uso dell'interprete di Python

source: Invoking the Interpreter
it_it: Invocazione dell'interprete

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
it_it: alla shell. [#]_ Poiché la scelta della cartella in cui è situato l'interprete è un'opzione di installazione, è possibile trovarlo anche in altri percorsi; verificate con il vostro guru Python o con l'amministratore di sistema. (Ad esempio, :file:`/usr/local/python` è un'alternativa popolare.)

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
it_it: Digitando un carattere di fine file (:kbd:`Control-D` su Unix, :kbd:`Control-Z` su Windows) nel prompt, l'interprete esce con stato zero. Se non funziona, è possibile uscire dall'interprete digitando il seguente comando: ``quit()``.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
it_it: L'interprete opera in maniera simile alla shell Unix: quando viene chiamato con lo *standard input* collegato ad un dispositivo tty, legge ed esegue i comandi in modo interattivo; quando viene chiamato con un nome di file come argomento o con un file come *standard input*, legge ed esegue un *script* da quel file.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
it_it: Alcuni moduli Python sono utili anche come script. Questi possono essere invocati usando ``python -m module [arg] ...``, che esegue il file sorgente del *modulo* come se tu avessi scritto il suo nome completo sulla riga di comando.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
it_it: Quando si utilizza un file di script, a volte è utile essere in grado di eseguire lo script ed entrare in modalità interattiva in seguito. Questo può essere fatto passando :option:`-i` prima dello script.

source: All command line options are described in :ref:`using-on-general`.
it_it: Tutte le opzioni della riga di comando sono descritte in :ref:`using-on-general`.

source: Argument Passing
it_it: Passare Argomenti

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
it_it: Una volta resi noti all'interprete, il nome dello script e gli argomenti aggiuntivi vengono poi trasformati in una lista di stringhe e assegnati alla variabile ``argv`` nel modulo ``sys``. È possibile accedere a questa lista eseguendo ``importa sys``. La lunghezza della lista è almeno una; quando non viene dato alcuno script e nessun argomento, ``sys.argv[0]`` è una stringa vuota. Quando il nome dello script è dato come ``'-'`` (che significa ingresso standard), ``sys.argv[0]`` è settato a ``’-‘``. Quando è usato il *comando* :option:`-c`, ``sys.argv[0]`` viene settato a ``’-c’``. Quando viene usato il *modulo* :option:`-m`, ``sys.argv[0]`` viene impostato con il nome completo del modulo. Tutte le opzioni trovate dopo i comandi :option:`-c` o i moduli :option:`-m` non vengono consumati dell’interprete di Python che processa le opzioni, ma vengono lasciate in ``sys.argv`` in modo che vengano poi gestite manualmente dal comando o dal modulo.

source: Interactive Mode
it_it: Modalità Interattiva

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
it_it: Quando i comandi vengono letti da una tty, l'interprete è detto essere in *modo interattivo*. In questa modalità richiede il comando successivo con il *prompt*, di solito tre simboli di *maggiore di* (``>>>``); per le linee di continuazione viene emesso un *prompt* secondario, che per impostazione predefinita consiste di tre punti (``...``). L'interprete stampa un messaggio di benvenuto indicando il numero di versione e un avviso di copyright prima di stampare il *prompt*:

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
it_it: Le linee di continuazione sono necessarie quando si inserisce un costrutto su più linee. Come esempio, date un'occhiata a questa dichiarazione :keyword:`if`::

source: For more on interactive mode, see :ref:`tut-interac`.
it_it: Per ulteriori informazioni sulla modalità interattiva, vedere :ref:`tut-interac`.

source: The Interpreter and Its Environment
it_it: L'interprete e il suo ambiente

source: Source Code Encoding
it_it: Codifica del codice sorgente

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
it_it: Per impostazione predefinita, i file sorgente di Python sono trattati come codificati in UTF-8. In questa codifica, i caratteri della maggior parte delle lingue del mondo possono essere usati simultaneamente in stringhe, variabili e commenti --- la libreria standard tuttavia usa solo caratteri ASCII per le variabili, una convenzione che ogni codice portatile dovrebbe seguire. Per visualizzare correttamente tutti questi caratteri, l'editor deve riconoscere che il file è UTF-8, e deve utilizzare un font che supporti tutti i caratteri del file.

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
it_it: Per dichiarare una codifica diversa da quella predefinita, è necessario aggiungere un commento speciale come *prima* riga del file. La sintassi è la seguente::

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
it_it: dove *codifica* è uno dei :mod:`codecs` validi supportati da Python.

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
it_it: Per esempio, per dichiarare che deve essere usata la codifica Windows-1252, la prima riga del file del codice sorgente dovrebbe essere::

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
it_it: Un'eccezione alla regola della *prima linea* è quando il codice sorgente inizia con una linea :ref:`UNIX “shebang” line <tut-scripts>`. In questo caso, la dichiarazione della codifica dovrebbe essere aggiunta come seconda riga del file. Per esempio::

source: Footnotes
it_it: Note

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
it_it: Su Unix, l'interprete Python 3.x non è installato di default con l'eseguibile chiamato ``python``, in modo che non sia in conflitto con un eseguibile Python 2.x installato contemporaneamente.
