Repository: Addivsyou/python-docs-it
Catalog: tutorial/introduction.po
Languages: it_it

source: An Informal Introduction to Python
it_it: Un'introduzione informale a Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
it_it: Nei seguenti esempi, input e output si distinguono per la presenza o meno del prompt (:term:`>>>` e :term:`...`): per ripetere l'esempio, è necessario digitare tutto dopo il prompt, quando questo è presente; le righe che non iniziano con un prompt vengono emesse dall'interprete. Si noti che un prompt secondario su una linea da solo in un esempio significa che è necessario digitare una riga vuota; questo viene utilizzato per terminare un comando a più righe.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
it_it: Molti degli esempi di questo manuale, anche quelli inseriti al prompt interattivo, includono commenti. I commenti in Python iniziano con il carattere *hash*, ``#```, e si estendono fino alla fine della riga. Un commento può apparire all'inizio di una riga o dopo uno spazio bianco o codice, ma non all'interno di una stringa. Un carattere hash all'interno di una stringa letterale è solo un carattere. Poiché i commenti servono solo a chiarire il codice e non sono interpretati da Python, possono essere omessi quando si scrivono gli esempi.

source: Some examples::
it_it: Alcuni esempi::

source: Using Python as a Calculator
it_it: Usare Python come calcolatrice

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
it_it: Proviamo con alcuni semplici comandi di Python. Avviare l'interprete e attendere il prompt primario, ``>>>```. Non dovrebbe volerci molto.

source: Numbers
it_it: Numeri

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
it_it: I numeri interi (es. ``2``, ``4``, ``20``) hanno tipo :class:`int`, quelli in virgola mobile (es. ``5.0``, ``1.6``) hanno tipo :class:`float`. Torneremo a parlare ancora dei tipi numerici più avanti nel tutorial.

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
it_it: Con Python, è possibile utilizzare l'operatore ``**`` per calcolare le potenze [#]_::

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
it_it: Il segno uguale (``=``) è usato per assegnare un valore ad una variabile. Successivamente, nessun risultato viene visualizzato prima della successiva richiesta::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
it_it: Se una variabile non è stata ”definita" (a cui è stato assegnato un valore), usarla vi darà un errore::

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
it_it: C'è pieno supporto per i numeri in virgola mobile; gli operatori con operandi di tipo misto convertono l'intero in un numero in virgola mobile::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
it_it: In modalità interattiva, l'ultima espressione stampata viene assegnata alla variabile ```_``. Questo significa che quando si utilizza Python come calcolatrice da tavolo, è un po' più facile continuare i calcoli, ad esempio::

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
it_it: Questa variabile deve essere trattata dall'utente in sola lettura. Non va assegnato esplicitamente un valore ad essa --- si dovrebbe invece creare una variabile locale indipendente con lo stesso nome, mascherando così la variabile *built-in* e il suo comportamento magico.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
it_it: Oltre a :class:`int` e :class:`float`, Python supporta altri tipi di numeri, come :class:`~decimal.Decimal` e :class:`~fractions.Fraction`. Python ha anche il supporto incorporato per :ref:`complex numbers <typesnumeric>`, e usa il suffisso ``j`` o ``J`` per indicare la parte immaginaria (es. ``3+5j``).

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
it_it: Se non si desidera che i caratteri preceduti da ``\`` siano interpretati come caratteri speciali, è possibile utilizzare le cosiddette *raw strings* aggiungendo un ``r`` prima del primo apice::

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End of lines are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. The following example::
it_it: Le lettere letterali delle stringhe possono estendersi su più linee. Un modo è quello di usare gli apici tripli: ``"""..."""`` o ``'''...'''``. La fine delle linee sono automaticamente incluse nella stringa, ma è possibile evitare che ciò avvenga aggiungendo un ``\`` alla fine della linea. Il seguente esempio::

source: produces the following output (note that the initial newline is not included):
it_it: produce il seguente output (si noti che la nuova linea iniziale non è inclusa):

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
it_it: Le stringhe possono essere concatenate (incollate insieme) con l'operatore ``+`` e ripetute con ``*``::

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
it_it: Due o più *letterali di tipo stringa* (cioè quelli racchiusi tra virgolette) posizionati uno accanto all'altro sono automaticamente concatenati. ::

source: This feature is particularly useful when you want to break long strings::
it_it: Questa funzione è particolarmente utile quando si vogliono separare stringhe lunghe::

source: This only works with two literals though, not with variables or expressions::
it_it: Questo funziona solo con due letterali, ma non con variabili o *expression*::

source: If you want to concatenate variables or a variable and a literal, use ``+``::
it_it: Se volete concatenare variabili o una variabile e un letterale, usate ``+``::

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
it_it: Le stringhe possono essere *indicizzate* (sottoscritte), e il primo carattere ha indice 0. Non esiste un tipo carattere specifico; un carattere è semplicemente una stringa di dimensione uno::

source: Indices may also be negative numbers, to start counting from the right::
it_it: Gli indici possono anche essere numeri negativi, per iniziare a contare da destra::

source: Note that since -0 is the same as 0, negative indices start from -1.
it_it: N.B. Poiché -0 è uguale a 0, gli indici negativi partono da -1.

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
it_it: Nello slice gli indici hanno degli utili valori predefiniti; un primo indice omesso è zero, un secondo indice omesso è uguale alla dimensione della stringa che si sta tagliando:

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
it_it: Si noti come l'inizio sia sempre incluso, e la fine sempre esclusa. Questo fa sì che ``s[:i] + s[i:]`` è sempre uguale a ``s``::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
it_it: Un modo per ricordare come funzionano le fette è quello di pensare agli indici come al punto *tra* caratteri, con il bordo sinistro del primo carattere numerato 0. Poi il bordo destro dell'ultimo carattere di una stringa di caratteri *n* ha l'indice *n*, per esempio::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
it_it: La prima riga di numeri dà la posizione degli indici 0...6 nella stringa; la seconda riga dà i corrispondenti indici negativi. La porzione da *i* a *j* è costituita da tutti i caratteri tra i bordi contrassegnati rispettivamente con *i* e *j*.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
it_it: Per gli indici non negativi, la lunghezza di una fetta è la differenza degli indici, se entrambi sono entro i limiti. Per esempio, la lunghezza di ``word[1:3]`` è 2.

source: Attempting to use an index that is too large will result in an error::
it_it: Il tentativo di utilizzare un indice troppo grande comporta un errore::

source: However, out of range slice indexes are handled gracefully when used for slicing::
it_it: Tuttavia, gli indici delle sottostringhe fuori *range* (che superano la lunghezza della stringa) sono gestiti a modo quando vengono utilizzati per l'affettamento::

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
it_it: Le stringhe Python non possono essere modificate --- sono :term:`immutable`. Pertanto, l'assegnazione di una posizione indicizzata nella stringa comporta un errore::

source: If you need a different string, you should create a new one::
it_it: Se avete bisogno di una stringa diversa, dovreste crearne una nuova::

source: The built-in function :func:`len` returns the length of a string::
it_it: La funzione integrata :func:`len` restituisce la lunghezza di una stringa::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
it_it: Le stringhe sono esempi di *tipi di sequenze*, e supportano le operazioni comuni supportate da questi tipi di dato.

source: Strings support a large number of methods for basic transformations and searching.
it_it: Un gran numero di metodi per le trasformazioni di base e la ricerca sono supportati dalle stringhe.

source: String literals that have embedded expressions.
it_it: Stringhe con *expression* incorporate.

source: Information about string formatting with :meth:`str.format`.
it_it: Informazioni sulla formattazione delle stringhe con :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
it_it: Il vecchio metodo di formattazione, quello che prevede un template a sinistra dell'operatore ``%`` è descritto più dettagliatamente qui.

source: Lists
it_it: Liste

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
it_it: Python conosce un certo numero di tipi di dati *composti*, usati per raggruppare altri valori. La più versatile è la *lista*, che può essere scritta come una lista di valori separati da virgola (elementi) tra parentesi quadre. Gli elenchi possono contenere elementi di tipo diverso, ma di solito gli elementi hanno tutti lo stesso tipo. ::

source: Lists also support operations like concatenation::
it_it: Gli elenchi supportano anche operazioni come la concatenazione::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
it_it: A differenza delle stringhe, che sono :term:`immutable`, le liste sono di tipo :term:`mutable`, cioè è possibile modificarne il contenuto::

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
it_it: L'assegnazione a uno slice è anche possibile, per cambiare anche la dimensione della lista o cancellarne gli elementi completamente::

source: The built-in function :func:`len` also applies to lists::
it_it: La funzione :func:`len` si applica anche alle liste::

source: It is possible to nest lists (create lists containing other lists), for example::
it_it: E' possibile nidificare liste (creare liste contenenti altre liste), ad esempio::

source: First Steps Towards Programming
it_it: Primi passi di programmazione

source: This example introduces several new features.
it_it: Questo esempio introduce diverse nuove funzionalità.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
it_it: La prima riga contiene una *assegnazione multipla*: le variabili ``a`` e ``b`` ottengono simultaneamente i nuovi valori 0 e 1. Sull'ultima riga viene usata di nuovo, dimostrando che le espressioni sul lato destro sono tutte valutate prima di una qualsiasi delle assegnazioni. Le espressioni del lato destro sono valutate da sinistra a destra.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
it_it: Il ciclo :keyword:`while` viene eseguito finché la condizione (qui: ``a < 10``) rimane vera. In Python, come in C, qualsiasi valore intero diverso da zero è vero; zero è falso. La condizione può anche essere una stringa o un valore di lista, infatti qualsiasi sequenza; qualsiasi cosa con una lunghezza diversa da zero è vera, le sequenze vuote sono false. Il test utilizzato nell'esempio è un semplice confronto. Gli operatori di confronto standard sono scritti come in C: ``<`` (minore di), ``>`` (maggiore di), ``==`` (uguale a), ``<=`` (minore o uguale a), ``>=`` (maggiore o uguale a) e ``!=`` (diverso da).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
it_it: Il *corpo* del ciclo è *indentato*: l'indentazione è il modo di Python di raggruppare le istruzioni. Al prompt interattivo, è necessario digitare un tab o spazio/i per ogni riga rientrata. In pratica si prepara un input più complicato per Python con un editor di testo; tutti gli editor di testo seri hanno una funzione di auto-indentazione. Quando un'istruzione composta è inserita nella shell interattiva, deve essere seguita da una riga vuota per indicare il completamento (poiché l'analizzatore non può indovinare quando si è digitata l'ultima riga). Si noti che ogni riga all'interno di un blocco di base deve essere rientrata della stessa quantità.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
it_it: La funzione :func:`print` scrive il valore dell'argomento o degli argomenti che le vengono passati. Si differenzia dal solo scrivere l'espressione che si vuole scrivere (come abbiamo fatto in precedenza negli esempi della calcolatrice) per il modo in cui gestisce argomenti multipli, numeri in virgola mobile e stringhe. Le stringhe vengono stampate senza virgolette e viene inserito uno spazio tra gli elementi, in modo da poter formattare bene le cose, in questo modo::

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
it_it: L'argomento *end* può essere usato per evitare la nuova linea dopo l'output, o terminare l'output con una stringa diversa::

source: Footnotes
it_it: Note

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
it_it: Poiché ``**`` ha una precedenza superiore a ``-``, ``-3**2``` sarà interpretato come ``-(3**2)`` e quindi risulterà in ``-9``. Per evitare questo e ottenere ``9``, è possibile utilizzare ``(-3)**2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
it_it: A differenza di altri linguaggi, i caratteri speciali come ``\n`` hanno lo stesso significato sia con apici singoli (``’…’``) che doppi (``”…”``). L'unica differenza tra i due è che all'interno delle stringhe ad apici singoli non c’è bisogno di aggiungere il carattere di escaping prima del ``"`` (ma bisogna inserirlo prima di un ``\'``) e viceversa.
