Repository: Addivsyou/python-docs-it
Catalog: tutorial/stdlib.po
Languages: it_it

source: Brief Tour of the Standard Library
it_it: Breve Panoramica della Libreria Standard

source: Operating System Interface
it_it: Interfaccia del Sistema Operativo

source: The :mod:`os` module provides dozens of functions for interacting with the operating system::
it_it: Il modulo :mod:`os` fornisce dozzine di funzioni per interagire con il sistema operativo::

source: Be sure to use the ``import os`` style instead of ``from os import *``. This will keep :func:`os.open` from shadowing the built-in :func:`open` function which operates much differently.
it_it: Assicurati di usare lo stile ``import os`` invece di ``from os import *``. Questo eviterà che :func:`os.open` sovrasti la funzione built-in :func:`open` che opera in modo molto diverso.

source: The built-in :func:`dir` and :func:`help` functions are useful as interactive aids for working with large modules like :mod:`os`::
it_it: Le funzioni built-in :func:`dir` e :func:`help` sono utili come aiuti interattivi per lavorare con moduli grandi come :mod:`os`::

source: For daily file and directory management tasks, the :mod:`shutil` module provides a higher level interface that is easier to use::
it_it: Per attività quotidiane di gestione di file e directory, il modulo :mod:`shutil` fornisce un'interfaccia di livello superiore che è più facile da usare::

source: File Wildcards
it_it: Metacaratteri nei Nomfile

source: The :mod:`glob` module provides a function for making file lists from directory wildcard searches::
it_it: Il modulo :mod:`glob` fornisce una funzione per creare liste di file a partire da ricerche con metacaratteri nei nomi delle directory::

source: Command Line Arguments
it_it: Argomenti dalla Linea di Comando

source: Common utility scripts often need to process command line arguments. These arguments are stored in the :mod:`sys` module's *argv* attribute as a list. For instance, let's take the following :file:`demo.py` file::
it_it: Gli script di utilità comuni spesso necessitano di elaborare gli argomenti dalla linea di comando. Questi argomenti sono memorizzati nell'attributo *argv* del modulo :mod:`sys` come una lista. Per esempio, prendiamo il seguente file :file:`demo.py`::

source: Here is the output from running ``python demo.py one two three`` at the command line::
it_it: Qui c'è l'output eseguendo ``python demo.py one two three`` dalla linea di comando::

source: The :mod:`argparse` module provides a more sophisticated mechanism to process command line arguments. The following script extracts one or more filenames and an optional number of lines to be displayed::
it_it: Il modulo :mod:`argparse` fornisce un meccanismo più sofisticato per elaborare gli argomenti dalla linea di comando. Il seguente script estrae uno o più nomi di file e un numero opzionale di righe da visualizzare::

source: When run at the command line with ``python top.py --lines=5 alpha.txt beta.txt``, the script sets ``args.lines`` to ``5`` and ``args.filenames`` to ``['alpha.txt', 'beta.txt']``.
it_it: Quando eseguito dalla linea di comando con ``python top.py --lines=5 alpha.txt beta.txt``, lo script assegna ``args.lines`` a ``5`` e ``args.filenames`` a ``['alpha.txt', 'beta.txt']``.

source: Error Output Redirection and Program Termination
it_it: Reindirizzamento dell'Uscita degli Errori e Terminazione del Programma

source: The :mod:`sys` module also has attributes for *stdin*, *stdout*, and *stderr*. The latter is useful for emitting warnings and error messages to make them visible even when *stdout* has been redirected::
it_it: Il modulo :mod:`sys` ha anche attributi per *stdin*, *stdout* e *stderr*. Quest'ultimo è utile per emettere avvisi e messaggi di errore per renderli visibili anche quando *stdout* è stato reindirizzato::

source: The most direct way to terminate a script is to use ``sys.exit()``.
it_it: Il modo più diretto per terminare uno script è usare ``sys.exit()``.

source: String Pattern Matching
it_it: Pattern Matching di Stringhe

source: The :mod:`re` module provides regular expression tools for advanced string processing. For complex matching and manipulation, regular expressions offer succinct, optimized solutions::
it_it: Il modulo :mod:`re` fornisce strumenti per le espressioni regolari per l'elaborazione avanzata delle stringhe. Per il matching e la manipolazione complessi, le espressioni regolari offrono soluzioni concise e ottimizzate::

source: When only simple capabilities are needed, string methods are preferred because they are easier to read and debug::
it_it: Quando sono necessarie solo semplici capacità, i metodi delle stringhe sono preferiti perché sono più facili da leggere e fare debug::

source: Mathematics
it_it: Matematica

source: The :mod:`math` module gives access to the underlying C library functions for floating point math::
it_it: Il modulo :mod:`math` dà accesso alle funzioni della libreria C sottostante per la matematica a virgola mobile::

source: The :mod:`random` module provides tools for making random selections::
it_it: Il modulo :mod:`random` fornisce strumenti per effettuare selezioni casuali::

source: The :mod:`statistics` module calculates basic statistical properties (the mean, median, variance, etc.) of numeric data::
it_it: Il modulo :mod:`statistics` calcola proprietà statistiche di base (la media, la mediana, la varianza, ecc.) di dati numerici::

source: The SciPy project <https://scipy.org> has many other modules for numerical computations.
it_it: Il progetto SciPy <https://scipy.org> ha molti altri moduli per i calcoli numerici.

source: Internet Access
it_it: Accesso a Internet

source: There are a number of modules for accessing the internet and processing internet protocols. Two of the simplest are :mod:`urllib.request` for retrieving data from URLs and :mod:`smtplib` for sending mail::
it_it: Ci sono molti moduli per accedere a internet e processare i protocolli internet. Due dei più semplici sono :mod:`urllib.request` per recuperare dati da URL e :mod:`smtplib` per inviare mail::

source: (Note that the second example needs a mailserver running on localhost.)
it_it: (Nota che il secondo esempio ha bisogno di un mailserver in esecuzione su localhost.)

source: Dates and Times
it_it: Date e Orari

source: The :mod:`datetime` module supplies classes for manipulating dates and times in both simple and complex ways. While date and time arithmetic is supported, the focus of the implementation is on efficient member extraction for output formatting and manipulation. The module also supports objects that are timezone aware. ::
it_it: Il modulo :mod:`datetime` fornisce classi per manipolare date e orari in modi sia semplici che complessi. Mentre l'aritmetica su date e orari è supportata, l'obiettivo dell'implementazione è l'estrazione efficiente dei membri per la formattazione e la manipolazione dell'output. Il modulo supporta anche oggetti che sono consapevoli del fuso orario. ::

source: Data Compression
it_it: Compressione dei Dati

source: Common data archiving and compression formats are directly supported by modules including: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::
it_it: I formati comuni di archiviazione e compressione dei dati sono direttamente supportati dai moduli inclusi: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` e :mod:`tarfile`. ::

source: Performance Measurement
it_it: Misurazione delle Prestazioni

source: Some Python users develop a deep interest in knowing the relative performance of different approaches to the same problem. Python provides a measurement tool that answers those questions immediately.
it_it: Alcuni utenti di Python sviluppano un profondo interesse nel conoscere le prestazioni relative di diversi approcci allo stesso problema. Python fornisce uno strumento di misurazione che risponde a queste domande immediatamente.

source: For example, it may be tempting to use the tuple packing and unpacking feature instead of the traditional approach to swapping arguments. The :mod:`timeit` module quickly demonstrates a modest performance advantage::
it_it: Per esempio, può essere allettante usare la funzione di impacchettamento e spacchettamento delle tuple invece dell'approccio tradizionale per scambiare argomenti. Il modulo :mod:`timeit` dimostra rapidamente un modesto vantaggio in termini di prestazioni::

source: In contrast to :mod:`timeit`'s fine level of granularity, the :mod:`profile` and :mod:`pstats` modules provide tools for identifying time critical sections in larger blocks of code.
it_it: In contrasto con la fine granularità di :mod:`timeit`, i moduli :mod:`profile` e :mod:`pstats` forniscono strumenti per identificare le sezioni critiche in termini di tempo in blocchi di codice più grandi.

source: Quality Control
it_it: Controllo della Qualità

source: One approach for developing high quality software is to write tests for each function as it is developed and to run those tests frequently during the development process.
it_it: Un approccio per sviluppare software di alta qualità è scrivere test per ogni funzione mentre viene sviluppata e eseguire quei test frequentemente durante il processo di sviluppo.

source: The :mod:`doctest` module provides a tool for scanning a module and validating tests embedded in a program's docstrings. Test construction is as simple as cutting-and-pasting a typical call along with its results into the docstring. This improves the documentation by providing the user with an example and it allows the doctest module to make sure the code remains true to the documentation::
it_it: Il modulo :mod:`doctest` fornisce uno strumento per scansionare un modulo e validare i test incorporati nei docstring di un programma. La costruzione dei test è semplice come tagliare e incollare una tipica chiamata con i suoi risultati nel docstring. Questo migliora la documentazione fornendo all'utente un esempio e permette al modulo doctest di assicurarsi che il codice rimanga conforme alla documentazione::

source: The :mod:`unittest` module is not as effortless as the :mod:`doctest` module, but it allows a more comprehensive set of tests to be maintained in a separate file::
it_it: Il modulo :mod:`unittest` non è così semplice come il modulo :mod:`doctest`, ma permette di mantenere un insieme più completo di test in un file separato::

source: Batteries Included
it_it: Batterie Incluse

source: Python has a "batteries included" philosophy. This is best seen through the sophisticated and robust capabilities of its larger packages. For example:
it_it: Python ha una filosofia di "batterie incluse". Questo è reso evidente dalle capacità sofisticate e robuste dei suoi pacchetti più grandi. Per esempio:

source: The :mod:`xmlrpc.client` and :mod:`xmlrpc.server` modules make implementing remote procedure calls into an almost trivial task. Despite the modules' names, no direct knowledge or handling of XML is needed.
it_it: I moduli :mod:`xmlrpc.client` e :mod:`xmlrpc.server` rendono l'implementazione delle chiamate di procedure remote un compito quasi banale. Nonostante i nomi dei moduli, non è necessaria una conoscenza o una gestione diretta dell'XML.

source: The :mod:`email` package is a library for managing email messages, including MIME and other :rfc:`2822`-based message documents. Unlike :mod:`smtplib` and :mod:`poplib` which actually send and receive messages, the email package has a complete toolset for building or decoding complex message structures (including attachments) and for implementing internet encoding and header protocols.
it_it: Il pacchetto :mod:`email` è una libreria per la gestione dei messaggi email, inclusi i messaggi basati su MIME e altri documenti basati su :rfc:`2822`. A differenza di :mod:`smtplib` e :mod:`poplib` che effettivamente inviano e ricevono messaggi, il pacchetto email ha un set completo di strumenti per costruire o decodificare strutture di messaggi complessi (inclusi allegati) e per implementare protocolli di codifica internet e di intestazioni.

source: The :mod:`json` package provides robust support for parsing this popular data interchange format. The :mod:`csv` module supports direct reading and writing of files in Comma-Separated Value format, commonly supported by databases and spreadsheets. XML processing is supported by the :mod:`xml.etree.ElementTree`, :mod:`xml.dom` and :mod:`xml.sax` packages. Together, these modules and packages greatly simplify data interchange between Python applications and other tools.
it_it: Il pacchetto :mod:`json` fornisce un supporto robusto per il parsing di questo popolare formato di interscambio dati. Il modulo :mod:`csv` supporta la lettura e la scrittura diretta di file nel formato Comma-Separated Value, comunemente supportato da database e fogli di calcolo. L'elaborazione XML è supportata dai pacchetti :mod:`xml.etree.ElementTree`, :mod:`xml.dom` e :mod:`xml.sax`. Insieme, questi moduli e pacchetti semplificano notevolmente l'interscambio di dati tra applicazioni Python e altri strumenti.

source: The :mod:`sqlite3` module is a wrapper for the SQLite database library, providing a persistent database that can be updated and accessed using slightly nonstandard SQL syntax.
it_it: Il modulo :mod:`sqlite3` è un wrapper per la libreria del database SQLite, fornendo un database persistente che può essere aggiornato e accessibile utilizzando una sintassi SQL leggermente non standard.

source: Internationalization is supported by a number of modules including :mod:`gettext`, :mod:`locale`, and the :mod:`codecs` package.
it_it: L'internazionalizzazione è supportata da numerosi moduli tra cui :mod:`gettext`, :mod:`locale` e il pacchetto :mod:`codecs`.

source: built-in function
it_it: funzione built-in
