Repository: Addivsyou/python-docs-it
Catalog: tutorial/venv.po
Languages: it_it

source: Virtual Environments and Packages
it_it: Ambienti Virtuali e Pacchetti

source: Introduction
it_it: Introduzione

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
it_it: Le applicazioni Python spesso utilizzano pacchetti e moduli che non fanno parte della libreria standard. Le applicazioni a volte necessitano una versione specifica di una libreria, perché l'applicazione potrebbe richiedere che un bug particolare sia stato risolto o l'applicazione potrebbe essere stata scritta utilizzando una versione obsoleta dell'interfaccia della libreria.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
it_it: Questo significa che potrebbe non essere possibile per una singola installazione di Python soddisfare i requisiti di ogni applicazione. Se l'applicazione A necessita della versione 1.0 di un particolare modulo ma l'applicazione B necessita della versione 2.0, allora i requisiti sono in conflitto e l'installazione della versione 1.0 o 2.0 lascerà una delle applicazioni impossibilitata a funzionare.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
it_it: La soluzione a questo problema è creare un :term:`virtual environment`, un albero di directory auto-contenuto che contiene un'installazione di Python per una particolare versione di Python, più un numero di pacchetti aggiuntivi.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
it_it: Differenti applicazioni possono quindi utilizzare differenti ambienti virtuali. Per risolvere l'esempio precedente di requisiti in conflitto, l'applicazione A può avere il suo proprio ambiente virtuale con la versione 1.0 installata mentre l'applicazione B ha un altro ambiente virtuale con la versione 2.0. Se l'applicazione B richiede che una libreria venga aggiornata alla versione 3.0, questo non influenzerà l'ambiente dell'applicazione A.

source: Creating Virtual Environments
it_it: Creazione di Ambienti Virtuali

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will install the Python version from which the command was run (as reported by the :option:`--version` option). For instance, executing the command with ``python3.12`` will install version 3.12.
it_it: Il modulo utilizzato per creare e gestire ambienti virtuali si chiama :mod:`venv`. :mod:`venv` installerà la versione di Python dalla quale il comando è stato eseguito (come riportato dall'opzione :option:`--version`). Per esempio, eseguendo il comando con ``python3.12`` verrà installata la versione 3.12.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
it_it: Per creare un ambiente virtuale, decidi una directory dove vuoi posizionarlo ed esegui il modulo :mod:`venv` come script con il percorso della directory::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter and various supporting files.
it_it: Questo creerà la directory ``tutorial-env`` se non esiste, e creerà anche directory all'interno contenenti una copia dell'interprete Python e vari file di supporto.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
it_it: Una posizione comune per una directory di ambiente virtuale è ``.venv``. Questo nome mantiene la directory generalmente nascosta nella tua shell e quindi fuori mano, dando anche un nome che spiega il motivo dell'esistenza della directory. Previene anche conflitti con file di definizione di variabili d'ambiente ``.env`` che alcuni strumenti supportano.

source: Once you've created a virtual environment, you may activate it.
it_it: Una volta creato un ambiente virtuale, puoi attivarlo.

source: On Windows, run::
it_it: Su Windows, esegui::

source: On Unix or MacOS, run::
it_it: Su Unix o MacOS, esegui::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
it_it: (Questo script è scritto per la shell bash. Se utilizzi le shell :program:`csh` o :program:`fish`, ci sono script alternativi ``activate.csh`` e ``activate.fish`` che dovresti utilizzare.)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
it_it: Attivare l'ambiente virtuale cambierà il prompt della tua shell per mostrare quale ambiente virtuale stai utilizzando, e modificherà l'ambiente in modo che eseguire ``python`` ti fornirà quella versione e installazione particolare di Python. Per esempio:

source: To deactivate a virtual environment, type::
it_it: Per disattivare un ambiente virtuale, scrivi::

source: into the terminal.
it_it: nel terminale.

source: Managing Packages with pip
it_it: Gestione dei Pacchetti con pip

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the `Python Package Index <https://pypi.org>`_. You can browse the Python Package Index by going to it in your web browser.
it_it: Puoi installare, aggiornare e rimuovere pacchetti utilizzando un programma chiamato :program:`pip`. Per impostazione predefinita ``pip`` installerà pacchetti dal `Python Package Index <https://pypi.org>`_. Puoi sfogliare il Python Package Index andando sul sito web con il tuo browser.

source: ``pip`` has a number of subcommands: "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
it_it: ``pip`` ha un certo numero di sottocomandi: "install", "uninstall", "freeze", etc. (Consulta la guida :ref:`installing-index` per la documentazione completa su ``pip``.)

source: You can install the latest version of a package by specifying a package's name:
it_it: Puoi installare l'ultima versione di un pacchetto specificando il nome del pacchetto:

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
it_it: Puoi anche installare una versione specifica di un pacchetto fornendo il nome del pacchetto seguito da ``==`` e dal numero di versione:

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``python -m pip install --upgrade`` to upgrade the package to the latest version:
it_it: Se esegui nuovamente questo comando, ``pip`` noterà che la versione richiesta è già installata e non farà nulla. Puoi fornire un numero di versione diverso per ottenere quella versione, oppure puoi eseguire ``python -m pip install --upgrade`` per aggiornare il pacchetto all'ultima versione:

source: ``python -m pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
it_it: ``python -m pip uninstall`` seguito da uno o più nomi di pacchetti rimuoverà i pacchetti dall'ambiente virtuale.

source: ``python -m pip show`` will display information about a particular package:
it_it: ``python -m pip show`` mostrerà informazioni su un particolare pacchetto:

source: ``python -m pip list`` will display all of the packages installed in the virtual environment:
it_it: ``python -m pip list`` mostrerà tutti i pacchetti installati nell'ambiente virtuale:

source: ``python -m pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``python -m pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
it_it: ``python -m pip freeze`` produrrà una lista simile dei pacchetti installati, ma l'output utilizza il formato che ``python -m pip install`` si aspetta. Una convenzione comune è mettere questa lista in un file ``requirements.txt``:

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
it_it: Il ``requirements.txt`` può poi essere committato nel controllo di versione e distribuito come parte di un'applicazione. Gli utenti possono poi installare tutti i pacchetti necessari con ``install -r``:

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the `Python packaging user guide`_.
it_it: ``pip`` ha molte altre opzioni. Consulta la guida :ref:`installing-index` per la documentazione completa su ``pip``. Quando hai scritto un pacchetto e vuoi renderlo disponibile su Python Package Index, consulta la `guida dell'utente al packaging di Python`_.
