Repository: Addivsyou/python-docs-it
Catalog: tutorial/whatnow.po
Languages: it_it

source: What Now?
it_it: E adesso?

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
it_it: Probabilmente la lettura di questo tutorial ha rafforzato il tuo interesse nell'usare Python --- dovresti essere desideroso di applicare Python alla risoluzione dei tuoi problemi reali. Dove dovresti andare per imparare di più?

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
it_it: Questo tutorial fa parte della documentazione di Python. Altri documenti disponibili sono:

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
it_it: Dovresti sfogliare questo manuale, che fornisce materiale di riferimento completo (anche se conciso) sui tipi, le funzioni e i moduli nella libreria standard. La distribuzione standard di Python include *molto* codice aggiuntivo. Ci sono moduli per leggere caselle di posta Unix, recuperare documenti via HTTP, generare numeri casuali, analizzare opzioni da riga di comando, comprimere dati e molte altre attività. Sfogliare il Reference della libreria ti darà un'idea di ciò che è disponibile.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
it_it: :ref:`installing-index` spiega come installare moduli aggiuntivi scritti da altri utenti Python.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
it_it: :ref:`reference-index`: Una spiegazione dettagliata della sintassi e della semantica di Python. È una lettura impegnativa, ma è utile come guida completa al linguaggio stesso.

source: More Python resources:
it_it: Ulteriori risorse Python:

source: https://www.python.org: The major Python web site. It contains code, documentation, and pointers to Python-related pages around the web.
it_it: https://www.python.org: Il principale sito web di Python. Contiene codice, documentazione e collegamenti a pagine relative a Python in tutto il web.

source: https://docs.python.org: Fast access to Python's documentation.
it_it: https://docs.python.org: Accesso rapido alla documentazione di Python.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
it_it: https://pypi.org: L'Indice dei pacchetti Python, precedentemente anche soprannominato il Cheese Shop [#]_, è un indice di moduli Python creati dagli utenti che sono disponibili per il download. Una volta che inizi a rilasciare codice, puoi registrarlo qui in modo che altri possano trovarlo.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
it_it: https://code.activestate.com/recipes/langs/python/: Il Python Cookbook è una vasta raccolta di esempi di codice, moduli più grandi e script utili. Contributi particolarmente notevoli sono raccolti in un libro intitolato Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)

source: https://pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
it_it: https://pyvideo.org raccoglie collegamenti a video relativi a Python da conferenze e riunioni di gruppi di utenti.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
it_it: https://scipy.org: Il progetto Scientific Python include moduli per calcoli e manipolazioni di array veloci e una serie di pacchetti per attività come l'algebra lineare, le trasformate di Fourier, i risolutori non lineari, le distribuzioni di numeri casuali, l'analisi statistica e simili.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
it_it: Per domande e segnalazioni di problemi relativi a Python, puoi inviare un messaggio al newsgroup :newsgroup:`comp.lang.python`, o inviarli alla mailing list all'indirizzo python-list@python.org. Il newsgroup e la mailing list sono dei*gateway*, quindi i messaggi inviati a uno saranno automaticamente inoltrati all'altro. Ci sono centinaia di messaggi al giorno, che pongono (e rispondono) domande, suggeriscono nuove funzionalità e annunciano nuovi moduli. Gli archivi della mailing list sono disponibili su https://mail.python.org/pipermail/.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
it_it: Prima di inviare un messaggio, assicurati di controllare l'elenco delle :ref:`Domande più frequenti <faq-index>` (chiamato anche FAQ). La FAQ risponde a molte delle domande che vengono poste di nuovo e di nuovo, e potrebbe già contenere la soluzione per il tuo problema.

source: Footnotes
it_it: Note a piè di pagina

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
it_it: "Cheese Shop" è uno sketch dei Monty Python: un cliente entra in un negozio di formaggi, ma qualunque formaggio chieda, il commesso dice che è finito.
