Repository: Addivsyou/python-docs-it
Catalog: about.po
Languages: it_it

source: About these documents
it_it: Riguardo questa documentazione

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
it_it: Questi documenti sono stati generati da `Sphinx`_ a partire da sorgenti `reStructuredText`_, un elaboratore di documenti appositamente scritto per la documentazione di Python.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
it_it: Lo sviluppo della documentazione e della sua toolchain è uno lavoro svolto esclusivamente da volontari, proprio come lo stesso Python. Se si desidera contribuire, si prega di dare un'occhiata alla pagina :ref:`reporting-bugs` per avere maggiori informazioni su come farlo. Nuovi volontari sono sempre i benvenuti!

source: Many thanks go to:
it_it: Molte grazie a:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
it_it: Fred L. Drake, Jr., il creatore del software per generare documentazione Python e scrittore di gran parte del contenuto;

source: the `Docutils <https://docutils.sourceforge.io/>`_ project for creating reStructuredText and the Docutils suite;
it_it: il progetto `Docutils <https://docutils.sourceforge.io/>`_ per la creazione di reStructuredText e la suite Docutils;

source: Fredrik Lundh for his Alternative Python Reference project from which Sphinx got many good ideas.
it_it: Fredrik Lundh per il suo progetto Alternative Python Reference da cui Sphinx ha tratto molte buone idee.

source: Contributors to the Python Documentation
it_it: Volontari che hanno contribuito alla documentazione di Python

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
it_it: Molte persone hanno contribuito al linguaggio Python, alla libreria standard di Python e alla documentazione di Python. Vedi :source:`Misc/ACKS` nella distribuzione del codice sorgente di Python per un elenco parziale dei contributori.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
it_it: È solo con il contributo dei membri della comunità di Python che Python ha una documentazione così meravigliosa — Grazie!
