Repository: Addivsyou/python-docs-it
Catalog: bugs.po
Languages: it_it

source: Dealing with Bugs
it_it: Come comportarsi con i *bug*

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
it_it: Python è un linguaggio di programmazione maturo che ha ottenuto una reputazione di stabilità. Al fine di mantenere questa reputazione, gli sviluppatori saranno contenti di ricevere delle segnalazioni nel caso dovessi trovare eventuali errori in Python.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
it_it: A volte può essere più veloce correggere da soli i bug e contribuire mediante patch a Python, in quanto questo snellisce il processo e coinvolge meno persone. Impara come fare leggendo: :ref:`contribute <contributing-to-python>`.

source: Documentation bugs
it_it: Errori nella Documentazione

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
it_it: Se dovessi trovare errori in questa documentazione o desideri proporre un miglioramento, ti preghiamo di inviare una segnalazione su :ref:`tracker <using-the-tracker>`. Se dovessi avere anche un suggerimento su come risolvere il problema, aggiungilo!

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
it_it: Se hai poco tempo a disposizione, puoi anche inviare segnalazioni di errori nella documentazione, via email a docs@python.org (i *bug* comportamentali possono essere inviati a python-list@python.org). 'docs@' è una mailing list gestita da volontari; la vostra richiesta verrà notata, anche se potrebbe volerci un po' di tempo per essere elaborata.

source: A list of documentation bugs that have been submitted to the Python issue tracker.
it_it: Un elenco dei bug della documentazione che sono stati inviati al sistema di segnalazione dei problemi di Python.

source: Using the Python issue tracker
it_it: Utilizzo dell'Issue Tracker di Python

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
it_it: I report sui problemi di Python stesso devono essere inviati tramite il sistema di segnalazione dei problemi su GitHub (https://github.com/python/cpython/issues). Il sistema di segnalazione dei problemi su GitHub offre un modulo web che consente di inserire e inviare agli sviluppatori le informazioni pertinenti.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
it_it: Il primo passo per presentare un report è determinare se il problema è già stato segnalato. Il vantaggio di farlo, oltre a risparmiare tempo agli sviluppatori, è scoprire cosa è stato fatto per risolverlo; potrebbe essere che il problema sia già stato risolto per la prossima versione, o che siano necessarie ulteriori informazioni (in tal caso sei invitato a fornirle se puoi!). Per farlo, cerca nel tracker utilizzando la casella di ricerca in cima alla pagina.

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
it_it: Se il problema che stai segnalando non è già nell'elenco, accedi a GitHub. Se non hai già un account GitHub, crea un nuovo account utilizzando il link "Sign up". Non è possibile inviare un report di bug in modo anonimo.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
it_it: Essendo ora loggato, puoi inviare un problema. Clicca sul pulsante "New issue" nella barra superiore per segnalare un nuovo problema.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
it_it: Nel campo "Commento", descrivi in dettaglio il problema, includendo ciò che ti aspettavi e ciò che è successo. Assicurati di includere se sono stati coinvolti moduli di estensione e quale piattaforma hardware e software stavate utilizzando (incluse le informazioni sulle versioni, se dovesse essere utile).

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
it_it: Ogni report del problema verrà esaminato da uno sviluppatore che determinerà cosa deve essere fatto per correggere il problema. Riceverai un aggiornamento ogni volta che viene intrapresa un'azione sul problema.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
it_it: `Come segnalare efficacemente i bug <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
it_it: Articolo che specifica come creare un'utile segnalazione riguardo un *bug*. Descrive che tipo di informazione è utile e perché è utile.

source: `Bug Writing Guidelines <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
it_it: `Linee Guida per la segnalazione dei *Bug* <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
it_it: Informazioni su come scrivere una buona segnalazione di *bug*. Alcune di queste sono specifiche del progetto Mozilla, ma descrivono le buone pratiche generali.

source: Getting started contributing to Python yourself
it_it: Come iniziare a contribuire a Python in autonomia

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
it_it: Oltre a segnalare i bug che trovate, saranno apprezzate anche le eventuali *patch* per correggerli. Puoi trovare maggiori informazioni su come iniziare ad applicare la patch Python nella `Python Developer’s Guide`_. Se avete domande, la `core-mentorship mailing list`_ è un luogo amichevole per ottenere risposte a tutte le domande relative al processo di risoluzione dei problemi in Python.
