Repository: Addivsyou/python-docs-it
Catalog: library/functions.po
Languages: it_it

source: See also :ref:`typeiter`.
it_it: Vedi anche :ref:`typeiter`.

source: One useful application of the second form of :func:`iter` is to build a block-reader. For example, reading fixed-width blocks from a binary database file until the end of file is reached::
it_it: Una applicazione utile della seconda forma di :func:`iter` è costruire un lettore di blocchi. Ad esempio, leggere blocchi a larghezza fissa da un file di database binario fino a raggiungere la fine del file::

source: Return the length (the number of items) of an object. The argument may be a sequence (such as a string, bytes, tuple, list, or range) or a collection (such as a dictionary, set, or frozen set).
it_it: Restituisce la lunghezza (il numero di elementi) di un oggetto. L'argomento può essere una sequenza (come una stringa, bytes, tuple, list o range) o una collezione (come un dizionario, set o frozenset).

source: ``len`` raises :exc:`OverflowError` on lengths larger than :data:`sys.maxsize`, such as :class:`range(2 ** 100) <range>`.
it_it: ``len`` solleva :exc:`OverflowError` su lunghezze maggiori di :data:`sys.maxsize`, come :class:`range(2 ** 100) <range>`.

source: Rather than being a function, :class:`list` is actually a mutable sequence type, as documented in :ref:`typesseq-list` and :ref:`typesseq`.
it_it: Piuttosto che essere una funzione, :class:`list` è effettivamente un tipo di sequenza mutabile, come documentato in :ref:`typesseq-list` e :ref:`typesseq`.

source: Update and return a dictionary representing the current local symbol table. Free variables are returned by :func:`locals` when it is called in function blocks, but not in class blocks. Note that at the module level, :func:`locals` and :func:`globals` are the same dictionary.
it_it: Aggiorna e restituisce un dizionario che rappresenta la tabella dei simboli locali corrente. Le variabili libere vengono restituite da :func:`locals` quando viene chiamato nei blocchi funzione, ma non nei blocchi di classe. Nota che a livello di modulo, :func:`locals` e :func:`globals` sono lo stesso dizionario.

source: The contents of this dictionary should not be modified; changes may not affect the values of local and free variables used by the interpreter.
it_it: Il contenuto di questo dizionario non dovrebbe essere modificato; le modifiche potrebbero non influenzare i valori delle variabili locali e libere utilizzate dall'interprete.

source: Return an iterator that applies *function* to every item of *iterable*, yielding the results. If additional *iterables* arguments are passed, *function* must take that many arguments and is applied to the items from all iterables in parallel. With multiple iterables, the iterator stops when the shortest iterable is exhausted. For cases where the function inputs are already arranged into argument tuples, see :func:`itertools.starmap`\.
it_it: Restituisce un iteratore che applica *funzione* a ogni elemento di *iterabile*, producendo i risultati. Se vengono forniti ulteriori argomenti *iterable*, *function* deve prendere altrettanti argomenti ed è applicata agli elementi di tutti gli iterabili in parallelo. Con più iterabili, l'iteratore si ferma quando l'iterabile più corto è esaurito. Per i casi in cui gli input della funzione sono già disposti in tuple di argomenti, vedere :func:`itertools.starmap`\.

source: Return the largest item in an iterable or the largest of two or more arguments.
it_it: Restituisce l'elemento più grande in un iterabile o il più grande tra due o più argomenti.

source: If one positional argument is provided, it should be an :term:`iterable`. The largest item in the iterable is returned. If two or more positional arguments are provided, the largest of the positional arguments is returned.
it_it: Se viene fornito un solo argomento posizionale, dovrebbe essere un :term:`iterable`. Viene restituito l'elemento più grande dell'iterabile. Se vengono forniti due o più argomenti posizionali, viene restituito il più grande degli argomenti posizionali.

source: There are two optional keyword-only arguments. The *key* argument specifies a one-argument ordering function like that used for :meth:`list.sort`. The *default* argument specifies an object to return if the provided iterable is empty. If the iterable is empty and *default* is not provided, a :exc:`ValueError` is raised.
it_it: Ci sono due argomenti opzionali solo per parole chiave. L'argomento *key* specifica una funzione di ordinamento a un argomento, come quella utilizzata per :meth:`list.sort`. L'argomento *default* specifica un oggetto da restituire se l'iterabile fornito è vuoto. Se l'iterabile è vuoto e *default* non è fornito, viene sollevata una :exc:`ValueError`.

source: If multiple items are maximal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc, reverse=True)[0]`` and ``heapq.nlargest(1, iterable, key=keyfunc)``.
it_it: Se ci sono più elementi massimali, la funzione restituisce il primo che incontra. Questo è coerente con altri strumenti che preservano la stabilità dell'ordinamento come ``sorted(iterable, key=keyfunc, reverse=True)[0]`` e ``heapq.nlargest(1, iterable, key=keyfunc)``.

source: Added the *default* keyword-only parameter.
it_it: Aggiunto il parametro *default* solo per parole chiave.

source: The *key* can be ``None``.
it_it: L'argomento *key* può essere ``None``.

source: Return a "memory view" object created from the given argument. See :ref:`typememoryview` for more information.
it_it: Restituisce un oggetto "memory view" creato dall'argomento fornito. Vedi :ref:`typememoryview` per ulteriori informazioni.

source: Return the smallest item in an iterable or the smallest of two or more arguments.
it_it: Restituisce l'elemento più piccolo in un iterabile o il più piccolo tra due o più argomenti.

source: If one positional argument is provided, it should be an :term:`iterable`. The smallest item in the iterable is returned. If two or more positional arguments are provided, the smallest of the positional arguments is returned.
it_it: Se viene fornito un solo argomento posizionale, dovrebbe essere un :term:`iterable`. Viene restituito l'elemento più piccolo dell'iterabile. Se vengono forniti due o più argomenti posizionali, viene restituito il più piccolo degli argomenti posizionali.

source: If multiple items are minimal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc)[0]`` and ``heapq.nsmallest(1, iterable, key=keyfunc)``.
it_it: Se ci sono più elementi minimi, la funzione restituisce il primo che incontra. Questo è coerente con altri strumenti che preservano la stabilità dell'ordinamento come ``sorted(iterable, key=keyfunc)[0]`` e ``heapq.nsmallest(1, iterable, key=keyfunc)``.

source: Retrieve the next item from the :term:`iterator` by calling its :meth:`~iterator.__next__` method. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopIteration` is raised.
it_it: Recupera l'elemento successivo dall':term:`iterator` chiamando il suo metodo :meth:`~iterator.__next__`. Se viene fornito *default*, esso viene restituito se l'iteratore è esaurito, altrimenti viene sollevata l'eccezione :exc:`StopIteration`.

source: Return a new featureless object. :class:`object` is a base for all classes. It has methods that are common to all instances of Python classes. This function does not accept any arguments.
it_it: Restituisce un nuovo oggetto senza caratteristiche. :class:`object` è una base per tutte le classi. Ha metodi comuni a tutte le istanze delle classi Python. Questa funzione non accetta alcun argomento.

source: :class:`object` does *not* have a :attr:`~object.__dict__`, so you can't assign arbitrary attributes to an instance of the :class:`object` class.
it_it: :class:`object` non ha un :attr:`~object.__dict__`, quindi non puoi assegnare attributi arbitrari a un'istanza della classe :class:`object`.

source: Convert an integer number to an octal string prefixed with "0o". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. For example:
it_it: Converte un numero intero in una stringa ottale preceduta da "0o". Il risultato è un'istruzione valida in Python. Se *x* non è un oggetto Python :class:`int`, deve definire un metodo :meth:`~object.__index__` che restituisce un intero. Ad esempio:

source: If you want to convert an integer number to an octal string either with the prefix "0o" or not, you can use either of the following ways.
it_it: Se vuoi convertire un numero intero in una stringa ottale con o senza il prefisso "0o", puoi usare uno dei seguenti modi.

source: Open *file* and return a corresponding :term:`file object`. If the file cannot be opened, an :exc:`OSError` is raised. See :ref:`tut-files` for more examples of how to use this function.
it_it: Apre *file* e restituisce un corrispondente :term:`file object`. Se il file non può essere aperto, viene sollevata un'eccezione :exc:`OSError`. Vedi :ref:`tut-files` per ulteriori esempi su come utilizzare questa funzione.

source: *file* is a :term:`path-like object` giving the pathname (absolute or relative to the current working directory) of the file to be opened or an integer file descriptor of the file to be wrapped. (If a file descriptor is given, it is closed when the returned I/O object is closed unless *closefd* is set to ``False``.)
it_it: *file* è un :term:`path-like object` che fornisce il percorso (assoluto o relativo alla directory di lavoro corrente) del file da aprire o un descrittore del file intero del file da incapsulare. (Se viene fornito un file descriptor, esso viene chiuso quando l'oggetto I/O restituito viene chiuso, a meno che *closefd* non sia impostato su ``False``.)

source: *mode* is an optional string that specifies the mode in which the file is opened. It defaults to ``'r'`` which means open for reading in text mode. Other common values are ``'w'`` for writing (truncating the file if it already exists), ``'x'`` for exclusive creation, and ``'a'`` for appending (which on *some* Unix systems, means that *all* writes append to the end of the file regardless of the current seek position). In text mode, if *encoding* is not specified the encoding used is platform-dependent: :func:`locale.getencoding()` is called to get the current locale encoding. (For reading and writing raw bytes use binary mode and leave *encoding* unspecified.) The available modes are:
it_it: *mode* è una stringa opzionale che specifica il modo in cui il file viene aperto. Il valore predefinito è ``'r'``, che significa aprire per la lettura in modalità testo. Altri valori comuni sono ``'w'`` per la scrittura (troncando il file se esiste già), ``'x'`` per la creazione esclusiva e ``'a'`` per l'aggiunta (che su *alcuni* sistemi Unix significa che *tutte* le scritture vengono aggiunte alla fine del file indipendentemente dalla posizione corrente del seek). In modalità testo, se *encoding* non è specificato, la codifica usata dipende dal sistema: viene chiamata :func:`locale.getencoding()` per ottenere la codifica locale corrente. (Per leggere e scrivere byte grezzi, usare la modalità binaria e lasciare *encoding* non specificato.) I modi disponibili sono:

source: Character
it_it: Carattere

source: Meaning
it_it: Significato

source: open for reading (default)
it_it: apri per lettura (predefinito)

source: open for writing, truncating the file first
it_it: apri per scrittura, troncando prima il file

source: open for exclusive creation, failing if the file already exists
it_it: apri per creazione esclusiva, fallendo se il file esiste già

source: open for writing, appending to the end of file if it exists
it_it: apri per scrittura, aggiungendo alla fine del file se esiste

source: binary mode
it_it: modalità binaria

source: text mode (default)
it_it: modalità testo (predefinito)

source: open for updating (reading and writing)
it_it: apri per aggiornamento (lettura e scrittura)

source: The default mode is ``'r'`` (open for reading text, a synonym of ``'rt'``). Modes ``'w+'`` and ``'w+b'`` open and truncate the file. Modes ``'r+'`` and ``'r+b'`` open the file with no truncation.
it_it: Il modo predefinito è ``'r'`` (aperto per la lettura di testo, sinonimo di ``'rt'``). I modi ``'w+'`` e ``'w+b'`` aprono il file e lo troncano. I modi ``'r+'`` e ``'r+b'`` aprono il file senza troncamento.

source: As mentioned in the :ref:`io-overview`, Python distinguishes between binary and text I/O. Files opened in binary mode (including ``'b'`` in the *mode* argument) return contents as :class:`bytes` objects without any decoding. In text mode (the default, or when ``'t'`` is included in the *mode* argument), the contents of the file are returned as :class:`str`, the bytes having been first decoded using a platform-dependent encoding or using the specified *encoding* if given.
it_it: Come menzionato nella :ref:`io-overview`, Python distingue tra I/O binario e di testo. I file aperti in modalità binaria (incluso ``'b'`` nell'argomento *mode*) restituiscono il contenuto come oggetti :class:`bytes` senza alcuna decodifica. In modalità testo (la predefinita, o quando ``'t'`` è incluso nell'argomento *mode*), il contenuto del file è restituito come :class:`str`, con i byte decodificati utilizzando una codifica dipendente dalla piattaforma o quella specificata dall'opzione *encoding* se fornita.

source: Python doesn't depend on the underlying operating system's notion of text files; all the processing is done by Python itself, and is therefore platform-independent.
it_it: Python non dipende dalla nozione di file di testo del sistema operativo sottostante; tutta l'elaborazione è fatta da Python stesso e quindi è indipendente dalla piattaforma.

source: *buffering* is an optional integer used to set the buffering policy. Pass 0 to switch buffering off (only allowed in binary mode), 1 to select line buffering (only usable when writing in text mode), and an integer > 1 to indicate the size in bytes of a fixed-size chunk buffer. Note that specifying a buffer size this way applies for binary buffered I/O, but ``TextIOWrapper`` (i.e., files opened with ``mode='r+'``) would have another buffering. To disable buffering in ``TextIOWrapper``, consider using the ``write_through`` flag for :func:`io.TextIOWrapper.reconfigure`. When no *buffering* argument is given, the default buffering policy works as follows:
it_it: *buffering* è un intero opzionale utilizzato per impostare la politica di buffering. Passa 0 per disattivare il buffering (consentito solo in modalità binaria), 1 per selezionare il line buffering (utilizzabile solo durante la scrittura in modalità testo) e un intero > 1 per indicare la dimensione in byte di un buffer a dimensione fissa. Nota che specificare una dimensione del buffer in questo modo si applica per I/O binario bufferizzato, ma ``TextIOWrapper`` (cioè, i file aperti con ``mode='r+'``) avrebbe un altro buffering. Per disabilitare il buffering in ``TextIOWrapper``, considera l'uso del flag ``write_through`` per :func:`io.TextIOWrapper.reconfigure`. Quando non viene dato l'argomento *buffering*, la politica di buffering predefinita funziona come segue:

source: Binary files are buffered in fixed-size chunks; the size of the buffer is chosen using a heuristic trying to determine the underlying device's "block size" and falling back on :const:`io.DEFAULT_BUFFER_SIZE`. On many systems, the buffer will typically be 4096 or 8192 bytes long.
it_it: I file binari sono bufferizzati in blocchi a dimensione fissa; la dimensione del buffer è scelta usando un'euristica che tenta di determinare la "dimensione del blocco" del dispositivo sottostante e ricade su :const:`io.DEFAULT_BUFFER_SIZE`. In molti sistemi, il buffer sarà tipicamente lungo 4096 o 8192 byte.

source: "Interactive" text files (files for which :meth:`~io.IOBase.isatty` returns ``True``) use line buffering. Other text files use the policy described above for binary files.
it_it: I file di testo "interattivi" (file per cui :meth:`~io.IOBase.isatty` restituisce ``True``) utilizzano il line buffering. Altri file di testo utilizzano la politica descritta sopra per i file binari.

source: *encoding* is the name of the encoding used to decode or encode the file. This should only be used in text mode. The default encoding is platform dependent (whatever :func:`locale.getencoding` returns), but any :term:`text encoding` supported by Python can be used. See the :mod:`codecs` module for the list of supported encodings.
it_it: *encoding* è il nome della codifica utilizzata per decodificare o codificare il file. Questo dovrebbe essere usato solo in modalità testo. La codifica predefinita dipende dalla piattaforma (qualsiasi cosa restituita da :func:`locale.getencoding`), ma qualsiasi :term:`text encoding` supportato da Python può essere utilizzato. Vedi il modulo :mod:`codecs` per l'elenco delle codifiche supportate.

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled—this cannot be used in binary mode. A variety of standard error handlers are available (listed under :ref:`error-handlers`), though any error handling name that has been registered with :func:`codecs.register_error` is also valid. The standard names include:
it_it: *errors* è una stringa opzionale che specifica come devono essere gestiti gli errori di codifica e decodifica — questo non può essere usato in modalità binaria. È disponibile una varietà di gestori di errore standard (elencati sotto :ref:`error-handlers`), anche se qualsiasi nome di gestione degli errori registrato con :func:`codecs.register_error` è anche valido. I nomi standard includono:

source: ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error. The default value of ``None`` has the same effect.
it_it: ``'strict'`` per sollevare un'eccezione :exc:`ValueError` se c'è un errore di codifica. Il valore predefinito di ``None`` ha lo stesso effetto.

source: ``'ignore'`` ignores errors. Note that ignoring encoding errors can lead to data loss.
it_it: ``'ignore'`` ignora gli errori. Nota che ignorare gli errori di codifica può portare a perdita di dati.

source: ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data.
it_it: ``'replace'`` fa sì che un marcatore di sostituzione (come ``'?'``) venga inserito dove ci sono dati malformati.

source: ``'surrogateescape'`` will represent any incorrect bytes as low surrogate code units ranging from U+DC80 to U+DCFF. These surrogate code units will then be turned back into the same bytes when the ``surrogateescape`` error handler is used when writing data. This is useful for processing files in an unknown encoding.
it_it: ``'surrogateescape'`` rappresenterà eventuali byte errati come unità di codice basso surrogate che vanno da U+DC80 a U+DCFF. Queste unità di codice surrogate verranno quindi trasformate di nuovo negli stessi byte quando il gestore di errori ``surrogateescape`` è utilizzato durante la scrittura dei dati. Questo è utile per elaborare file in una codifica sconosciuta.

source: ``'xmlcharrefreplace'`` is only supported when writing to a file. Characters not supported by the encoding are replaced with the appropriate XML character reference :samp:`&#{nnn};`.
it_it: ``'xmlcharrefreplace'`` è supportato solo durante la scrittura in un file. I caratteri non supportati dalla codifica sono sostituiti con il riferimento ai caratteri XML appropriato :samp:`&#{nnn};`.

source: ``'backslashreplace'`` replaces malformed data by Python's backslashed escape sequences.
it_it: ``'backslashreplace'`` sostituisce i dati malformati con le sequenze di escape con barra rovesciata di Python.

source: ``'namereplace'`` (also only supported when writing) replaces unsupported characters with ``\N{...}`` escape sequences.
it_it: ``'namereplace'`` (anche questo supportato solo durante la scrittura) sostituisce i caratteri non supportati con le sequenze di escape ``\N{...}``.

source: *newline* determines how to parse newline characters from the stream. It can be ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. It works as follows:
it_it: *newline* determina come analizzare i caratteri di nuova riga dal flusso. Può essere ``None``, ``''``, ``'\n'``, ``'\r'`` e ``'\r\n'``. Funziona come segue:

source: When reading input from the stream, if *newline* is ``None``, universal newlines mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If it is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If it has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
it_it: Quando si legge l'input dal flusso, se *newline* è ``None``, è attivata la modalità di nuove righe universali. Le righe nell'input possono terminare con ``'\n'``, ``'\r'`` o ``'\r\n'`` e queste sono tradotte in ``'\n'`` prima di essere restituite al chiamante. Se è ``''``, è attivata la modalità di nuove righe universali, ma le terminazioni di riga sono restituite al chiamante non tradotte. Se ha uno degli altri valori legali, le righe di input sono terminate solo dalla stringa data e la terminazione della riga è restituita al chiamante non tradotta.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
it_it: Quando si scrive l'output nel flusso, se *newline* è ``None``, qualsiasi carattere ``'\n'`` scritto è tradotto nel separatore di linea predefinito del sistema, :data:`os.linesep`. Se *newline* è ``''`` o ``'\n'``, non avviene alcuna traduzione. Se *newline* è uno degli altri valori legali, qualsiasi carattere ``'\n'`` scritto è tradotto nella stringa data.

source: If *closefd* is ``False`` and a file descriptor rather than a filename was given, the underlying file descriptor will be kept open when the file is closed. If a filename is given *closefd* must be ``True`` (the default); otherwise, an error will be raised.
it_it: Se *closefd* è ``False`` e viene fornito un descrittore di file anziché un nome file, il descrittore di file sottostante verrà mantenuto aperto quando il file viene chiuso. Se viene fornito un nome file, *closefd* deve essere ``True`` (predefinito); altrimenti verrà generato un errore.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
it_it: Un apri-file personalizzato può essere utilizzato passando un callable come *opener*. Il descrittore di file sottostante per l'oggetto file viene quindi ottenuto chiamando *opener* con (*file*, *flags*). *opener* deve restituire un descrittore di file aperto (passando :mod:`os.open` come *opener* si ottiene una funzionalità simile a quella di passare ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
it_it: Il file appena creato è :ref:`non-inheritable <fd_inheritance>`.
