Repository: Addivsyou/python-docs-it
Catalog: library/functions.po
Languages: it_it

source: The built-in :func:`sorted` function is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
it_it: La funzione built-in :func:`sorted` è garantita per essere stabile. Un ordinamento è stabile se garantisce di non modificare l'ordine relativo degli elementi che confronta uguali --- questo è utile per ordinare in più passaggi (per esempio, ordinare per reparto, poi per grado di stipendio).

source: The sort algorithm uses only ``<`` comparisons between items. While defining an :meth:`~object.__lt__` method will suffice for sorting, :PEP:`8` recommends that all six :ref:`rich comparisons <comparisons>` be implemented. This will help avoid bugs when using the same data with other ordering tools such as :func:`max` that rely on a different underlying method. Implementing all six comparisons also helps avoid confusion for mixed type comparisons which can call reflected the :meth:`~object.__gt__` method.
it_it: L'algoritmo di ordinamento utilizza solo confronti ``<`` tra gli elementi. Sebbene la definizione di un metodo :meth:`~object.__lt__` sia sufficiente per ordinare, :PEP:`8` raccomanda che tutte e sei le :ref:`comparazioni ricche <comparisons>` siano implementate. Questo aiuterà ad evitare bug quando si utilizza lo stesso dato con altri strumenti di ordinamento come :func:`max` che si basano su un metodo sottostante diverso. Implementare tutte e sei le comparazioni aiuta anche a evitare confusione per i confronti di tipo misto che possono chiamare il metodo riflesso :meth:`~object.__gt__`.

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
it_it: Per esempi di ordinamento e un breve tutorial sull'ordinamento, vedere :ref:`sortinghowto`.

source: Transform a method into a static method.
it_it: Trasforma un metodo in un metodo statico.

source: A static method does not receive an implicit first argument. To declare a static method, use this idiom::
it_it: Un metodo statico non riceve un argomento primo implicito. Per dichiarare un metodo statico, usa questo idiom::

source: The ``@staticmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
it_it: La forma ``@staticmethod`` è un :term:`decorator` di funzione -- vedere :ref:`function` per dettagli.

source: A static method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). Moreover, the static method :term:`descriptor` is also callable, so it can be used in the class definition (such as ``f()``).
it_it: Un metodo statico può essere chiamato sia sulla classe (come ``C.f()``) che su un'istanza (come ``C().f()``). Inoltre, il :term:`descriptor` del metodo statico è anche invocabile, quindi può essere utilizzato nella definizione della classe (come ``f()``).

source: Static methods in Python are similar to those found in Java or C++. Also, see :func:`classmethod` for a variant that is useful for creating alternate class constructors.
it_it: I metodi statici in Python sono simili a quelli trovati in Java o C++. Inoltre, vedere :func:`classmethod` per una variante utile per creare costruttori di classe alternativi.

source: Like all decorators, it is also possible to call ``staticmethod`` as a regular function and do something with its result. This is needed in some cases where you need a reference to a function from a class body and you want to avoid the automatic transformation to instance method. For these cases, use this idiom::
it_it: Come tutti i decoratori, è anche possibile chiamare ``staticmethod`` come una funzione regolare e fare qualcosa con il suo risultato. Questo è necessario in alcuni casi in cui è necessario un riferimento a una funzione dal corpo di una classe e si desidera evitare la trasformazione automatica a metodo istanza. Per questi casi, utilizza questo idiom::

source: For more information on static methods, see :ref:`types`.
it_it: Per maggiori informazioni sui metodi statici, vedere :ref:`types`.

source: Static methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``), have a new ``__wrapped__`` attribute, and are now callable as regular functions.
it_it: I metodi statici ora ereditano gli attributi del metodo (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` e ``__annotations__``), hanno un nuovo attributo ``__wrapped__``, e ora sono invocabili come funzioni regolari.

source: Return a :class:`str` version of *object*. See :func:`str` for details.
it_it: Restituisce una versione :class:`str` di *object*. Vedi :func:`str` per dettagli.

source: ``str`` is the built-in string :term:`class`. For general information about strings, see :ref:`textseq`.
it_it: ``str`` è la :term:`class` stringa built-in. Per informazioni generali sulle stringhe, vedere :ref:`textseq`.

source: Sums *start* and the items of an *iterable* from left to right and returns the total. The *iterable*'s items are normally numbers, and the start value is not allowed to be a string.
it_it: Somma *start* e gli elementi di un *iterable* da sinistra a destra e restituisce il totale. Gli elementi dell'*iterable* sono normalmente numeri, e il valore iniziale non può essere una stringa.

source: For some use cases, there are good alternatives to :func:`sum`. The preferred, fast way to concatenate a sequence of strings is by calling ``''.join(sequence)``. To add floating point values with extended precision, see :func:`math.fsum`\. To concatenate a series of iterables, consider using :func:`itertools.chain`.
it_it: Per alcuni casi d'uso, ci sono buone alternative a :func:`sum`. Il modo preferito e rapido per concatenare una sequenza di stringhe è chiamare ``''.join(sequence)``. Per aggiungere valori a virgola mobile con precisione estesa, vedere :func:`math.fsum`. Per concatenare una serie di oggetti iterabili, considera di usare :func:`itertools.chain`.

source: The *start* parameter can be specified as a keyword argument.
it_it: Il parametro *start* può essere specificato come argomento per parola chiave.

source: Summation of floats switched to an algorithm that gives higher accuracy on most builds.
it_it: La somma dei numeri in virgola mobile è stata cambiata in un algoritmo che offre una maggiore precisione nella maggior parte delle build.

source: Return a proxy object that delegates method calls to a parent or sibling class of *type*. This is useful for accessing inherited methods that have been overridden in a class.
it_it: Restituisce un oggetto proxy che delega le chiamate ai metodi a una classe genitrice o sorella di *type*. Questo è utile per accedere a metodi ereditati che sono stati sovrascritti in una classe.

source: The *object_or_type* determines the :term:`method resolution order` to be searched. The search starts from the class right after the *type*.
it_it: L'*object_or_type* determina l'ordine di risoluzione del :term:`method resolution order` da cercare. La ricerca inizia dalla classe subito dopo *type*.

source: For example, if :attr:`~class.__mro__` of *object_or_type* is ``D -> B -> C -> A -> object`` and the value of *type* is ``B``, then :func:`super` searches ``C -> A -> object``.
it_it: Per esempio, se l':attr:`~class.__mro__` di *object_or_type* è ``D -> B -> C -> A -> object`` e il valore di *type* è ``B``, allora :func:`super` cerca ``C -> A -> object``.

source: The :attr:`~class.__mro__` attribute of the *object_or_type* lists the method resolution search order used by both :func:`getattr` and :func:`super`. The attribute is dynamic and can change whenever the inheritance hierarchy is updated.
it_it: L'attributo :attr:`~class.__mro__` di *object_or_type* elenca l'ordine di ricerca per la risoluzione dei metodi usato sia da :func:`getattr` che da :func:`super`. L'attributo è dinamico e può cambiare ogni volta che la gerarchia di ereditarietà viene aggiornata.

source: If the second argument is omitted, the super object returned is unbound. If the second argument is an object, ``isinstance(obj, type)`` must be true. If the second argument is a type, ``issubclass(type2, type)`` must be true (this is useful for classmethods).
it_it: Se il secondo argomento viene omesso, l'oggetto super restituito non è associato ad alcuna istanza. Se il secondo argomento è un oggetto, ``isinstance(obj, type)`` deve essere vero. Se il secondo argomento è un tipo, ``issubclass(type2, type)`` deve essere vero (questo è utile per i classmethods).

source: There are two typical use cases for *super*. In a class hierarchy with single inheritance, *super* can be used to refer to parent classes without naming them explicitly, thus making the code more maintainable. This use closely parallels the use of *super* in other programming languages.
it_it: Ci sono due casi d'uso tipici per *super*. In una gerarchia di classi con ereditarietà singola, *super* può essere usato per riferirsi alle classi genitori senza nominarle esplicitamente, rendendo così il codice più mantenibile. Questo uso è molto simile all'uso di *super* in altri linguaggi di programmazione.

source: The second use case is to support cooperative multiple inheritance in a dynamic execution environment. This use case is unique to Python and is not found in statically compiled languages or languages that only support single inheritance. This makes it possible to implement "diamond diagrams" where multiple base classes implement the same method. Good design dictates that such implementations have the same calling signature in every case (because the order of calls is determined at runtime, because that order adapts to changes in the class hierarchy, and because that order can include sibling classes that are unknown prior to runtime).
it_it: Il secondo caso d'uso è supportare l'ereditarietà multipla cooperativa in un ambiente di esecuzione dinamico. Questo caso d'uso è unico per Python e non si trova nei linguaggi compilati staticamente o nei linguaggi che supportano solo l'ereditarietà singola. Questo rende possibile implementare "diagrammi a diamante" dove più classi base implementano lo stesso metodo. Un buon design richiede che tali implementazioni abbiano la stessa firma di chiamata in ogni caso (poiché l'ordine delle chiamate è determinato in fase di runtime, perché tale ordine si adatta ai cambiamenti nella gerarchia di classi e perché tale ordine può includere classi sorelle che sono sconosciute prima del runtime).

source: For both use cases, a typical superclass call looks like this::
it_it: Per entrambi i casi d'uso, una chiamata tipica alla superclass sembra così::

source: In addition to method lookups, :func:`super` also works for attribute lookups. One possible use case for this is calling :term:`descriptors <descriptor>` in a parent or sibling class.
it_it: Oltre alla ricerca di metodi, :func:`super` funziona anche per la ricerca degli attributi. Un possibile caso d'uso per questo è chiamare i :term:`descrittori <descriptor>` in una classe genitore o sorella.

source: Note that :func:`super` is implemented as part of the binding process for explicit dotted attribute lookups such as ``super().__getitem__(name)``. It does so by implementing its own :meth:`~object.__getattribute__` method for searching classes in a predictable order that supports cooperative multiple inheritance. Accordingly, :func:`super` is undefined for implicit lookups using statements or operators such as ``super()[name]``.
it_it: Nota che :func:`super` è implementato come parte del processo di associazione per le ricerche di attributi punteggiate esplicite come ``super().__getitem__(name)``. Lo fa implementando il proprio metodo :meth:`~object.__getattribute__` per la ricerca di classi in un ordine prevedibile che supporta l'ereditarietà multipla cooperativa. Di conseguenza, :func:`super` non è definito per le ricerche implicite utilizzando dichiarazioni o operatori come ``super()[name]``.

source: Also note that, aside from the zero argument form, :func:`super` is not limited to use inside methods. The two argument form specifies the arguments exactly and makes the appropriate references. The zero argument form only works inside a class definition, as the compiler fills in the necessary details to correctly retrieve the class being defined, as well as accessing the current instance for ordinary methods.
it_it: Nota anche che, a parte la forma con zero argomenti, :func:`super` non è limitato all'uso all'interno di metodi. La forma a due argomenti specifica esattamente gli argomenti e fa i riferimenti appropriati. La forma a zero argomenti funziona solo all'interno di una definizione di classe, poiché il compilatore riempie i dettagli necessari per recuperare correttamente la classe in fase di definizione, così come accedere all'istanza corrente per i metodi ordinari.

source: For practical suggestions on how to design cooperative classes using :func:`super`, see `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.
it_it: Per suggerimenti pratici su come progettare classi cooperative usando :func:`super`, vedi `guida all'uso di super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.

source: Rather than being a function, :class:`tuple` is actually an immutable sequence type, as documented in :ref:`typesseq-tuple` and :ref:`typesseq`.
it_it: Piuttosto che essere una funzione, :class:`tuple` è effettivamente un tipo di sequenza immutabile, come documentato in :ref:`typesseq-tuple` e :ref:`typesseq`.

source: With one argument, return the type of an *object*. The return value is a type object and generally the same object as returned by :attr:`object.__class__ <instance.__class__>`.
it_it: Con un argomento, restituisce il tipo di un *oggetto*. Il valore restituito è un oggetto di tipo ed è generalmente lo stesso oggetto restituito da :attr:`object.__class__ <instance.__class__>`.

source: The :func:`isinstance` built-in function is recommended for testing the type of an object, because it takes subclasses into account.
it_it: La funzione incorporata :func:`isinstance` è raccomandata per testare il tipo di un oggetto, poiché prende in considerazione le sottoclassi.

source: With three arguments, return a new type object. This is essentially a dynamic form of the :keyword:`class` statement. The *name* string is the class name and becomes the :attr:`~definition.__name__` attribute. The *bases* tuple contains the base classes and becomes the :attr:`~class.__bases__` attribute; if empty, :class:`object`, the ultimate base of all classes, is added. The *dict* dictionary contains attribute and method definitions for the class body; it may be copied or wrapped before becoming the :attr:`~object.__dict__` attribute. The following two statements create identical :class:`type` objects:
it_it: Con tre argomenti, restituisce un nuovo oggetto di tipo. Questo è essenzialmente una forma dinamica della dichiarazione :keyword:`class`. La stringa *name* è il nome della classe e diventa l'attributo :attr:`~definition.__name__`. La tupla *bases* contiene le classi base e diventa l'attributo :attr:`~class.__bases__`; se vuota, :class:`object`, la base ultima di tutte le classi, è aggiunta. Il dizionario *dict* contiene le definizioni di attributi e metodi per il corpo della classe; può essere copiato o avvolto prima di diventare l'attributo :attr:`~object.__dict__`. Le seguenti due dichiarazioni creano oggetti :class:`type` identici:

source: See also :ref:`bltin-type-objects`.
it_it: Vedi anche :ref:`bltin-type-objects`.

source: Keyword arguments provided to the three argument form are passed to the appropriate metaclass machinery (usually :meth:`~object.__init_subclass__`) in the same way that keywords in a class definition (besides *metaclass*) would.
it_it: Gli argomenti di parole chiave forniti alla forma a tre argomenti sono passati alla macchina adeguata della metaclasse (di solito :meth:`~object.__init_subclass__`) allo stesso modo degli argomenti di parole chiave in una definizione di classe (a parte *metaclass*).

source: See also :ref:`class-customization`.
it_it: Vedi anche :ref:`class-customization`.

source: Subclasses of :class:`type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
it_it: Le sottoclassi di :class:`type` che non sovrascrivono ``type.__new__`` possono non usare più la forma con un argomento per ottenere il tipo di un oggetto.

source: Return the :attr:`~object.__dict__` attribute for a module, class, instance, or any other object with a :attr:`~object.__dict__` attribute.
it_it: Restituisce l'attributo :attr:`~object.__dict__` per un modulo, classe, istanza o qualsiasi altro oggetto con un attributo :attr:`~object.__dict__`.

source: Objects such as modules and instances have an updateable :attr:`~object.__dict__` attribute; however, other objects may have write restrictions on their :attr:`~object.__dict__` attributes (for example, classes use a :class:`types.MappingProxyType` to prevent direct dictionary updates).
it_it: Oggetti come moduli e istanze hanno un attributo :attr:`~object.__dict__` aggiornabile; tuttavia, altri oggetti possono avere restrizioni di scrittura sui loro attributi :attr:`~object.__dict__` (ad esempio, le classi usano un :class:`types.MappingProxyType` per prevenire aggiornamenti diretti al dizionario).

source: Without an argument, :func:`vars` acts like :func:`locals`. Note, the locals dictionary is only useful for reads since updates to the locals dictionary are ignored.
it_it: Senza un argomento, :func:`vars` funziona come :func:`locals`. Nota, il dizionario locals è utile solo per le letture poiché le modifiche al dizionario locals vengono ignorate.

source: A :exc:`TypeError` exception is raised if an object is specified but it doesn't have a :attr:`~object.__dict__` attribute (for example, if its class defines the :attr:`~object.__slots__` attribute).
it_it: Viene sollevata un'eccezione :exc:`TypeError` se viene specificato un oggetto ma non possiede un attributo :attr:`~object.__dict__` (ad esempio, se la sua classe definisce l'attributo :attr:`~object.__slots__`).

source: Iterate over several iterables in parallel, producing tuples with an item from each one.
it_it: Itera su più iterabili in parallelo, producendo tuple con un elemento da ciascun iterabile.

source: Example::
it_it: Esempio::

source: More formally: :func:`zip` returns an iterator of tuples, where the *i*-th tuple contains the *i*-th element from each of the argument iterables.
it_it: Più formalmente: :func:`zip` restituisce un iteratore di tuple, dove la *i*-esima tupla contiene l'*i*-esimo elemento di ciascuno degli iterabili argomento.

source: Another way to think of :func:`zip` is that it turns rows into columns, and columns into rows. This is similar to `transposing a matrix <https://en.wikipedia.org/wiki/Transpose>`_.
it_it: Un altro modo di pensare a :func:`zip` è che trasforma righe in colonne e colonne in righe. Questo è simile a `trasporre una matrice <https://en.wikipedia.org/wiki/Transpose>`_.

source: :func:`zip` is lazy: The elements won't be processed until the iterable is iterated on, e.g. by a :keyword:`!for` loop or by wrapping in a :class:`list`.
it_it: :func:`zip` è pigro: gli elementi non saranno processati fino a quando l'iterabile non viene iterato, ad esempio, tramite un ciclo :keyword:`!for` o avvolgendolo in una :class:`list`.

source: One thing to consider is that the iterables passed to :func:`zip` could have different lengths; sometimes by design, and sometimes because of a bug in the code that prepared these iterables. Python offers three different approaches to dealing with this issue:
it_it: Una cosa da considerare è che gli iterabili passati a :func:`zip` potrebbero avere lunghezze diverse; a volte per progettazione e a volte a causa di un bug nel codice che ha preparato questi iterabili. Python offre tre approcci diversi per affrontare questo problema:

source: By default, :func:`zip` stops when the shortest iterable is exhausted. It will ignore the remaining items in the longer iterables, cutting off the result to the length of the shortest iterable::
it_it: Per impostazione predefinita, :func:`zip` si ferma quando l'iterabile più breve è esaurito. Ignorerà gli elementi rimanenti negli iterabili più lunghi, tagliando il risultato alla lunghezza dell'iterabile più corto::

source: :func:`zip` is often used in cases where the iterables are assumed to be of equal length. In such cases, it's recommended to use the ``strict=True`` option. Its output is the same as regular :func:`zip`::
it_it: :func:`zip` è spesso usato nei casi in cui si presume che gli iterabili abbiano la stessa lunghezza. In tali casi, è raccomandato usare l'opzione ``strict=True``. Il suo output è lo stesso del normale :func:`zip`::

source: Unlike the default behavior, it raises a :exc:`ValueError` if one iterable is exhausted before the others:
it_it: A differenza del comportamento predefinito, solleva un'eccezione :exc:`ValueError` se un iterabile è esaurito prima degli altri:

source: Without the ``strict=True`` argument, any bug that results in iterables of different lengths will be silenced, possibly manifesting as a hard-to-find bug in another part of the program.
it_it: Senza l'argomento ``strict=True``, qualsiasi bug che risulti in iterabili di lunghezze diverse verrà silenziato, possibilmente manifestandosi come un bug difficile da trovare in un'altra parte del programma.

source: Shorter iterables can be padded with a constant value to make all the iterables have the same length. This is done by :func:`itertools.zip_longest`.
it_it: Gli iterabili più corti possono essere imbottiti con un valore costante per rendere tutti gli iterabili della stessa lunghezza. Questo viene fatto da :func:`itertools.zip_longest`.

source: Edge cases: With a single iterable argument, :func:`zip` returns an iterator of 1-tuples. With no arguments, it returns an empty iterator.
it_it: Casi limite: Con un singolo argomento iterabile, :func:`zip` restituisce un iteratore di 1-tuple. Senza argomenti, restituisce un iteratore vuoto.

source: Tips and tricks:
it_it: Suggerimenti e trucchi:

source: The left-to-right evaluation order of the iterables is guaranteed. This makes possible an idiom for clustering a data series into n-length groups using ``zip(*[iter(s)]*n, strict=True)``. This repeats the *same* iterator ``n`` times so that each output tuple has the result of ``n`` calls to the iterator. This has the effect of dividing the input into n-length chunks.
it_it: L'ordine di valutazione da sinistra a destra degli iterabili è garantito. Questo rende possibile un idioma per raggruppare una serie di dati in gruppi di lunghezza n usando ``zip(*[iter(s)]*n, strict=True)``. Questo ripete lo *stesso* iteratore ``n`` volte in modo che ogni tupla di output contenga il risultato di ``n`` chiamate all'iteratore. Questo ha l'effetto di dividere l'input in blocchi di lunghezza n.

source: :func:`zip` in conjunction with the ``*`` operator can be used to unzip a list::
it_it: :func:`zip` in combinazione con l'operatore ``*`` può essere usato per separare una lista::

source: Added the ``strict`` argument.
it_it: Aggiunto l'argomento ``strict``.

source: This is an advanced function that is not needed in everyday Python programming, unlike :func:`importlib.import_module`.
it_it: Questa è una funzione avanzata che non è necessaria nella programmazione Python quotidiana, a differenza di :func:`importlib.import_module`.
