Repository: Addivsyou/python-docs-it
Catalog: library/functions.po
Languages: it_it

source: Built-in Functions
it_it: Funzioni Incorporate

source: The Python interpreter has a number of functions and types built into it that are always available. They are listed here in alphabetical order.
it_it: L'interprete Python ha un certo numero di funzioni e tipi incorporati che sono sempre disponibili. Sono elencati qui in ordine alfabetico.

source: Return the absolute value of a number. The argument may be an integer, a floating point number, or an object implementing :meth:`~object.__abs__`. If the argument is a complex number, its magnitude is returned.
it_it: Restituisce il valore assoluto di un numero. L'argomento può essere un intero, un numero in virgola mobile o un oggetto che implementa :meth:`~object.__abs__`. Se l'argomento è un numero complesso, ne viene restituita la magnitudine.

source: Return an :term:`asynchronous iterator` for an :term:`asynchronous iterable`. Equivalent to calling ``x.__aiter__()``.
it_it: Restituisce un :term:`asynchronous iterator` per un :term:`asynchronous iterable`. Equivalente a chiamare ``x.__aiter__()``.

source: Note: Unlike :func:`iter`, :func:`aiter` has no 2-argument variant.
it_it: Nota: A differenza di :func:`iter`, :func:`aiter` non ha una variante con 2 argomenti.

source: Return ``True`` if all elements of the *iterable* are true (or if the iterable is empty). Equivalent to::
it_it: Restituisce ``True`` se tutti gli elementi dell'*iterable* sono veri (o se l'iterable è vuoto). Equivalente a::

source: When awaited, return the next item from the given :term:`asynchronous iterator`, or *default* if given and the iterator is exhausted.
it_it: Quando viene atteso, restituisce l'elemento successivo dall':term:`asynchronous iterator` dato, o *default* se fornito e l'iteratore è esaurito.

source: This is the async variant of the :func:`next` builtin, and behaves similarly.
it_it: Questa è la variante asincrona del builtin :func:`next`, e si comporta in modo simile.

source: This calls the :meth:`~object.__anext__` method of *async_iterator*, returning an :term:`awaitable`. Awaiting this returns the next value of the iterator. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopAsyncIteration` is raised.
it_it: Questo chiama il metodo :meth:`~object.__anext__` di *async_iterator*, restituendo un :term:`awaitable`. Attendere questo restituisce il prossimo valore dell'iteratore. Se *default* è fornito, viene restituito se l'iteratore è esaurito, altrimenti viene sollevata l'eccezione :exc:`StopAsyncIteration`.

source: Return ``True`` if any element of the *iterable* is true. If the iterable is empty, return ``False``. Equivalent to::
it_it: Restituisce ``True`` se qualche elemento dell'*iterable* è vero. Se l'iterable è vuoto, restituisce ``False``. Equivalente a::

source: As :func:`repr`, return a string containing a printable representation of an object, but escape the non-ASCII characters in the string returned by :func:`repr` using ``\x``, ``\u``, or ``\U`` escapes. This generates a string similar to that returned by :func:`repr` in Python 2.
it_it: Come :func:`repr`, restituisce una stringa contenente una rappresentazione stampabile di un oggetto, ma escapa i caratteri non ASCII nella stringa restituita da :func:`repr` utilizzando le sequenze di escape ``\x``, ``\u`` o ``\U``. Ciò genera una stringa simile a quella restituita da :func:`repr` in Python 2.

source: Convert an integer number to a binary string prefixed with "0b". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. Some examples:
it_it: Converte un numero intero in una stringa binaria preceduta da "0b". Il risultato è un'espressione Python valida. Se *x* non è un oggetto :class:`int` di Python, deve definire un metodo :meth:`~object.__index__` che restituisce un intero. Alcuni esempi:

source: If the prefix "0b" is desired or not, you can use either of the following ways.
it_it: Se si desidera il prefisso "0b" oppure no, è possibile utilizzare uno dei seguenti modi.

source: See also :func:`format` for more information.
it_it: Vedi anche :func:`format` per maggiori informazioni.

source: Return a Boolean value, i.e. one of ``True`` or ``False``. The argument is converted using the standard :ref:`truth testing procedure <truth>`. If the argument is false or omitted, this returns ``False``; otherwise, it returns ``True``. The :class:`bool` class is a subclass of :class:`int` (see :ref:`typesnumeric`). It cannot be subclassed further. Its only instances are ``False`` and ``True`` (see :ref:`typebool`).
it_it: Restituisce un valore booleano, ossia uno tra ``True`` o ``False``. L'argomento viene convertito utilizzando la procedura standard di :ref:`verifica della verità <truth>`. Se l'argomento è falso o omesso, restituisce ``False``; altrimenti, restituisce ``True``. La classe :class:`bool` è una sottoclasse di :class:`int` (vedi :ref:`typesnumeric`). Non può essere ulteriormente sottoclassata. I suoi unici istanze sono ``False`` e ``True`` (vedi :ref:`typebool`).

source: The parameter is now positional-only.
it_it: Il parametro ora è solo posizionale.

source: This function drops you into the debugger at the call site. Specifically, it calls :func:`sys.breakpointhook`, passing ``args`` and ``kws`` straight through. By default, ``sys.breakpointhook()`` calls :func:`pdb.set_trace()` expecting no arguments. In this case, it is purely a convenience function so you don't have to explicitly import :mod:`pdb` or type as much code to enter the debugger. However, :func:`sys.breakpointhook` can be set to some other function and :func:`breakpoint` will automatically call that, allowing you to drop into the debugger of choice. If :func:`sys.breakpointhook` is not accessible, this function will raise :exc:`RuntimeError`.
it_it: Questa funzione ti porta nel debugger nel punto in cui viene chiamata. In particolare, chiama :func:`sys.breakpointhook`, passando ``args`` e ``kws`` direttamente. Per impostazione predefinita, ``sys.breakpointhook()`` chiama :func:`pdb.set_trace()` senza argomenti. In questo caso, è puramente una funzione di comodità in modo da non dover importare esplicitamente :mod:`pdb` o digitare tanto codice per entrare nel debugger. Tuttavia, :func:`sys.breakpointhook` può essere impostata su un'altra funzione e :func:`breakpoint` la chiamerà automaticamente, permettendo di entrare nel debugger a scelta. Se :func:`sys.breakpointhook` non è accessibile, questa funzione solleverà :exc:`RuntimeError`.

source: By default, the behavior of :func:`breakpoint` can be changed with the :envvar:`PYTHONBREAKPOINT` environment variable. See :func:`sys.breakpointhook` for usage details.
it_it: Per impostazione predefinita, il comportamento di :func:`breakpoint` può essere modificato con la variabile d'ambiente :envvar:`PYTHONBREAKPOINT`. Vedi :func:`sys.breakpointhook` per i dettagli d'uso.

source: Note that this is not guaranteed if :func:`sys.breakpointhook` has been replaced.
it_it: Nota che ciò non è garantito se :func:`sys.breakpointhook` è stato sostituito.

source: Raises an :ref:`auditing event <auditing>` ``builtins.breakpoint`` with argument ``breakpointhook``.
it_it: Solleva un :ref:`evento di auditing <auditing>` ``builtins.breakpoint`` con l'argomento ``breakpointhook``.

source: Return a new array of bytes. The :class:`bytearray` class is a mutable sequence of integers in the range 0 <= x < 256. It has most of the usual methods of mutable sequences, described in :ref:`typesseq-mutable`, as well as most methods that the :class:`bytes` type has, see :ref:`bytes-methods`.
it_it: Restituisce un nuovo array di byte. La classe :class:`bytearray` è una sequenza mutabile di interi nell'intervallo 0 <= x < 256. Ha la maggior parte dei metodi usuali delle sequenze mutabili, descritti in :ref:`typesseq-mutable`, oltre alla maggior parte dei metodi che il tipo :class:`bytes` ha, vedi :ref:`bytes-methods`.

source: The optional *source* parameter can be used to initialize the array in a few different ways:
it_it: Il parametro opzionale *source* può essere utilizzato per inizializzare l'array in diversi modi:

source: If it is a *string*, you must also give the *encoding* (and optionally, *errors*) parameters; :func:`bytearray` then converts the string to bytes using :meth:`str.encode`.
it_it: Se è una *string*, devi anche dare i parametri *encoding* (e facoltativamente, *errors*); :func:`bytearray` quindi converte la stringa in byte utilizzando :meth:`str.encode`.

source: If it is an *integer*, the array will have that size and will be initialized with null bytes.
it_it: Se è un *integer*, l'array avrà quella dimensione e sarà inizializzato con byte nulli.

source: If it is an object conforming to the :ref:`buffer interface <bufferobjects>`, a read-only buffer of the object will be used to initialize the bytes array.
it_it: Se è un oggetto conforme all':ref:`interfaccia buffer <bufferobjects>`, un buffer di sola lettura dell'oggetto sarà utilizzato per inizializzare l'array di byte.

source: If it is an *iterable*, it must be an iterable of integers in the range ``0 <= x < 256``, which are used as the initial contents of the array.
it_it: Se è un *iterable*, deve essere un iterable di interi nell'intervallo ``0 <= x < 256``, che sono usati come contenuto iniziale dell'array.

source: Without an argument, an array of size 0 is created.
it_it: Senza un argomento, viene creato un array di dimensione 0.

source: See also :ref:`binaryseq` and :ref:`typebytearray`.
it_it: Vedi anche :ref:`binaryseq` e :ref:`typebytearray`.

source: Return a new "bytes" object which is an immutable sequence of integers in the range ``0 <= x < 256``. :class:`bytes` is an immutable version of :class:`bytearray` -- it has the same non-mutating methods and the same indexing and slicing behavior.
it_it: Restituisce un nuovo oggetto "bytes" che è una sequenza immutabile di interi nell'intervallo ``0 <= x < 256``. :class:`bytes` è una versione immutabile di :class:`bytearray` -- ha gli stessi metodi non mutanti e lo stesso comportamento di indicizzazione e slicing.

source: Accordingly, constructor arguments are interpreted as for :func:`bytearray`.
it_it: Di conseguenza, gli argomenti del costruttore sono interpretati come per :func:`bytearray`.

source: Bytes objects can also be created with literals, see :ref:`strings`.
it_it: Gli oggetti byte possono essere creati anche con letterali, vedi :ref:`strings`.

source: See also :ref:`binaryseq`, :ref:`typebytes`, and :ref:`bytes-methods`.
it_it: Vedi anche :ref:`binaryseq`, :ref:`typebytes`, e :ref:`bytes-methods`.

source: Return :const:`True` if the *object* argument appears callable, :const:`False` if not. If this returns ``True``, it is still possible that a call fails, but if it is ``False``, calling *object* will never succeed. Note that classes are callable (calling a class returns a new instance); instances are callable if their class has a :meth:`~object.__call__` method.
it_it: Restituisce :const:`True` se l'argomento *object* appare chiamabile, :const:`False` se non lo è. Se questo restituisce ``True``, è ancora possibile che una chiamata fallisca, ma se è ``False``, chiamare *object* non avrà mai successo. Nota che le classi sono chiamabili (chiamare una classe restituisce una nuova istanza); le istanze sono chiamabili se la loro classe ha un metodo :meth:`~object.__call__`.

source: This function was first removed in Python 3.0 and then brought back in Python 3.2.
it_it: Questa funzione è stata prima rimossa in Python 3.0 e poi reintegrata in Python 3.2.

source: Return the string representing a character whose Unicode code point is the integer *i*. For example, ``chr(97)`` returns the string ``'a'``, while ``chr(8364)`` returns the string ``'€'``. This is the inverse of :func:`ord`.
it_it: Restituisce la stringa che rappresenta un carattere il cui punto di codice Unicode è l'intero *i*. Ad esempio, ``chr(97)`` restituisce la stringa ``'a'``, mentre ``chr(8364)`` restituisce la stringa ``'€'``. Questo è l'inverso di :func:`ord`.

source: The valid range for the argument is from 0 through 1,114,111 (0x10FFFF in base 16). :exc:`ValueError` will be raised if *i* is outside that range.
it_it: L'intervallo valido per l'argomento va da 0 a 1.114.111 (0x10FFFF in base 16). Viene sollevata un'eccezione :exc:`ValueError` se *i* è fuori da questo intervallo.

source: Transform a method into a class method.
it_it: Trasforma un metodo in un metodo di classe.

source: A class method receives the class as an implicit first argument, just like an instance method receives the instance. To declare a class method, use this idiom::
it_it: Un metodo di classe riceve la classe come primo argomento implicito, proprio come un metodo di istanza riceve l'istanza. Per dichiarare un metodo di classe, utilizza questo idiom::

source: The ``@classmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
it_it: La forma ``@classmethod`` è un :term:`decorator` di funzione -- vedi :ref:`function` per i dettagli.

source: A class method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). The instance is ignored except for its class. If a class method is called for a derived class, the derived class object is passed as the implied first argument.
it_it: Un metodo di classe può essere chiamato sia sulla classe (come ``C.f()``) sia su un'istanza (come ``C().f()``). L'istanza è ignorata tranne che per la sua classe. Se un metodo di classe è chiamato per una classe derivata, l'oggetto della classe derivata è passato come primo argomento implicito.

source: Class methods are different than C++ or Java static methods. If you want those, see :func:`staticmethod` in this section. For more information on class methods, see :ref:`types`.
it_it: I metodi di classe sono diversi dai metodi statici di C++ o Java. Se desideri quelli, vedi :func:`staticmethod` in questa sezione. Per maggiori informazioni sui metodi di classe, vedi :ref:`types`.

source: Class methods can now wrap other :term:`descriptors <descriptor>` such as :func:`property`.
it_it: I metodi di classe ora possono avvolgere altri :term:`descrittori <descriptor>` come :func:`property`.

source: Class methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``) and have a new ``__wrapped__`` attribute.
it_it: I metodi di classe ora ereditano gli attributi del metodo (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` e ``__annotations__``) e hanno un nuovo attributo ``__wrapped__``.

source: Class methods can no longer wrap other :term:`descriptors <descriptor>` such as :func:`property`.
it_it: I metodi di classe non possono più avvolgere altri :term:`descrittori <descriptor>` come :func:`property`.

source: Compile the *source* into a code or AST object. Code objects can be executed by :func:`exec` or :func:`eval`. *source* can either be a normal string, a byte string, or an AST object. Refer to the :mod:`ast` module documentation for information on how to work with AST objects.
it_it: Compila il *source* in un oggetto codice o AST. Gli oggetti codice possono essere eseguiti da :func:`exec` o :func:`eval`. *source* può essere una stringa normale, una stringa di byte o un oggetto AST. Consulta la documentazione del modulo :mod:`ast` per informazioni su come lavorare con gli oggetti AST.

source: The *filename* argument should give the file from which the code was read; pass some recognizable value if it wasn't read from a file (``'<string>'`` is commonly used).
it_it: L'argomento *filename* dovrebbe indicare il file da cui il codice è stato letto; passa un valore riconoscibile se non è stato letto da un file (``'<string>'`` è comunemente utilizzato).

source: The *mode* argument specifies what kind of code must be compiled; it can be ``'exec'`` if *source* consists of a sequence of statements, ``'eval'`` if it consists of a single expression, or ``'single'`` if it consists of a single interactive statement (in the latter case, expression statements that evaluate to something other than ``None`` will be printed).
it_it: L'argomento *mode* specifica il tipo di codice che deve essere compilato; può essere ``'exec'`` se *source* è costituito da una sequenza di istruzioni, ``'eval'`` se è costituito da una singola espressione, o ``'single'`` se è costituito da una singola istruzione interattiva (in quest'ultimo caso, le istruzioni di espressione che valutano a qualcosa di diverso da ``None`` saranno stampate).

source: The optional arguments *flags* and *dont_inherit* control which :ref:`compiler options <ast-compiler-flags>` should be activated and which :ref:`future features <future>` should be allowed. If neither is present (or both are zero) the code is compiled with the same flags that affect the code that is calling :func:`compile`. If the *flags* argument is given and *dont_inherit* is not (or is zero) then the compiler options and the future statements specified by the *flags* argument are used in addition to those that would be used anyway. If *dont_inherit* is a non-zero integer then the *flags* argument is it -- the flags (future features and compiler options) in the surrounding code are ignored.
it_it: Gli argomenti opzionali *flags* e *dont_inherit* controllano quali :ref:`opzioni del compilatore <ast-compiler-flags>` devono essere attivate e quali :ref:`future features <future>` dovrebbero essere consentite. Se nessuno dei due è presente (o entrambi sono zero), il codice viene compilato con le stesse opzioni che influenzano il codice che chiama :func:`compile`. Se l'argomento *flags* è fornito e *dont_inherit* non è (o è zero) allora le opzioni del compilatore e le dichiarazioni future specificate dall'argomento *flags* vengono utilizzate in aggiunta a quelle che sarebbero comunque utilizzate. Se *dont_inherit* è un numero intero diverso da zero, l'argomento *flags* è quello -- le opzioni del compilatore (future features e opzioni del compilatore) nel codice circostante sono ignorate.

source: Compiler options and future statements are specified by bits which can be bitwise ORed together to specify multiple options. The bitfield required to specify a given future feature can be found as the :attr:`~__future__._Feature.compiler_flag` attribute on the :class:`~__future__._Feature` instance in the :mod:`__future__` module. :ref:`Compiler flags <ast-compiler-flags>` can be found in :mod:`ast` module, with ``PyCF_`` prefix.
it_it: Le opzioni del compilatore e le dichiarazioni future sono specificate da bit che possono essere combinati con l'operatore OR bit a bit per specificare più opzioni. Il campo di bit richiesto per specificare una particolare future feature può essere trovato come attributo :attr:`~__future__._Feature.compiler_flag` sull'istanza :class:`~__future__._Feature` nel modulo :mod:`__future__`. Le :ref:`flag del compilatore <ast-compiler-flags>` possono essere trovate nel modulo :mod:`ast`, con il prefisso ``PyCF_``.

source: The argument *optimize* specifies the optimization level of the compiler; the default value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
it_it: L'argomento *optimize* specifica il livello di ottimizzazione del compilatore; il valore predefinito ``-1`` seleziona il livello di ottimizzazione dell'interprete come indicato dalle opzioni :option:`-O`. I livelli espliciti sono ``0`` (nessuna ottimizzazione; ``__debug__`` è vero), ``1`` (gli assert vengono rimossi, ``__debug__`` è falso) o ``2`` (anche i docstring vengono rimossi).

source: This function raises :exc:`SyntaxError` if the compiled source is invalid, and :exc:`ValueError` if the source contains null bytes.
it_it: Questa funzione solleva :exc:`SyntaxError` se la sorgente compilata non è valida, e :exc:`ValueError` se la sorgente contiene byte nulli.

source: If you want to parse Python code into its AST representation, see :func:`ast.parse`.
it_it: Se vuoi fare il parsing del codice Python nella sua rappresentazione AST, vedi :func:`ast.parse`.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source``, ``filename``.
it_it: Solleva un :ref:`evento di auditing <auditing>` ``compile`` con argomenti ``source``, ``filename``.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source`` and ``filename``. This event may also be raised by implicit compilation.
it_it: Solleva un :ref:`evento di auditing <auditing>` ``compile`` con argomenti ``source`` e ``filename``. Questo evento può essere sollevato anche dalla compilazione implicita.

source: When compiling a string with multi-line code in ``'single'`` or ``'eval'`` mode, input must be terminated by at least one newline character. This is to facilitate detection of incomplete and complete statements in the :mod:`code` module.
it_it: Quando si compila una stringa con codice multi-linea in modalità ``'single'`` o ``'eval'``, l'input deve essere terminato da almeno un carattere di nuova riga. Questo per facilitare il rilevamento delle istruzioni incomplete e complete nel modulo :mod:`code`.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string when compiling to an AST object due to stack depth limitations in Python's AST compiler.
it_it: È possibile mandare in crash l'interprete Python con una stringa sufficientemente grande/complessa quando si compila in un oggetto AST a causa delle limitazioni della profondità dello stack del compilatore AST di Python.

source: Allowed use of Windows and Mac newlines. Also, input in ``'exec'`` mode does not have to end in a newline anymore. Added the *optimize* parameter.
it_it: Consentito l'uso delle newline di Windows e Mac. Inoltre, l'input in modalità ``'exec'`` non deve più terminare con una newline. Aggiunto il parametro *optimize*.

source: Previously, :exc:`TypeError` was raised when null bytes were encountered in *source*.
it_it: In precedenza, veniva sollevata un'eccezione :exc:`TypeError` quando venivano incontrati byte nulli nella sorgente.

source: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` can now be passed in flags to enable support for top-level ``await``, ``async for``, and ``async with``.
it_it: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` può ora essere passato in flags per abilitare il supporto per ``await``, ``async for`` e ``async with`` al livello superiore.

source: Convert a single string or number to a complex number, or create a complex number from real and imaginary parts.
it_it: Converte una singola stringa o numero in un numero complesso, oppure crea un numero complesso dalle parti reale e immaginaria.

source: Examples:
it_it: Esempi:
