Repository: Addivsyou/python-docs-it
Catalog: library/functions.po
Languages: it_it

source: This function is invoked by the :keyword:`import` statement. It can be replaced (by importing the :mod:`builtins` module and assigning to ``builtins.__import__``) in order to change semantics of the :keyword:`!import` statement, but doing so is **strongly** discouraged as it is usually simpler to use import hooks (see :pep:`302`) to attain the same goals and does not cause issues with code which assumes the default import implementation is in use. Direct use of :func:`__import__` is also discouraged in favor of :func:`importlib.import_module`.
it_it: Questa funzione è invocata dalla dichiarazione :keyword:`import`. Può essere sostituita (importando il modulo :mod:`builtins` e assegnando a ``builtins.__import__``) al fine di cambiare la semantica della dichiarazione :keyword:`!import`, ma farlo è **fortemente** sconsigliato poiché è di solito più semplice usare gli hook di importazione (vedi :pep:`302`) per raggiungere gli stessi obiettivi e non causa problemi con il codice che assume che l'implementazione di importazione predefinita sia in uso. L'uso diretto di :func:`__import__` è anche sconsigliato a favore di :func:`importlib.import_module`.

source: The function imports the module *name*, potentially using the given *globals* and *locals* to determine how to interpret the name in a package context. The *fromlist* gives the names of objects or submodules that should be imported from the module given by *name*. The standard implementation does not use its *locals* argument at all and uses its *globals* only to determine the package context of the :keyword:`import` statement.
it_it: La funzione importa il modulo *name*, potenzialmente utilizzando i *globals* e *locals* dati per determinare come interpretare il nome in un contesto di pacchetto. La *fromlist* fornisce i nomi degli oggetti o sottomoduli che dovrebbero essere importati dal modulo specificato da *name*. L'implementazione standard non utilizza affatto il suo argomento *locals* e utilizza il suo argomento *globals* solo per determinare il contesto di pacchetto della dichiarazione :keyword:`import`.

source: *level* specifies whether to use absolute or relative imports. ``0`` (the default) means only perform absolute imports. Positive values for *level* indicate the number of parent directories to search relative to the directory of the module calling :func:`__import__` (see :pep:`328` for the details).
it_it: *level* specifica se usare importazioni assolute o relative. ``0`` (il valore predefinito) significa eseguire solo importazioni assolute. Valori positivi per *level* indicano il numero di directory genitore da cercare relativi alla directory del modulo che chiama :func:`__import__` (vedi :pep:`328` per i dettagli).

source: When the *name* variable is of the form ``package.module``, normally, the top-level package (the name up till the first dot) is returned, *not* the module named by *name*. However, when a non-empty *fromlist* argument is given, the module named by *name* is returned.
it_it: Quando la variabile *name* è della forma ``package.module``, normalmente viene restituito il pacchetto di livello superiore (il nome fino al primo punto), *non* il modulo denominato *name*. Tuttavia, quando viene fornito un argomento *fromlist* non vuoto, viene restituito il modulo denominato *name*.

source: For example, the statement ``import spam`` results in bytecode resembling the following code::
it_it: Ad esempio, la dichiarazione ``import spam`` risulta in un bytecode simile al seguente codice::

source: The statement ``import spam.ham`` results in this call::
it_it: La dichiarazione ``import spam.ham`` risulta in questa chiamata::

source: Note how :func:`__import__` returns the toplevel module here because this is the object that is bound to a name by the :keyword:`import` statement.
it_it: Nota come :func:`__import__` restituisce qui il modulo di livello superiore perché questo è l'oggetto che viene associato a un nome dalla dichiarazione :keyword:`import`.

source: On the other hand, the statement ``from spam.ham import eggs, sausage as saus`` results in ::
it_it: D'altra parte, la dichiarazione ``from spam.ham import eggs, sausage as saus`` risulta in ::

source: Here, the ``spam.ham`` module is returned from :func:`__import__`. From this object, the names to import are retrieved and assigned to their respective names.
it_it: Qui, il modulo ``spam.ham`` viene restituito da :func:`__import__`. Da questo oggetto, vengono recuperati i nomi da importare e assegnati ai loro rispettivi nomi.

source: If you simply want to import a module (potentially within a package) by name, use :func:`importlib.import_module`.
it_it: Se vuoi semplicemente importare un modulo (potenzialmente all'interno di un pacchetto) per nome, usa :func:`importlib.import_module`.

source: Negative values for *level* are no longer supported (which also changes the default value to 0).
it_it: I valori negativi per *level* non sono più supportati (il che cambia anche il valore predefinito a 0).

source: When the command line options :option:`-E` or :option:`-I` are being used, the environment variable :envvar:`PYTHONCASEOK` is now ignored.
it_it: Quando vengono utilizzate le opzioni della linea di comando :option:`-E` o :option:`-I`, la variabile d'ambiente :envvar:`PYTHONCASEOK` viene ora ignorata.

source: Footnotes
it_it: Note a piè di pagina

source: Note that the parser only accepts the Unix-style end of line convention. If you are reading the code from a file, make sure to use newline conversion mode to convert Windows or Mac-style newlines.
it_it: Nota che il parser accetta solo la convenzione Unix per la fine della riga. Se stai leggendo il codice da un file, assicurati di usare la modalità di conversione delle interruzioni di riga per convertire le interruzioni di riga in stile Windows o Mac.

source: Boolean
it_it: Booleano

source: type
it_it: tipo

source: built-in function
it_it: funzione incorporata

source: Infinity
it_it: Infinito

source: string
it_it: stringa

source: format() (built-in function)
it_it: format() (funzione incorporata)

source: file object
it_it: oggetto file

source: open() built-in function
it_it: open() funzione incorporata

source: modes
it_it: modalità

source: universal newlines
it_it: interruzioni di riga universali

source: line-buffered I/O
it_it: I/O con buffer di linea

source: unbuffered I/O
it_it: I/O non bufferizzato

source: buffer size, I/O
it_it: dimensione buffer, I/O

source: I/O control
it_it: controllo I/O

source: text mode
it_it: modalità testo

source: module
it_it: modulo

source: str() (built-in function)
it_it: str() (funzione incorporata)

source: object
it_it: oggetto

source: statement
it_it: istruzione
