Repository: Addivsyou/python-docs-it
Catalog: library/functions.po
Languages: it_it

source: If the argument is a string, it should contain a decimal number, optionally preceded by a sign, and optionally embedded in whitespace. The optional sign may be ``'+'`` or ``'-'``; a ``'+'`` sign has no effect on the value produced. The argument may also be a string representing a NaN (not-a-number), or positive or negative infinity. More precisely, the input must conform to the :token:`~float:floatvalue` production rule in the following grammar, after leading and trailing whitespace characters are removed:
it_it: Se l'argomento è una stringa, dovrebbe contenere un numero decimale, facoltativamente preceduto da un segno, e facoltativamente incorporato in spazi bianchi. Il segno facoltativo può essere ``'+'`` o ``'-'``; un segno ``'+'`` non ha effetto sul valore prodotto. L'argomento può anche essere una stringa che rappresenta un NaN (not-a-number), o infinito positivo o negativo. Più precisamente, l'input deve conformarsi alla regola di produzione :token:`~float:floatvalue` nella seguente grammatica, dopo che sono stati rimossi i caratteri di spazio all'inizio e alla fine:

source: Case is not significant, so, for example, "inf", "Inf", "INFINITY", and "iNfINity" are all acceptable spellings for positive infinity.
it_it: La distinzione tra maiuscole e minuscole non è significativa, quindi, per esempio, "inf", "Inf", "INFINITY" e "iNfINity" sono tutte ortografie accettabili per l'infinito positivo.

source: Otherwise, if the argument is an integer or a floating point number, a floating point number with the same value (within Python's floating point precision) is returned. If the argument is outside the range of a Python float, an :exc:`OverflowError` will be raised.
it_it: In caso contrario, se l'argomento è un numero intero o a virgola mobile, viene restituito un numero a virgola mobile con lo stesso valore (entro la precisione dei numeri a virgola mobile di Python). Se l'argomento è al di fuori del range di un float di Python, viene sollevata un'eccezione :exc:`OverflowError`.

source: For a general Python object ``x``, ``float(x)`` delegates to ``x.__float__()``. If :meth:`~object.__float__` is not defined then it falls back to :meth:`~object.__index__`.
it_it: Per un oggetto Python generico ``x``, ``float(x)`` si delega a ``x.__float__()``. Se :meth:`~object.__float__` non è definito, si ritorna a :meth:`~object.__index__`.

source: If no argument is given, ``0.0`` is returned.
it_it: Se non viene fornito alcun argomento, viene restituito ``0.0``.

source: The float type is described in :ref:`typesnumeric`.
it_it: Il tipo float è descritto in :ref:`typesnumeric`.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__float__` is not defined.
it_it: Ritorna a :meth:`~object.__index__` se :meth:`~object.__float__` non è definito.

source: Convert a *value* to a "formatted" representation, as controlled by *format_spec*. The interpretation of *format_spec* will depend on the type of the *value* argument; however, there is a standard formatting syntax that is used by most built-in types: :ref:`formatspec`.
it_it: Converte un *value* in una rappresentazione "formattata", come controllato da *format_spec*. L'interpretazione di *format_spec* dipenderà dal tipo dell'argomento *value*; tuttavia, esiste una sintassi di formattazione standard utilizzata dalla maggior parte dei tipi integrati: :ref:`formatspec`.

source: The default *format_spec* is an empty string which usually gives the same effect as calling :func:`str(value) <str>`.
it_it: Il *format_spec* predefinito è una stringa vuota che di solito dà lo stesso effetto di una chiamata a :func:`str(value) <str>`.

source: A call to ``format(value, format_spec)`` is translated to ``type(value).__format__(value, format_spec)`` which bypasses the instance dictionary when searching for the value's :meth:`~object.__format__` method. A :exc:`TypeError` exception is raised if the method search reaches :mod:`object` and the *format_spec* is non-empty, or if either the *format_spec* or the return value are not strings.
it_it: Una chiamata a ``format(value, format_spec)`` viene tradotta in ``type(value).__format__(value, format_spec)`` che bypassa il dizionario dell'istanza quando si cerca il metodo :meth:`~object.__format__` del valore. Viene sollevata un'eccezione :exc:`TypeError` se la ricerca del metodo raggiunge :mod:`object` e *format_spec* non è vuoto, o se *format_spec* o il valore restituito non sono stringhe.

source: ``object().__format__(format_spec)`` raises :exc:`TypeError` if *format_spec* is not an empty string.
it_it: ``object().__format__(format_spec)`` solleva :exc:`TypeError` se *format_spec* non è una stringa vuota.

source: Return a new :class:`frozenset` object, optionally with elements taken from *iterable*. ``frozenset`` is a built-in class. See :class:`frozenset` and :ref:`types-set` for documentation about this class.
it_it: Restituisce un nuovo oggetto :class:`frozenset`, opzionalmente con elementi tratti da *iterable*. ``frozenset`` è una classe integrata. Vedi :class:`frozenset` e :ref:`types-set` per la documentazione su questa classe.

source: For other containers see the built-in :class:`set`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
it_it: Per altri contenitori vedere le classi integrate :class:`set`, :class:`list`, :class:`tuple` e :class:`dict`, così come il modulo :mod:`collections`.

source: Return the value of the named attribute of *object*. *name* must be a string. If the string is the name of one of the object's attributes, the result is the value of that attribute. For example, ``getattr(x, 'foobar')`` is equivalent to ``x.foobar``. If the named attribute does not exist, *default* is returned if provided, otherwise :exc:`AttributeError` is raised. *name* need not be a Python identifier (see :func:`setattr`).
it_it: Restituisce il valore dell'attributo nominato di *object*. *name* deve essere una stringa. Se la stringa è il nome di uno degli attributi dell'oggetto, il risultato è il valore di quell'attributo. Ad esempio, ``getattr(x, 'foobar')`` è equivalente a ``x.foobar``. Se l'attributo nominato non esiste, viene restituito *default* se fornito, altrimenti viene sollevata un'eccezione :exc:`AttributeError`. *name* non deve necessariamente essere un identificatore Python (vedi :func:`setattr`).

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to retrieve it with :func:`getattr`.
it_it: Poiché il :ref:`private name mangling <private-name-mangling>` avviene al momento della compilazione, è necessario manipolare manualmente il nome di un attributo privato (attributi con due underscore iniziali) per recuperarlo con :func:`getattr`.

source: Return the dictionary implementing the current module namespace. For code within functions, this is set when the function is defined and remains the same regardless of where the function is called.
it_it: Restituisce il dizionario che implementa lo spazio dei nomi del modulo corrente. Per il codice all'interno delle funzioni, questo viene impostato quando la funzione è definita e rimane lo stesso indipendentemente da dove la funzione viene chiamata.

source: The arguments are an object and a string. The result is ``True`` if the string is the name of one of the object's attributes, ``False`` if not. (This is implemented by calling ``getattr(object, name)`` and seeing whether it raises an :exc:`AttributeError` or not.)
it_it: Gli argomenti sono un oggetto e una stringa. Il risultato è ``True`` se la stringa è il nome di uno degli attributi dell'oggetto, ``False`` se non lo è. (Questo è implementato chiamando ``getattr(object, name)`` e verificando se solleva un'eccezione :exc:`AttributeError` o meno.)

source: Return the hash value of the object (if it has one). Hash values are integers. They are used to quickly compare dictionary keys during a dictionary lookup. Numeric values that compare equal have the same hash value (even if they are of different types, as is the case for 1 and 1.0).
it_it: Restituisce il valore hash dell'oggetto (se ne ha uno). I valori hash sono interi. Vengono utilizzati per confrontare rapidamente le chiavi del dizionario durante una ricerca nel dizionario. I valori numerici che risultano uguali hanno lo stesso valore hash (anche se sono di tipi diversi, come nel caso di 1 e 1.0).

source: For objects with custom :meth:`~object.__hash__` methods, note that :func:`hash` truncates the return value based on the bit width of the host machine.
it_it: Per gli oggetti con metodi personalizzati :meth:`~object.__hash__`, si noti che :func:`hash` tronca il valore restituito in base alla larghezza di bit della macchina ospite.

source: Invoke the built-in help system. (This function is intended for interactive use.) If no argument is given, the interactive help system starts on the interpreter console. If the argument is a string, then the string is looked up as the name of a module, function, class, method, keyword, or documentation topic, and a help page is printed on the console. If the argument is any other kind of object, a help page on the object is generated.
it_it: Avvia il sistema di aiuto integrato. (Questa funzione è destinata all'uso interattivo.) Se non viene fornito alcun argomento, il sistema di aiuto interattivo si avvia sulla console dell'interprete. Se l'argomento è una stringa, la stringa viene cercata come nome di un modulo, funzione, classe, metodo, parola chiave o argomento della documentazione, e viene stampata una pagina di aiuto sulla console. Se l'argomento è di qualsiasi altro tipo di oggetto, viene generata una pagina di aiuto sull'oggetto.

source: Note that if a slash(/) appears in the parameter list of a function when invoking :func:`help`, it means that the parameters prior to the slash are positional-only. For more info, see :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.
it_it: Si noti che se appare una barra (/) nell'elenco dei parametri di una funzione quando si invoca :func:`help`, significa che i parametri precedenti alla barra sono solo posizionali. Per ulteriori informazioni, vedere :ref:`la FAQ sugli argomenti solo posizionali <faq-positional-only-arguments>`.

source: This function is added to the built-in namespace by the :mod:`site` module.
it_it: Questa funzione viene aggiunta allo spazio dei nomi integrato dal modulo :mod:`site`.

source: Changes to :mod:`pydoc` and :mod:`inspect` mean that the reported signatures for callables are now more comprehensive and consistent.
it_it: Le modifiche a :mod:`pydoc` e :mod:`inspect` significano che le firme riportate per gli oggetti invocabili sono ora più complete e coerenti.

source: Convert an integer number to a lowercase hexadecimal string prefixed with "0x". If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. Some examples:
it_it: Converte un numero intero in una stringa esadecimale in minuscolo con prefisso "0x". Se *x* non è un oggetto :class:`int` di Python, deve definire un metodo :meth:`~object.__index__` che ritorna un intero. Alcuni esempi:

source: If you want to convert an integer number to an uppercase or lower hexadecimal string with prefix or not, you can use either of the following ways:
it_it: Se si desidera convertire un numero intero in una stringa esadecimale maiuscola o minuscola con prefisso o meno, è possibile utilizzare uno dei seguenti modi:

source: See also :func:`int` for converting a hexadecimal string to an integer using a base of 16.
it_it: Vedi anche :func:`int` per convertire una stringa esadecimale in un numero intero utilizzando una base di 16.

source: To obtain a hexadecimal string representation for a float, use the :meth:`float.hex` method.
it_it: Per ottenere una rappresentazione in stringa esadecimale di un float, utilizzare il metodo :meth:`float.hex`.

source: Return the "identity" of an object. This is an integer which is guaranteed to be unique and constant for this object during its lifetime. Two objects with non-overlapping lifetimes may have the same :func:`id` value.
it_it: Restituisce "l'identità" di un oggetto. Questo è un numero intero che è garantito essere unico e costante per questo oggetto durante la sua vita. Due oggetti con vite non sovrapposte possono avere lo stesso valore di :func:`id`.

source: This is the address of the object in memory.
it_it: Questo è l'indirizzo dell'oggetto in memoria.

source: Raises an :ref:`auditing event <auditing>` ``builtins.id`` with argument ``id``.
it_it: Solleva un :ref:`evento di auditing <auditing>` ``builtins.id`` con l'argomento ``id``.

source: If the *prompt* argument is present, it is written to standard output without a trailing newline. The function then reads a line from input, converts it to a string (stripping a trailing newline), and returns that. When EOF is read, :exc:`EOFError` is raised. Example::
it_it: Se l'argomento *prompt* è presente, viene scritto nello standard output senza un a capo finale. La funzione legge quindi una riga dall'input, la converte in una stringa (eliminando il newline finale) e la restituisce. Quando EOF viene letto, viene sollevata l'eccezione :exc:`EOFError`. Esempio::

source: If the :mod:`readline` module was loaded, then :func:`input` will use it to provide elaborate line editing and history features.
it_it: Se il modulo :mod:`readline` è stato caricato, allora :func:`input` lo utilizzerà per fornire funzionalità di modifica elaborata delle righe e cronologia.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt``.
it_it: Solleva un :ref:`evento di auditing <auditing>` ``builtins.input`` con l'argomento ``prompt``.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt`` before reading input
it_it: Solleva un :ref:`evento di auditing <auditing>` ``builtins.input`` con l'argomento ``prompt`` prima di leggere l'input.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with argument ``result``.
it_it: Solleva un :ref:`evento di auditing <auditing>` ``builtins.input/result`` con l'argomento ``result``.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with the result after successfully reading input.
it_it: Solleva un :ref:`evento di auditing <auditing>` ``builtins.input/result`` con il risultato dopo aver letto l'input con successo.

source: Return an integer object constructed from a number or a string, or return ``0`` if no arguments are given.
it_it: Restituisce un oggetto intero costruito da un numero o una stringa, o restituisce ``0`` se non vengono forniti argomenti.

source: If the argument defines :meth:`~object.__int__`, ``int(x)`` returns ``x.__int__()``. If the argument defines :meth:`~object.__index__`, it returns ``x.__index__()``. If the argument defines :meth:`~object.__trunc__`, it returns ``x.__trunc__()``. For floating point numbers, this truncates towards zero.
it_it: Se l'argomento definisce :meth:`~object.__int__`, ``int(x)`` restituisce ``x.__int__()``. Se l'argomento definisce :meth:`~object.__index__`, restituisce ``x.__index__()``. Se l'argomento definisce :meth:`~object.__trunc__`, restituisce ``x.__trunc__()``. Per i numeri in virgola mobile, questo tronca verso zero.

source: If the argument is not a number or if *base* is given, then it must be a string, :class:`bytes`, or :class:`bytearray` instance representing an integer in radix *base*. Optionally, the string can be preceded by ``+`` or ``-`` (with no space in between), have leading zeros, be surrounded by whitespace, and have single underscores interspersed between digits.
it_it: Se l'argomento non è un numero o se *base* è fornito, allora deve essere una stringa, un'istanza di :class:`bytes` o di :class:`bytearray` che rappresenta un intero in base *base*. Facoltativamente, la stringa può essere preceduta da ``+`` o ``-`` (senza spazio in mezzo), avere zeri di fronte, essere circondata da spazi bianchi e avere trattini bassi intercalati tra le cifre.

source: A base-n integer string contains digits, each representing a value from 0 to n-1. The values 0--9 can be represented by any Unicode decimal digit. The values 10--35 can be represented by ``a`` to ``z`` (or ``A`` to ``Z``). The default *base* is 10. The allowed bases are 0 and 2--36. Base-2, -8, and -16 strings can be optionally prefixed with ``0b``/``0B``, ``0o``/``0O``, or ``0x``/``0X``, as with integer literals in code. For base 0, the string is interpreted in a similar way to an :ref:`integer literal in code <integers>`, in that the actual base is 2, 8, 10, or 16 as determined by the prefix. Base 0 also disallows leading zeros: ``int('010', 0)`` is not legal, while ``int('010')`` and ``int('010', 8)`` are.
it_it: Una stringa intera in base-n contiene cifre, ciascuna rappresentante un valore da 0 a n-1. I valori 0-9 possono essere rappresentati da qualsiasi cifra decimale Unicode. I valori 10-35 possono essere rappresentati da ``a`` a ``z`` (o ``A`` a ``Z``). La base predefinita è 10. Le basi consentite sono 0 e 2-36. Le stringhe in base 2, 8 e 16 possono essere opzionalmente precedute dai prefissi ``0b``/``0B``, ``0o``/``0O`` o ``0x``/``0X``, come con i letterali interi nel codice. Per la base 0, la stringa viene interpretata in modo simile a un :ref:`letterale intero nel codice <integers>`, nel senso che la base effettiva è 2, 8, 10 o 16 come determinato dal prefisso. La base 0 disabilita anche gli zeri iniziali: ``int('010', 0)`` non è legale, mentre ``int('010')`` e ``int('010', 8)`` lo sono.

source: The integer type is described in :ref:`typesnumeric`.
it_it: Il tipo di intero è descritto in :ref:`typesnumeric`.

source: If *base* is not an instance of :class:`int` and the *base* object has a :meth:`base.__index__ <object.__index__>` method, that method is called to obtain an integer for the base. Previous versions used :meth:`base.__int__ <object.__int__>` instead of :meth:`base.__index__ <object.__index__>`.
it_it: Se *base* non è un'istanza di :class:`int` e l'oggetto *base* ha un metodo :meth:`base.__index__ <object.__index__>`, quel metodo viene chiamato per ottenere un intero per la base. Le versioni precedenti usavano :meth:`base.__int__ <object.__int__>` invece di :meth:`base.__index__ <object.__index__>`.

source: The first parameter is now positional-only.
it_it: Il primo parametro ora è solo posizionale.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__int__` is not defined.
it_it: Ritorna a :meth:`~object.__index__` se :meth:`~object.__int__` non è definito.

source: The delegation to :meth:`~object.__trunc__` is deprecated.
it_it: La delega a :meth:`~object.__trunc__` è deprecata.

source: :class:`int` string inputs and string representations can be limited to help avoid denial of service attacks. A :exc:`ValueError` is raised when the limit is exceeded while converting a string to an :class:`int` or when converting an :class:`int` into a string would exceed the limit. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation.
it_it: Gli input stringa e le rappresentazioni stringa della classe :class:`int` possono essere limitati per evitare attacchi denial of service. Viene sollevata un'eccezione :exc:`ValueError` quando il limite viene superato mentre si converte una stringa in un :class:`int` o quando la conversione di un :class:`int` in una stringa supera il limite. Vedi la documentazione :ref:`limitazione della lunghezza della stringa di conversione intera <int_max_str_digits>`.

source: Return ``True`` if the *object* argument is an instance of the *classinfo* argument, or of a (direct, indirect, or :term:`virtual <abstract base class>`) subclass thereof. If *object* is not an object of the given type, the function always returns ``False``. If *classinfo* is a tuple of type objects (or recursively, other such tuples) or a :ref:`types-union` of multiple types, return ``True`` if *object* is an instance of any of the types. If *classinfo* is not a type or tuple of types and such tuples, a :exc:`TypeError` exception is raised. :exc:`TypeError` may not be raised for an invalid type if an earlier check succeeds.
it_it: Restituisce ``True`` se l'argomento *object* è un'istanza dell'argomento *classinfo*, o di una sua sottoclasse (diretta, indiretta o :term:`virtual <abstract base class>`). Se *object* non è un oggetto di quel tipo, la funzione restituisce sempre ``False``. Se *classinfo* è una tupla di oggetti di tipo (o ricorsivamente, altre tuple di questo tipo) o una :ref:`types-union` di più tipi, restituisce ``True`` se *object* è un'istanza di uno qualsiasi dei tipi. Se *classinfo* non è un tipo o una tupla di tipi e tali tuple, viene sollevata un'eccezione :exc:`TypeError`. :exc:`TypeError` può non essere sollevata per un tipo non valido se un controllo precedente ha successo.

source: *classinfo* can be a :ref:`types-union`.
it_it: *classinfo* può essere una :ref:`types-union`.

source: Return ``True`` if *class* is a subclass (direct, indirect, or :term:`virtual <abstract base class>`) of *classinfo*. A class is considered a subclass of itself. *classinfo* may be a tuple of class objects (or recursively, other such tuples) or a :ref:`types-union`, in which case return ``True`` if *class* is a subclass of any entry in *classinfo*. In any other case, a :exc:`TypeError` exception is raised.
it_it: Restituisce ``True`` se *class* è una sottoclasse (diretta, indiretta o :term:`virtual <abstract base class>`) di *classinfo*. Una classe è considerata una sottoclasse di se stessa. *classinfo* può essere una tupla di oggetti di classe (o ricorsivamente, altre tuple di questo tipo) o una :ref:`types-union`, nel qual caso restituisce ``True`` se *class* è una sottoclasse di uno qualsiasi degli elementi in *classinfo*. In ogni altro caso, viene sollevata un'eccezione :exc:`TypeError`.

source: Return an :term:`iterator` object. The first argument is interpreted very differently depending on the presence of the second argument. Without a second argument, *object* must be a collection object which supports the :term:`iterable` protocol (the :meth:`~object.__iter__` method), or it must support the sequence protocol (the :meth:`~object.__getitem__` method with integer arguments starting at ``0``). If it does not support either of those protocols, :exc:`TypeError` is raised. If the second argument, *sentinel*, is given, then *object* must be a callable object. The iterator created in this case will call *object* with no arguments for each call to its :meth:`~iterator.__next__` method; if the value returned is equal to *sentinel*, :exc:`StopIteration` will be raised, otherwise the value will be returned.
it_it: Restituisce un oggetto :term:`iterator`. Il primo argomento è interpretato in modo molto diverso a seconda della presenza del secondo argomento. Senza un secondo argomento, *object* deve essere un oggetto di raccolta che supporta il protocollo :term:`iterable` (il metodo :meth:`~object.__iter__`), oppure deve supportare il protocollo della sequenza (il metodo :meth:`~object.__getitem__` con argomenti interi a partire da ``0``). Se non supporta nessuno di questi protocolli, viene sollevata un'eccezione :exc:`TypeError`. Se il secondo argomento, *sentinel*, è dato, allora *object* deve essere un oggetto callable. L'iteratore creato in questo caso chiamerà *object* senza argomenti per ogni chiamata al suo metodo :meth:`~iterator.__next__`; se il valore restituito è uguale a *sentinel*, viene sollevata un'eccezione :exc:`StopIteration`, altrimenti il valore verrà restituito.
