Repository: Addivsyou/python-docs-it
Catalog: library/functions.po
Languages: it_it

source: If the argument is a string, it must contain either a real part (in the same format as for :func:`float`) or an imaginary part (in the same format but with a ``'j'`` or ``'J'`` suffix), or both real and imaginary parts (the sign of the imaginary part is mandatory in this case). The string can optionally be surrounded by whitespaces and the round parentheses ``'('`` and ``')'``, which are ignored. The string must not contain whitespace between ``'+'``, ``'-'``, the ``'j'`` or ``'J'`` suffix, and the decimal number. For example, ``complex('1+2j')`` is fine, but ``complex('1 + 2j')`` raises :exc:`ValueError`. More precisely, the input must conform to the :token:`~float:complexvalue` production rule in the following grammar, after parentheses and leading and trailing whitespace characters are removed:
it_it: Se l'argomento è una stringa, deve contenere o una parte reale (nello stesso formato della funzione :func:`float`) o una parte immaginaria (nello stesso formato ma con un suffisso ``'j'`` o ``'J'``), o entrambe le parti reali e immaginarie (il segno della parte immaginaria è obbligatorio in questo caso). La stringa può facoltativamente essere circondata da spazi bianchi e dalle parentesi tonde ``'('`` e ``')'``, che vengono ignorate. La stringa non deve contenere spazi bianchi tra ``'+'``, ``'-'``, il suffisso ``'j'`` o ``'J'`` e il numero decimale. Ad esempio, ``complex('1+2j')`` va bene, ma ``complex('1 + 2j')`` solleva un'eccezione :exc:`ValueError`. Più precisamente, l'input deve conformarsi alla regola di produzione :token:`~float:complexvalue` nella seguente grammatica, dopo che sono stati rimossi le parentesi e i caratteri di spazio all'inizio e alla fine:

source: If the argument is a number, the constructor serves as a numeric conversion like :class:`int` and :class:`float`. For a general Python object ``x``, ``complex(x)`` delegates to ``x.__complex__()``. If :meth:`~object.__complex__` is not defined then it falls back to :meth:`~object.__float__`. If :meth:`!__float__` is not defined then it falls back to :meth:`~object.__index__`.
it_it: Se l'argomento è un numero, il costruttore funziona come una conversione numerica come per :class:`int` e :class:`float`. Per un oggetto Python generico ``x``, ``complex(x)`` delega a ``x.__complex__()``. Se :meth:`~object.__complex__` non è definito, ricade su :meth:`~object.__float__`. Se :meth:`!__float__` non è definito, ricade su :meth:`~object.__index__`.

source: If two arguments are provided or keyword arguments are used, each argument may be any numeric type (including complex). If both arguments are real numbers, return a complex number with the real component *real* and the imaginary component *imag*. If both arguments are complex numbers, return a complex number with the real component ``real.real-imag.imag`` and the imaginary component ``real.imag+imag.real``. If one of arguments is a real number, only its real component is used in the above expressions.
it_it: Se vengono forniti due argomenti o si utilizzano argomenti chiave, ogni argomento può essere di qualsiasi tipo numerico (incluso complesso). Se entrambi gli argomenti sono numeri reali, restituisce un numero complesso con la componente reale *real* e la componente immaginaria *imag*. Se entrambi gli argomenti sono numeri complessi, restituire un numero complesso con la componente reale ``real.real - imag.imag`` e la componente immaginaria ``real.imag + imag.real``. Se uno degli argomenti è un numero reale, viene utilizzata solo la sua componente reale nelle espressioni sopra.

source: If all arguments are omitted, returns ``0j``.
it_it: Se tutti gli argomenti sono omessi, restituisce ``0j``.

source: The complex type is described in :ref:`typesnumeric`.
it_it: Il tipo complesso è descritto in :ref:`typesnumeric`.

source: Grouping digits with underscores as in code literals is allowed.
it_it: È consentito raggruppare le cifre con trattini bassi come nei letterali di codice.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__complex__` and :meth:`~object.__float__` are not defined.
it_it: Ricade su :meth:`~object.__index__` se :meth:`~object.__complex__` e :meth:`~object.__float__` non sono definiti.

source: This is a relative of :func:`setattr`. The arguments are an object and a string. The string must be the name of one of the object's attributes. The function deletes the named attribute, provided the object allows it. For example, ``delattr(x, 'foobar')`` is equivalent to ``del x.foobar``. *name* need not be a Python identifier (see :func:`setattr`).
it_it: Questo è un parente di :func:`setattr`. Gli argomenti sono un oggetto e una stringa. La stringa deve essere il nome di uno degli attributi dell'oggetto. La funzione elimina l'attributo denominato, a condizione che l'oggetto lo permetta. Ad esempio, ``delattr(x, 'foobar')`` è equivalente a ``del x.foobar``. *name* non deve necessariamente essere un identificatore Python (vedi :func:`setattr`).

source: Create a new dictionary. The :class:`dict` object is the dictionary class. See :class:`dict` and :ref:`typesmapping` for documentation about this class.
it_it: Crea un nuovo dizionario. L'oggetto :class:`dict` è la classe del dizionario. Vedi :class:`dict` e :ref:`typesmapping` per la documentazione su questa classe.

source: For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, as well as the :mod:`collections` module.
it_it: Per altri contenitori vedere le classi integrate :class:`list`, :class:`set` e :class:`tuple`, così come il modulo :mod:`collections`.

source: Without arguments, return the list of names in the current local scope. With an argument, attempt to return a list of valid attributes for that object.
it_it: Senza argomenti, restituisce l'elenco dei nomi nell'attuale ambito locale. Con un argomento, tenta di restituire un elenco di attributi validi per quell'oggetto.

source: If the object has a method named :meth:`~object.__dir__`, this method will be called and must return the list of attributes. This allows objects that implement a custom :func:`~object.__getattr__` or :func:`~object.__getattribute__` function to customize the way :func:`dir` reports their attributes.
it_it: Se l'oggetto ha un metodo chiamato :meth:`~object.__dir__`, verrà chiamato e deve restituire l'elenco degli attributi. Questo consente agli oggetti che implementano una funzione personalizzata :func:`~object.__getattr__` o :func:`~object.__getattribute__` di personalizzare il modo in cui :func:`dir` riporta i loro attributi.

source: If the object does not provide :meth:`~object.__dir__`, the function tries its best to gather information from the object's :attr:`~object.__dict__` attribute, if defined, and from its type object. The resulting list is not necessarily complete and may be inaccurate when the object has a custom :func:`~object.__getattr__`.
it_it: Se l'oggetto non fornisce :meth:`~object.__dir__`, la funzione fa del suo meglio per raccogliere informazioni dall'attributo :attr:`~object.__dict__` dell'oggetto, se definito, e dal suo tipo di oggetto. L'elenco risultante non è necessariamente completo e può essere inaccurato se l'oggetto ha una funzione personalizzata :func:`~object.__getattr__`.

source: The default :func:`dir` mechanism behaves differently with different types of objects, as it attempts to produce the most relevant, rather than complete, information:
it_it: Il meccanismo predefinito di :func:`dir` si comporta diversamente con diversi tipi di oggetti, poiché tenta di produrre le informazioni più rilevanti, piuttosto che complete:

source: If the object is a module object, the list contains the names of the module's attributes.
it_it: Se l'oggetto è un oggetto modulo, l'elenco contiene i nomi degli attributi del modulo.

source: If the object is a type or class object, the list contains the names of its attributes, and recursively of the attributes of its bases.
it_it: Se l'oggetto è un oggetto di tipo o classe, l'elenco contiene i nomi dei suoi attributi e, ricorsivamente, degli attributi delle sue basi.

source: Otherwise, the list contains the object's attributes' names, the names of its class's attributes, and recursively of the attributes of its class's base classes.
it_it: Altrimenti, l'elenco contiene i nomi degli attributi dell'oggetto, i nomi degli attributi della sua classe e, ricorsivamente, degli attributi delle sue classi base.

source: The resulting list is sorted alphabetically. For example:
it_it: L'elenco risultante è ordinato alfabeticamente. Ad esempio:

source: Because :func:`dir` is supplied primarily as a convenience for use at an interactive prompt, it tries to supply an interesting set of names more than it tries to supply a rigorously or consistently defined set of names, and its detailed behavior may change across releases. For example, metaclass attributes are not in the result list when the argument is a class.
it_it: Poiché :func:`dir` è fornito principalmente come praticità per l'uso in un prompt interattivo, tenta di fornire un insieme di nomi interessante piuttosto che un insieme definito rigorosamente o coerentemente, e il suo comportamento dettagliato può cambiare tra le versioni. Ad esempio, gli attributi delle metaclassi non sono nella lista dei risultati quando l'argomento è una classe.

source: Take two (non-complex) numbers as arguments and return a pair of numbers consisting of their quotient and remainder when using integer division. With mixed operand types, the rules for binary arithmetic operators apply. For integers, the result is the same as ``(a // b, a % b)``. For floating point numbers the result is ``(q, a % b)``, where *q* is usually ``math.floor(a / b)`` but may be 1 less than that. In any case ``q * b + a % b`` is very close to *a*, if ``a % b`` is non-zero it has the same sign as *b*, and ``0 <= abs(a % b) < abs(b)``.
it_it: Prende due numeri (non complessi) come argomenti e restituisce una coppia di numeri costituita dal loro quoziente e resto quando si usa la divisione intera. Con tipi di operandi misti, si applicano le regole per gli operatori aritmetici binari. Per gli interi, il risultato è lo stesso di ``(a // b, a % b)``. Per i numeri in virgola mobile il risultato è ``(q, a % b)``, dove *q* è solitamente ``math.floor(a / b)`` ma può essere 1 in meno di quello. In ogni caso ``q * b + a % b`` è molto vicino a *a*, se ``a % b`` è diverso da zero ha lo stesso segno di *b*, e ``0 <= abs(a % b) < abs(b)``.

source: Return an enumerate object. *iterable* must be a sequence, an :term:`iterator`, or some other object which supports iteration. The :meth:`~iterator.__next__` method of the iterator returned by :func:`enumerate` returns a tuple containing a count (from *start* which defaults to 0) and the values obtained from iterating over *iterable*.
it_it: Restituisce un oggetto enumerate. *iterable* deve essere una sequenza, un :term:`iterator` o qualche altro oggetto che supporti l'iterazione. Il metodo :meth:`~iterator.__next__` dell'iteratore restituito da :func:`enumerate` restituisce una tupla contenente un conteggio (da *start* che per impostazione predefinita è 0) e i valori ottenuti iterando su *iterable*.

source: Equivalent to::
it_it: Equivalente a::

source: Parameters
it_it: Parametri

source: A Python expression.
it_it: Un'espressione Python.

source: The global namespace (default: ``None``).
it_it: Lo spazio dei nomi globale (predefinito: ``None``).

source: The local namespace (default: ``None``).
it_it: Lo spazio dei nomi locale (predefinito: ``None``).

source: Returns
it_it: Restituisce

source: The result of the evaluated expression.
it_it: Il risultato dell'espressione valutata.

source: raises
it_it: solleva

source: Syntax errors are reported as exceptions.
it_it: Gli errori di sintassi sono segnalati come eccezioni.

source: The *expression* argument is parsed and evaluated as a Python expression (technically speaking, a condition list) using the *globals* and *locals* dictionaries as global and local namespace. If the *globals* dictionary is present and does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key before *expression* is parsed. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`eval`. If the *locals* dictionary is omitted it defaults to the *globals* dictionary. If both dictionaries are omitted, the expression is executed with the *globals* and *locals* in the environment where :func:`eval` is called. Note, *eval()* does not have access to the :term:`nested scopes <nested scope>` (non-locals) in the enclosing environment.
it_it: L'argomento *expression* viene interpretato e valutato come un'espressione Python (tecnicamente parlando, una lista di condizioni) utilizzando i dizionari *globals* e *locals* come namespace globale e locale. Se il dizionario *globals* è presente e non contiene un valore per la chiave ``__builtins__``, viene inserito un riferimento al dizionario del modulo built-in :mod:`builtins` sotto quella chiave prima di interpretare l'espressione *expression*. In questo modo puoi controllare quali built-in sono disponibili nel codice eseguito inserendo il tuo dizionario ``__builtins__`` in *globals* prima di passarlo a :func:`eval`. Se il dizionario *locals* è omesso, si predefinisce al dizionario *globals*. Se entrambi i dizionari sono omessi, l'espressione viene eseguita con i *globals* e *locals* nell'ambiente in cui viene chiamata :func:`eval`. Nota, *eval()* non ha accesso agli :term:`scopi annidati <nested scope>` (non-locals) nell'ambiente circostante.

source: Example:
it_it: Esempio:

source: This function can also be used to execute arbitrary code objects (such as those created by :func:`compile`). In this case, pass a code object instead of a string. If the code object has been compiled with ``'exec'`` as the *mode* argument, :func:`eval`\'s return value will be ``None``.
it_it: Questa funzione può essere utilizzata anche per eseguire oggetti codice arbitrari (come quelli creati da :func:`compile`). In questo caso, passa un oggetto codice invece di una stringa. Se l'oggetto codice è stato compilato con ``'exec'`` come argomento *mode*, il valore restituito da :func:`eval` sarà ``None``.

source: Hints: dynamic execution of statements is supported by the :func:`exec` function. The :func:`globals` and :func:`locals` functions return the current global and local dictionary, respectively, which may be useful to pass around for use by :func:`eval` or :func:`exec`.
it_it: Suggerimenti: l'esecuzione dinamica delle istruzioni è supportata dalla funzione :func:`exec`. Le funzioni :func:`globals` e :func:`locals` restituiscono rispettivamente il dizionario globale e locale corrente, che possono essere utili da passare per l'uso da parte di :func:`eval` o :func:`exec`.

source: If the given source is a string, then leading and trailing spaces and tabs are stripped.
it_it: Se la sorgente data è una stringa, allora gli spazi e le tabulazioni iniziali e finali vengono rimossi.

source: See :func:`ast.literal_eval` for a function that can safely evaluate strings with expressions containing only literals.
it_it: Vedi :func:`ast.literal_eval` per una funzione che può valutare in sicurezza stringhe con espressioni contenenti solo letterali.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with argument ``code_object``.
it_it: Solleva un :ref:`evento di auditing <auditing>` ``exec`` con argomento ``code_object``.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with the code object as the argument. Code compilation events may also be raised.
it_it: Solleva un :ref:`evento di auditing <auditing>` ``exec`` con l'oggetto codice come argomento. Possono anche essere sollevati eventi di compilazione del codice.

source: This function supports dynamic execution of Python code. *object* must be either a string or a code object. If it is a string, the string is parsed as a suite of Python statements which is then executed (unless a syntax error occurs). [#]_ If it is a code object, it is simply executed. In all cases, the code that's executed is expected to be valid as file input (see the section :ref:`file-input` in the Reference Manual). Be aware that the :keyword:`nonlocal`, :keyword:`yield`, and :keyword:`return` statements may not be used outside of function definitions even within the context of code passed to the :func:`exec` function. The return value is ``None``.
it_it: Questa funzione supporta l'esecuzione dinamica di codice Python. *object* deve essere una stringa o un oggetto codice. Se è una stringa, la stringa viene interpretata come una suite di dichiarazioni Python che vengono poi eseguite (a meno che non si verifichi un errore di sintassi). [#]_ Se è un oggetto codice, viene semplicemente eseguito. In tutti i casi, il codice che viene eseguito deve essere valido come input di file (vedere la sezione :ref:`file-input` nel Manuale di Riferimento). Tieni presente che le dichiarazioni :keyword:`nonlocal`, :keyword:`yield` e :keyword:`return` non possono essere utilizzate al di fuori delle definizioni di funzione, anche nel contesto del codice passato alla funzione :func:`exec`. Il valore di ritorno è ``None``.

source: In all cases, if the optional parts are omitted, the code is executed in the current scope. If only *globals* is provided, it must be a dictionary (and not a subclass of dictionary), which will be used for both the global and the local variables. If *globals* and *locals* are given, they are used for the global and local variables, respectively. If provided, *locals* can be any mapping object. Remember that at the module level, globals and locals are the same dictionary.
it_it: In ogni caso, se vengono omesse le parti opzionali, il codice viene eseguito nell'ambito corrente. Se viene fornito solo *globals*, deve essere un dizionario (e non una sottoclasse del dizionario), che verrà utilizzato sia per le variabili globali che per quelle locali. Se vengono forniti *globals* e *locals*, vengono utilizzati rispettivamente per le variabili globali e locali. Se fornito, *locals* può essere qualsiasi oggetto di mappatura. Ricorda che a livello di modulo, globals e locals sono lo stesso dizionario.

source: Most users should just pass a *globals* argument and never *locals*. If exec gets two separate objects as *globals* and *locals*, the code will be executed as if it were embedded in a class definition.
it_it: La maggior parte degli utenti dovrebbe semplicemente passare un argomento *globals* e mai *locals*. Se exec riceve due oggetti separati come *globals* e *locals*, il codice verrà eseguito come se fosse incorporato in una definizione di classe.

source: If the *globals* dictionary does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`exec`.
it_it: Se il dizionario *globals* non contiene un valore per la chiave ``__builtins__``, viene inserito un riferimento al dizionario del modulo integrato :mod:`builtins` sotto quella chiave. In questo modo puoi controllare quali builtins sono disponibili per il codice eseguito inserendo il tuo dizionario ``__builtins__`` in *globals* prima di passarlo a :func:`exec`.

source: The *closure* argument specifies a closure--a tuple of cellvars. It's only valid when the *object* is a code object containing free variables. The length of the tuple must exactly match the number of free variables referenced by the code object.
it_it: L'argomento *closure* specifica una chiusura--una tupla di cellvars. È valido solo quando l'*oggetto* è un oggetto codice contenente variabili libere. La lunghezza della tupla deve esattamente corrispondere al numero di variabili libere referenziate dall'oggetto codice.

source: The built-in functions :func:`globals` and :func:`locals` return the current global and local dictionary, respectively, which may be useful to pass around for use as the second and third argument to :func:`exec`.
it_it: Le funzioni built-in :func:`globals` e :func:`locals` restituiscono il dizionario globale e locale corrente, rispettivamente, il che può risultare utile da passare come secondo e terzo argomento a :func:`exec`.

source: The default *locals* act as described for function :func:`locals` below: modifications to the default *locals* dictionary should not be attempted. Pass an explicit *locals* dictionary if you need to see effects of the code on *locals* after function :func:`exec` returns.
it_it: I *locals* predefiniti agiscono come descritto per la funzione :func:`locals` qui sotto: non dovrebbero essere tentate modifiche al dizionario *locals* predefinito. Passa un dizionario *locals* esplicito se hai bisogno di vedere gli effetti del codice sui *locals* dopo che la funzione :func:`exec` ha restituito.

source: Added the *closure* parameter.
it_it: Aggiunto il parametro *closure*.

source: Construct an iterator from those elements of *iterable* for which *function* is true. *iterable* may be either a sequence, a container which supports iteration, or an iterator. If *function* is ``None``, the identity function is assumed, that is, all elements of *iterable* that are false are removed.
it_it: Costruisce un iteratore dagli elementi di *iterable* per i quali *function* è vera. *iterable* può essere una sequenza, un contenitore che supporta l'iterazione, o un iteratore. Se *function* è ``None``, si assume la funzione identità, ovvero, tutti gli elementi di *iterable* che sono falsi vengono rimossi.

source: Note that ``filter(function, iterable)`` is equivalent to the generator expression ``(item for item in iterable if function(item))`` if function is not ``None`` and ``(item for item in iterable if item)`` if function is ``None``.
it_it: Nota che ``filter(function, iterable)`` è equivalente all'espressione generatrice ``(item for item in iterable if function(item))`` se function non è ``None`` e ``(item for item in iterable if item)`` se function è ``None``.

source: See :func:`itertools.filterfalse` for the complementary function that returns elements of *iterable* for which *function* is false.
it_it: Vedi :func:`itertools.filterfalse` per la funzione complementare che restituisce elementi di *iterable* per i quali *function* è falsa.

source: Return a floating point number constructed from a number or a string.
it_it: Restituisce un numero in virgola mobile costruito da un numero o una stringa.
