Repository: Addivsyou/python-docs-it
Catalog: library/functions.po
Languages: it_it

source: The following example uses the :ref:`dir_fd <dir_fd>` parameter of the :func:`os.open` function to open a file relative to a given directory::
it_it: Il seguente esempio utilizza il parametro :ref:`dir_fd <dir_fd>` della funzione :func:`os.open` per aprire un file rispetto a una determinata directory::

source: The type of :term:`file object` returned by the :func:`open` function depends on the mode. When :func:`open` is used to open a file in a text mode (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, etc.), it returns a subclass of :class:`io.TextIOBase` (specifically :class:`io.TextIOWrapper`). When used to open a file in a binary mode with buffering, the returned class is a subclass of :class:`io.BufferedIOBase`. The exact class varies: in read binary mode, it returns an :class:`io.BufferedReader`; in write binary and append binary modes, it returns an :class:`io.BufferedWriter`, and in read/write mode, it returns an :class:`io.BufferedRandom`. When buffering is disabled, the raw stream, a subclass of :class:`io.RawIOBase`, :class:`io.FileIO`, is returned.
it_it: Il tipo di :term:`file object` restituito dalla funzione :func:`open` dipende dalla modalità. Quando :func:`open` è usato per aprire un file in modalità testo (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, ecc.), restituisce una sottoclasse di :class:`io.TextIOBase` (specificamente :class:`io.TextIOWrapper`). Quando è usato per aprire un file in modalità binaria con buffering, la classe restituita è una sottoclasse di :class:`io.BufferedIOBase`. La classe esatta varia: in modalità di lettura binaria, restituisce un :class:`io.BufferedReader`; in modalità di scrittura binaria e di aggiunta binaria, restituisce un :class:`io.BufferedWriter`, e in modalità di lettura/scrittura, restituisce un :class:`io.BufferedRandom`. Quando il buffering è disabilitato, viene restituito il flusso raw, una sottoclasse di :class:`io.RawIOBase`, :class:`io.FileIO`.

source: See also the file handling modules, such as :mod:`fileinput`, :mod:`io` (where :func:`open` is declared), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, and :mod:`shutil`.
it_it: Vedi anche i moduli di gestione dei file, come :mod:`fileinput`, :mod:`io` (dove è dichiarato :func:`open`), :mod:`os`, :mod:`os.path`, :mod:`tempfile` e :mod:`shutil`.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``file``, ``mode``, ``flags``.
it_it: Solleva un :ref:`auditing event <auditing>` ``open`` con argomenti ``file``, ``mode``, ``flags``.

source: The ``mode`` and ``flags`` arguments may have been modified or inferred from the original call.
it_it: Gli argomenti ``mode`` e ``flags`` potrebbero essere stati modificati o dedotti dalla chiamata originale.

source: The *opener* parameter was added.
it_it: È stato aggiunto il parametro *opener*.

source: The ``'x'`` mode was added.
it_it: È stato aggiunto il modo ``'x'``.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
it_it: :exc:`IOError` veniva sollevato in passato, ora è un alias di :exc:`OSError`.

source: :exc:`FileExistsError` is now raised if the file opened in exclusive creation mode (``'x'``) already exists.
it_it: :exc:`FileExistsError` viene ora sollevato se il file aperto in modalità di creazione esclusiva (``'x'``) esiste già.

source: The file is now non-inheritable.
it_it: Il file ora è non ereditabile.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
it_it: Se la chiamata di sistema viene interrotta e il gestore dei segnali non solleva un'eccezione, la funzione ora riprova la chiamata di sistema anziché sollevare un'eccezione :exc:`InterruptedError` (vedi :pep:`475` per la motivazione).

source: The ``'namereplace'`` error handler was added.
it_it: È stato aggiunto il gestore di errori ``'namereplace'``.

source: Support added to accept objects implementing :class:`os.PathLike`.
it_it: È stato aggiunto il supporto per accettare oggetti che implementano :class:`os.PathLike`.

source: On Windows, opening a console buffer may return a subclass of :class:`io.RawIOBase` other than :class:`io.FileIO`.
it_it: Su Windows, l'apertura di un buffer di console può restituire una sottoclasse di :class:`io.RawIOBase` diversa da :class:`io.FileIO`.

source: The ``'U'`` mode has been removed.
it_it: È stato rimosso il modo ``'U'``.

source: Given a string representing one Unicode character, return an integer representing the Unicode code point of that character. For example, ``ord('a')`` returns the integer ``97`` and ``ord('€')`` (Euro sign) returns ``8364``. This is the inverse of :func:`chr`.
it_it: Data una stringa che rappresenta un carattere Unicode, restituisce un intero che rappresenta il punto di codice Unicode di quel carattere. Ad esempio, ``ord('a')`` restituisce l'intero ``97`` e ``ord('€')`` (segno dell'Euro) restituisce ``8364``. Questo è l'inverso di :func:`chr`.

source: Return *base* to the power *exp*; if *mod* is present, return *base* to the power *exp*, modulo *mod* (computed more efficiently than ``pow(base, exp) % mod``). The two-argument form ``pow(base, exp)`` is equivalent to using the power operator: ``base**exp``.
it_it: Restituisce *base* elevato a *exp*; se *mod* è presente, restituisce *base* elevato a *exp*, modulo *mod* (calcolato più efficientemente di ``pow(base, exp) % mod``). La forma a due argomenti ``pow(base, exp)`` è equivalente all'utilizzo dell'operatore di potenza: ``base**exp``.

source: The arguments must have numeric types. With mixed operand types, the coercion rules for binary arithmetic operators apply. For :class:`int` operands, the result has the same type as the operands (after coercion) unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``pow(10, 2)`` returns ``100``, but ``pow(10, -2)`` returns ``0.01``. For a negative base of type :class:`int` or :class:`float` and a non-integral exponent, a complex result is delivered. For example, ``pow(-9, 0.5)`` returns a value close to ``3j``.
it_it: Gli argomenti devono essere di tipo numerico. Con tipi di operandi misti, si applicano le regole di coercizione per gli operatori aritmetici binari. Per gli operandi :class:`int`, il risultato ha lo stesso tipo degli operandi (dopo la coercizione) a meno che il secondo argomento non sia negativo; in tal caso, tutti gli argomenti sono convertiti in float e viene restituito un risultato float. Ad esempio, ``pow(10, 2)`` restituisce ``100``, ma ``pow(10, -2)`` restituisce ``0.01``. Per una base negativa di tipo :class:`int` o :class:`float` e un esponente non intero, viene restituito un risultato complesso. Ad esempio, ``pow(-9, 0.5)`` restituisce un valore vicino a ``3j``.

source: For :class:`int` operands *base* and *exp*, if *mod* is present, *mod* must also be of integer type and *mod* must be nonzero. If *mod* is present and *exp* is negative, *base* must be relatively prime to *mod*. In that case, ``pow(inv_base, -exp, mod)`` is returned, where *inv_base* is an inverse to *base* modulo *mod*.
it_it: Per gli operandi :class:`int` *base* e *exp*, se *mod* è presente, *mod* deve essere anche di tipo intero e *mod* deve essere diverso da zero. Se *mod* è presente e *exp* è negativo, *base* deve essere relativamente primo a *mod*. In tal caso, viene restituito ``pow(inv_base, -exp, mod)``, dove *inv_base* è un inverso di *base* modulo *mod*.

source: Here's an example of computing an inverse for ``38`` modulo ``97``::
it_it: Ecco un esempio di calcolo di un inverso per ``38`` modulo ``97``::

source: For :class:`int` operands, the three-argument form of ``pow`` now allows the second argument to be negative, permitting computation of modular inverses.
it_it: Per gli operandi :class:`int`, la forma a tre argomenti di ``pow`` ora consente che il secondo argomento sia negativo, permettendo il calcolo degli inversi modulari.

source: Allow keyword arguments. Formerly, only positional arguments were supported.
it_it: Consente argomenti di parola chiave. In passato, erano supportati solo argomenti posizionali.

source: Print *objects* to the text stream *file*, separated by *sep* and followed by *end*. *sep*, *end*, *file*, and *flush*, if present, must be given as keyword arguments.
it_it: Stampa *objects* sul flusso di testo *file*, separati da *sep* e seguiti da *end*. *sep*, *end*, *file* e *flush*, se presenti, devono essere dati come argomenti di parola chiave.

source: All non-keyword arguments are converted to strings like :func:`str` does and written to the stream, separated by *sep* and followed by *end*. Both *sep* and *end* must be strings; they can also be ``None``, which means to use the default values. If no *objects* are given, :func:`print` will just write *end*.
it_it: Tutti gli argomenti non di parola chiave sono convertiti in stringhe come fa :func:`str` e scritti nel flusso, separati da *sep* e seguiti da *end*. Sia *sep* che *end* devono essere stringhe; possono anche essere ``None``, il che significa usare i valori predefiniti. Se non vengono dati *objects*, :func:`print` scriverà solo *end*.

source: The *file* argument must be an object with a ``write(string)`` method; if it is not present or ``None``, :data:`sys.stdout` will be used. Since printed arguments are converted to text strings, :func:`print` cannot be used with binary mode file objects. For these, use ``file.write(...)`` instead.
it_it: L'argomento *file* deve essere un oggetto con un metodo ``write(string)``; se non è presente o è ``None``, verrà utilizzato :data:`sys.stdout`. Poiché gli argomenti stampati sono convertiti in stringhe di testo, :func:`print` non può essere utilizzato con oggetti file in modalità binaria. Per questi, utilizzare ``file.write(...)`` invece.

source: Output buffering is usually determined by *file*. However, if *flush* is true, the stream is forcibly flushed.
it_it: Il buffering dell'output è di solito determinato da *file*. Tuttavia, se *flush* è vero, il flusso viene forzato a essere svuotato.

source: Added the *flush* keyword argument.
it_it: Aggiunto il parametro di parola chiave *flush*.

source: Return a property attribute.
it_it: Restituisce un attributo di proprietà.

source: *fget* is a function for getting an attribute value. *fset* is a function for setting an attribute value. *fdel* is a function for deleting an attribute value. And *doc* creates a docstring for the attribute.
it_it: *fget* è una funzione per ottenere il valore di un attributo. *fset* è una funzione per impostare il valore di un attributo. *fdel* è una funzione per eliminare il valore di un attributo. E *doc* crea una docstring per l'attributo.

source: A typical use is to define a managed attribute ``x``::
it_it: Un uso tipico è definire un attributo gestito ``x``::

source: If *c* is an instance of *C*, ``c.x`` will invoke the getter, ``c.x = value`` will invoke the setter, and ``del c.x`` the deleter.
it_it: Se *c* è un'istanza di *C*, ``c.x`` invocherà il getter, ``c.x = valore`` invocherà il setter, e ``del c.x`` il deleter.

source: If given, *doc* will be the docstring of the property attribute. Otherwise, the property will copy *fget*'s docstring (if it exists). This makes it possible to create read-only properties easily using :func:`property` as a :term:`decorator`::
it_it: Se fornito, *doc* sarà la docstring dell'attributo property. Altrimenti, la property copierà la docstring di *fget* (se esiste). Questo rende possibile creare facilmente proprietà di sola lettura usando :func:`property` come un :term:`decorator`::

source: The ``@property`` decorator turns the :meth:`!voltage` method into a "getter" for a read-only attribute with the same name, and it sets the docstring for *voltage* to "Get the current voltage."
it_it: Il decoratore ``@property`` trasforma il metodo :meth:`!voltage` in un "getter" per un attributo di sola lettura con lo stesso nome, e imposta la docstring di *voltage* a "Get the current voltage."

source: A property object has ``getter``, ``setter``, and ``deleter`` methods usable as decorators that create a copy of the property with the corresponding accessor function set to the decorated function. This is best explained with an example:
it_it: Un oggetto property ha metodi ``getter``, ``setter``, e ``deleter`` utilizzabili come decoratori che creano una copia della property con la funzione di accesso corrispondente impostata sulla funzione decorata. Questo è spiegato al meglio con un esempio:

source: This code is exactly equivalent to the first example. Be sure to give the additional functions the same name as the original property (``x`` in this case.)
it_it: Questo codice è esattamente equivalente al primo esempio. Assicurati di dare alle funzioni aggiuntive lo stesso nome della proprietà originale (``x`` in questo caso.)

source: The returned property object also has the attributes ``fget``, ``fset``, and ``fdel`` corresponding to the constructor arguments.
it_it: L'oggetto property restituito ha anche gli attributi ``fget``, ``fset``, e ``fdel`` corrispondenti agli argomenti del costruttore.

source: The docstrings of property objects are now writeable.
it_it: Le docstring degli oggetti property ora sono scrivibili.

source: Rather than being a function, :class:`range` is actually an immutable sequence type, as documented in :ref:`typesseq-range` and :ref:`typesseq`.
it_it: Piuttosto che essere una funzione, :class:`range` è in realtà un tipo di sequenza immutabile, come documentato in :ref:`typesseq-range` e :ref:`typesseq`.

source: Return a string containing a printable representation of an object. For many types, this function makes an attempt to return a string that would yield an object with the same value when passed to :func:`eval`; otherwise, the representation is a string enclosed in angle brackets that contains the name of the type of the object together with additional information often including the name and address of the object. A class can control what this function returns for its instances by defining a :meth:`~object.__repr__` method. If :func:`sys.displayhook` is not accessible, this function will raise :exc:`RuntimeError`.
it_it: Restituisce una stringa contenente una rappresentazione stampabile di un oggetto. Per molti tipi, questa funzione tenta di restituire una stringa che produrrebbe un oggetto con lo stesso valore quando passato a :func:`eval`; altrimenti, la rappresentazione è una stringa racchiusa tra parentesi angolari che contiene il nome del tipo dell'oggetto insieme a informazioni aggiuntive, spesso includendo il nome e l'indirizzo dell'oggetto. Una classe può controllare ciò che questa funzione restituisce per le sue istanze definendo un metodo :meth:`~object.__repr__`. Se :func:`sys.displayhook` non è accessibile, questa funzione genererà :exc:`RuntimeError`.

source: This class has a custom representation that can be evaluated::
it_it: Questa classe ha una rappresentazione personalizzata che può essere valutata::

source: Return a reverse :term:`iterator`. *seq* must be an object which has a :meth:`~object.__reversed__` method or supports the sequence protocol (the :meth:`~object.__len__` method and the :meth:`~object.__getitem__` method with integer arguments starting at ``0``).
it_it: Restituisce un :term:`iterator` invertito. *seq* deve essere un oggetto che ha un metodo :meth:`~object.__reversed__` o supporta il protocollo delle sequenze (il metodo :meth:`~object.__len__` e il metodo :meth:`~object.__getitem__` con argomenti interi a partire da ``0``).

source: Return *number* rounded to *ndigits* precision after the decimal point. If *ndigits* is omitted or is ``None``, it returns the nearest integer to its input.
it_it: Restituisce *number* arrotondato a *ndigits* precisione dopo il punto decimale. Se *ndigits* è omesso o è ``None``, restituisce l'intero più vicino al valore di input.

source: For the built-in types supporting :func:`round`, values are rounded to the closest multiple of 10 to the power minus *ndigits*; if two multiples are equally close, rounding is done toward the even choice (so, for example, both ``round(0.5)`` and ``round(-0.5)`` are ``0``, and ``round(1.5)`` is ``2``). Any integer value is valid for *ndigits* (positive, zero, or negative). The return value is an integer if *ndigits* is omitted or ``None``. Otherwise, the return value has the same type as *number*.
it_it: Per i tipi built-in che supportano :func:`round`, i valori sono arrotondati al multiplo più vicino di 10 elevato alla potenza con segno meno *ndigits*; se due multipli sono ugualmente vicini, l'arrotondamento è fatto verso la scelta pari (così, per esempio, sia ``round(0.5)`` che ``round(-0.5)`` sono ``0``, e ``round(1.5)`` è ``2``). Qualsiasi valore intero è valido per *ndigits* (positivo, zero o negativo). Il valore restituito è un intero se *ndigits* è omesso o è ``None``. Altrimenti, il valore restituito ha lo stesso tipo di *number*.

source: For a general Python object ``number``, ``round`` delegates to ``number.__round__``.
it_it: Per un oggetto Python generico ``number``, ``round`` delega a ``number.__round__``.

source: The behavior of :func:`round` for floats can be surprising: for example, ``round(2.675, 2)`` gives ``2.67`` instead of the expected ``2.68``. This is not a bug: it's a result of the fact that most decimal fractions can't be represented exactly as a float. See :ref:`tut-fp-issues` for more information.
it_it: Il comportamento di :func:`round` per i float può essere sorprendente: per esempio, ``round(2.675, 2)`` dà ``2.67`` invece del previsto ``2.68``. Questo non è un bug: è il risultato del fatto che la maggior parte delle frazioni decimali non può essere rappresentata esattamente come un float. Vedi :ref:`tut-fp-issues` per maggiori informazioni.

source: Return a new :class:`set` object, optionally with elements taken from *iterable*. ``set`` is a built-in class. See :class:`set` and :ref:`types-set` for documentation about this class.
it_it: Restituisce un nuovo oggetto :class:`set`, opzionalmente con elementi presi da *iterable*. ``set`` è una classe built-in. Vedi :class:`set` e :ref:`types-set` per la documentazione su questa classe.

source: For other containers see the built-in :class:`frozenset`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
it_it: Per altri contenitori vedi le classi built-in :class:`frozenset`, :class:`list`, :class:`tuple`, e :class:`dict`, così come il modulo :mod:`collections`.

source: This is the counterpart of :func:`getattr`. The arguments are an object, a string, and an arbitrary value. The string may name an existing attribute or a new attribute. The function assigns the value to the attribute, provided the object allows it. For example, ``setattr(x, 'foobar', 123)`` is equivalent to ``x.foobar = 123``.
it_it: Questo è il corrispettivo di :func:`getattr`. Gli argomenti sono un oggetto, una stringa e un valore arbitrario. La stringa può nominare un attributo esistente o un nuovo attributo. La funzione assegna il valore all'attributo, a condizione che l'oggetto lo consenta. Per esempio, ``setattr(x, 'foobar', 123)`` è equivalente a ``x.foobar = 123``.

source: *name* need not be a Python identifier as defined in :ref:`identifiers` unless the object chooses to enforce that, for example in a custom :meth:`~object.__getattribute__` or via :attr:`~object.__slots__`. An attribute whose name is not an identifier will not be accessible using the dot notation, but is accessible through :func:`getattr` etc..
it_it: *name* non deve essere necessariamente un identificatore Python come definito in :ref:`identifiers` a meno che l'oggetto non scelga di far rispettare ciò, per esempio in un metodo personalizzato :meth:`~object.__getattribute__` o tramite :attr:`~object.__slots__`. Un attributo il cui nome non è un identificatore non sarà accessibile usando la notazione a punto, ma è accessibile tramite :func:`getattr` ecc.

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to set it with :func:`setattr`.
it_it: Poiché :ref:`nome privato confuso <private-name-mangling>` avviene al momento della compilazione, bisogna manualmente confondere il nome di un attributo privato (attributi con due trattini bassi all'inizio) per impostarlo con :func:`setattr`.

source: Return a :term:`slice` object representing the set of indices specified by ``range(start, stop, step)``. The *start* and *step* arguments default to ``None``.
it_it: Restituisce un oggetto :term:`slice` che rappresenta l'insieme di indici specificati da ``range(start, stop, step)``. Gli argomenti *start* e *step* predefiniti sono ``None``.

source: Slice objects have read-only data attributes :attr:`!start`, :attr:`!stop`, and :attr:`!step` which merely return the argument values (or their default). They have no other explicit functionality; however, they are used by NumPy and other third-party packages.
it_it: Gli oggetti Slice hanno attributi dati di sola lettura :attr:`!start`, :attr:`!stop`, e :attr:`!step` che restituiscono semplicemente i valori degli argomenti (o il loro valore predefinito). Non hanno altra funzionalità esplicita; tuttavia, sono usati da NumPy e da altri pacchetti di terze parti.

source: Slice objects are also generated when extended indexing syntax is used. For example: ``a[start:stop:step]`` or ``a[start:stop, i]``. See :func:`itertools.islice` for an alternate version that returns an :term:`iterator`.
it_it: Gli oggetti Slice vengono anche generati quando viene utilizzata la sintassi di indicizzazione estesa. Per esempio: ``a[start:stop:step]`` o ``a[start:stop, i]``. Vedi :func:`itertools.islice` per una versione alternativa che restituisce un :term:`iterator`.

source: Slice objects are now :term:`hashable` (provided :attr:`~slice.start`, :attr:`~slice.stop`, and :attr:`~slice.step` are hashable).
it_it: Gli oggetti Slice ora sono :term:`hashable` (fornito che :attr:`~slice.start`, :attr:`~slice.stop`, e :attr:`~slice.step` siano hashable).

source: Return a new sorted list from the items in *iterable*.
it_it: Restituisce una nuova lista ordinata dagli elementi in *iterable*.

source: Has two optional arguments which must be specified as keyword arguments.
it_it: Ha due argomenti opzionali che devono essere specificati come argomenti per parola chiave.

source: *key* specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). The default value is ``None`` (compare the elements directly).
it_it: *key* specifica una funzione di un argomento che viene utilizzata per estrarre una chiave di confronto da ciascun elemento in *iterable* (per esempio, ``key=str.lower``). Il valore predefinito è ``None`` (confronta gli elementi direttamente).

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
it_it: *reverse* è un valore booleano. Se impostato su ``True``, gli elementi della lista vengono ordinati come se ogni confronto fosse inverso.

source: Use :func:`functools.cmp_to_key` to convert an old-style *cmp* function to a *key* function.
it_it: Usa :func:`functools.cmp_to_key` per convertire una vecchia funzione *cmp* in una funzione *key*.
