Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: Built-in Types
it_it: Tipi incorporati

source: The following sections describe the standard types that are built into the interpreter.
it_it: Le sezioni seguenti descrivono i tipi standard incorporati nell'interprete.

source: The principal built-in types are numerics, sequences, mappings, classes, instances and exceptions.
it_it: I principali tipi incorporati sono numerici, sequenze, mappature, classi, istanze ed eccezioni.

source: Some collection classes are mutable. The methods that add, subtract, or rearrange their members in place, and don't return a specific item, never return the collection instance itself but ``None``.
it_it: Alcune classi di collezioni sono mutabili. I metodi che aggiungono, sottraggono o riorganizzano i loro membri in loco, e non restituiscono un elemento specifico, non restituiscono mai l'istanza della collezione stessa ma ``None``.

source: Some operations are supported by several object types; in particular, practically all objects can be compared for equality, tested for truth value, and converted to a string (with the :func:`repr` function or the slightly different :func:`str` function). The latter function is implicitly used when an object is written by the :func:`print` function.
it_it: Alcune operazioni sono supportate da diversi tipi di oggetti; in particolare, praticamente tutti gli oggetti possono essere confrontati per uguaglianza, testati per valore di verità e convertiti in una stringa (con la funzione :func:`repr` o la funzione leggermente diversa :func:`str`). Quest'ultima funzione viene utilizzata implicitamente quando un oggetto è scritto dalla funzione :func:`print`.

source: Truth Value Testing
it_it: Test del Valore di Verità

source: Any object can be tested for truth value, for use in an :keyword:`if` or :keyword:`while` condition or as operand of the Boolean operations below.
it_it: Qualsiasi oggetto può essere testato per valore di verità, per essere usato in una condizione :keyword:`if` o :keyword:`while` o come operando delle operazioni booleane sotto.

source: By default, an object is considered true unless its class defines either a :meth:`~object.__bool__` method that returns ``False`` or a :meth:`~object.__len__` method that returns zero, when called with the object. [1]_ Here are most of the built-in objects considered false:
it_it: Per impostazione predefinita, un oggetto è considerato vero a meno che la sua classe non definisca un metodo :meth:`~object.__bool__` che restituisce ``False`` o un metodo :meth:`~object.__len__` che restituisce zero, quando chiamato con l’oggetto. [1]_ Ecco la maggior parte degli oggetti incorporati considerati falsi:

source: constants defined to be false: ``None`` and ``False``
it_it: costanti definite come false: ``None`` e ``False``

source: zero of any numeric type: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``
it_it: zero di qualsiasi tipo numerico: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``

source: empty sequences and collections: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``
it_it: sequenze e collezioni vuote: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``

source: Operations and built-in functions that have a Boolean result always return ``0`` or ``False`` for false and ``1`` or ``True`` for true, unless otherwise stated. (Important exception: the Boolean operations ``or`` and ``and`` always return one of their operands.)
it_it: Le operazioni e le funzioni incorporate che hanno un risultato booleano restituiscono sempre ``0`` o ``False`` per false e ``1`` o ``True`` per true, salvo diversa indicazione. (Eccezione importante: le operazioni booleane ``or`` e ``and`` restituiscono sempre uno dei loro operandi.)

source: Boolean Operations --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`
it_it: Operazioni Booleane — :keyword:`!and`, :keyword:`!or`, :keyword:`!not`

source: These are the Boolean operations, ordered by ascending priority:
it_it: Queste sono le operazioni booleane, ordinate per priorità crescente:

source: Operation
it_it: Operazione

source: Result
it_it: Risultato

source: Notes
it_it: Note

source: if *x* is true, then *x*, else *y*
it_it: se *x* è vero, allora *x*, altrimenti *y*

source: if *x* is false, then *x*, else *y*
it_it: se *x* è falso, allora *x*, altrimenti *y*

source: if *x* is false, then ``True``, else ``False``
it_it: se *x* è falso, allora ``True``, altrimenti ``False``

source: Notes:
it_it: Note:

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is false.
it_it: Questo è un operatore a cortocircuito, quindi valuta il secondo argomento solo se il primo è falso.

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is true.
it_it: Questo è un operatore a cortocircuito, quindi valuta il secondo argomento solo se il primo è vero.

source: ``not`` has a lower priority than non-Boolean operators, so ``not a == b`` is interpreted as ``not (a == b)``, and ``a == not b`` is a syntax error.
it_it: ``not`` ha una priorità inferiore rispetto agli operatori non booleani, quindi ``not a == b`` è interpretato come ``not (a == b)``, e ``a == not b`` è un errore di sintassi.

source: Comparisons
it_it: Confronti

source: There are eight comparison operations in Python. They all have the same priority (which is higher than that of the Boolean operations). Comparisons can be chained arbitrarily; for example, ``x < y <= z`` is equivalent to ``x < y and y <= z``, except that *y* is evaluated only once (but in both cases *z* is not evaluated at all when ``x < y`` is found to be false).
it_it: Ci sono otto operazioni di confronto in Python. Hanno tutte la stessa priorità (che è superiore a quella delle operazioni booleane). I confronti possono essere concatenati arbitrariamente; per esempio, ``x < y <= z`` è equivalente a ``x < y and y <= z``, tranne che *y* è valutato solo una volta (ma in entrambi i casi *z* non è valutato affatto quando ``x < y`` risulta falso).

source: This table summarizes the comparison operations:
it_it: Questa tabella riassume le operazioni di confronto:

source: Meaning
it_it: Significato

source: strictly less than
it_it: strettamente minore di

source: less than or equal
it_it: minore o uguale

source: strictly greater than
it_it: strettamente maggiore di

source: greater than or equal
it_it: maggiore o uguale

source: equal
it_it: uguale

source: not equal
it_it: diverso

source: object identity
it_it: identità dell'oggetto

source: negated object identity
it_it: identità dell'oggetto negata

source: Objects of different types, except different numeric types, never compare equal. The ``==`` operator is always defined but for some object types (for example, class objects) is equivalent to :keyword:`is`. The ``<``, ``<=``, ``>`` and ``>=`` operators are only defined where they make sense; for example, they raise a :exc:`TypeError` exception when one of the arguments is a complex number.
it_it: Oggetti di tipi diversi, eccetto diversi tipi numerici, non vengono mai considerati uguali. L'operatore ``==`` è sempre definito ma per alcuni tipi di oggetti (ad esempio, oggetti di classe) è equivalente a :keyword:`is`. Gli operatori ``<``, ``<=``, ``>`` e ``>=`` sono definiti solo dove hanno senso; ad esempio, essi sollevano un'eccezione :exc:`TypeError` quando uno degli argomenti è un numero complesso.

source: Non-identical instances of a class normally compare as non-equal unless the class defines the :meth:`~object.__eq__` method.
it_it: Le istanze non identiche di una classe normalmente vengono considerate come non uguali a meno che la classe definisca il metodo :meth:`~object.__eq__`.

source: Instances of a class cannot be ordered with respect to other instances of the same class, or other types of object, unless the class defines enough of the methods :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, and :meth:`~object.__ge__` (in general, :meth:`~object.__lt__` and :meth:`~object.__eq__` are sufficient, if you want the conventional meanings of the comparison operators).
it_it: Le istanze di una classe non possono essere ordinate rispetto ad altre istanze della stessa classe, o di altri tipi di oggetti, a meno che la classe non definisca abbastanza metodi :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, e :meth:`~object.__ge__` (in generale, :meth:`~object.__lt__` e :meth:`~object.__eq__` sono sufficienti, se si vogliono i significati convenzionali degli operatori di confronto).

source: The behavior of the :keyword:`is` and :keyword:`is not` operators cannot be customized; also they can be applied to any two objects and never raise an exception.
it_it: Il comportamento degli operatori :keyword:`is` e :keyword:`is not` non può essere personalizzato; inoltre possono essere applicati a qualsiasi due oggetti e non sollevano mai un'eccezione.

source: Two more operations with the same syntactic priority, :keyword:`in` and :keyword:`not in`, are supported by types that are :term:`iterable` or implement the :meth:`~object.__contains__` method.
it_it: Due operazioni con la stessa priorità sintattica, :keyword:`in` e :keyword:`not in`, sono supportate da tipi che sono :term:`iterable` o implementano il metodo :meth:`~object.__contains__`.

source: Numeric Types --- :class:`int`, :class:`float`, :class:`complex`
it_it: Tipi Numerici --- :class:`int`, :class:`float`, :class:`complex`

source: There are three distinct numeric types: :dfn:`integers`, :dfn:`floating point numbers`, and :dfn:`complex numbers`. In addition, Booleans are a subtype of integers. Integers have unlimited precision. Floating point numbers are usually implemented using :c:expr:`double` in C; information about the precision and internal representation of floating point numbers for the machine on which your program is running is available in :data:`sys.float_info`. Complex numbers have a real and imaginary part, which are each a floating point number. To extract these parts from a complex number *z*, use ``z.real`` and ``z.imag``. (The standard library includes the additional numeric types :mod:`fractions.Fraction`, for rationals, and :mod:`decimal.Decimal`, for floating-point numbers with user-definable precision.)
it_it: Ci sono tre distinti tipi numerici: :dfn:`interi`, :dfn:`numeri in virgola mobile`, e :dfn:`numeri complessi`. Inoltre, i booleani sono un sottotipo degli interi. Gli interi hanno precisione illimitata. I numeri in virgola mobile sono solitamente implementati usando :c:expr:`double` in C; informazioni sulla precisione e la rappresentazione interna dei numeri in virgola mobile per la macchina su cui il tuo programma è in esecuzione sono disponibili in :data:`sys.float_info`. I numeri complessi hanno una parte reale e una parte immaginaria, entrambe in virgola mobile. Per estrarre queste parti da un numero complesso *z*, usa ``z.real`` e ``z.imag``. (La libreria standard include i tipi numerici aggiuntivi :mod:`fractions.Fraction`, per i numeri razionali, e :mod:`decimal.Decimal`, per i numeri in virgola mobile con precisione definibile dall'utente.)

source: Numbers are created by numeric literals or as the result of built-in functions and operators. Unadorned integer literals (including hex, octal and binary numbers) yield integers. Numeric literals containing a decimal point or an exponent sign yield floating point numbers. Appending ``'j'`` or ``'J'`` to a numeric literal yields an imaginary number (a complex number with a zero real part) which you can add to an integer or float to get a complex number with real and imaginary parts.
it_it: I numeri sono creati da letterali numerici o come risultato di funzioni e operatori integrati. I letterali interi non adornati (inclusi i numeri esadecimali, ottali e binari) generano interi. I letterali numerici contenenti un punto decimale o un segno esponenziale generano numeri in virgola mobile. Aggiungendo ``'j'`` o ``'J'`` a un letterale numerico si ottiene un numero immaginario (un numero complesso con parte reale zero) che puoi aggiungere a un intero o a un numero in virgola mobile per ottenere un numero complesso con parte reale e immaginaria.

source: Python fully supports mixed arithmetic: when a binary arithmetic operator has operands of different numeric types, the operand with the "narrower" type is widened to that of the other, where integer is narrower than floating point, which is narrower than complex. A comparison between numbers of different types behaves as though the exact values of those numbers were being compared. [2]_
it_it: Python supporta completamente l'aritmetica mista: quando un operatore aritmetico binario ha operandi di diversi tipi numerici, l'operando con il tipo "più ristretto" viene ampliato a quello dell'altro, dove intero è più ristretto di virgola mobile, che è più ristretto di complesso. Un confronto tra numeri di tipi diversi si comporta come se fossero confrontati i valori esatti di quei numeri. [2]_

source: The constructors :func:`int`, :func:`float`, and :func:`complex` can be used to produce numbers of a specific type.
it_it: I costruttori :func:`int`, :func:`float` e :func:`complex` possono essere usati per produrre numeri di un tipo specifico.

source: All numeric types (except complex) support the following operations (for priorities of the operations, see :ref:`operator-summary`):
it_it: Tutti i tipi numerici (eccetto i complessi) supportano le seguenti operazioni (per le priorità delle operazioni, vedi :ref:`operator-summary`):

source: Full documentation
it_it: Documentazione completa

source: sum of *x* and *y*
it_it: somma di *x* e *y*

source: difference of *x* and *y*
it_it: differenza tra *x* e *y*

source: product of *x* and *y*
it_it: prodotto di *x* e *y*

source: quotient of *x* and *y*
it_it: quoziente di *x* e *y*

source: floored quotient of *x* and *y*
it_it: quoziente di *x* e *y* arrotondato per difetto

source: remainder of ``x / y``
it_it: resto della divisione ``x / y``

source: *x* negated
it_it: *x* negato

source: *x* unchanged
it_it: *x* invariato

source: absolute value or magnitude of *x*
it_it: valore assoluto o magnitudine di *x*

source: *x* converted to integer
it_it: *x* convertito in intero

source: *x* converted to floating point
it_it: *x* convertito in numero in virgola mobile

source: a complex number with real part *re*, imaginary part *im*. *im* defaults to zero.
it_it: un numero complesso con parte reale *re* e parte immaginaria *im*. *im* predefinito a zero.

source: conjugate of the complex number *c*
it_it: coniugato del numero complesso *c*

source: the pair ``(x // y, x % y)``
it_it: la coppia ``(x // y, x % y)``

source: *x* to the power *y*
it_it: *x* elevato alla potenza *y*

source: Also referred to as integer division. For operands of type :class:`int`, the result has type :class:`int`. For operands of type :class:`float`, the result has type :class:`float`. In general, the result is a whole integer, though the result's type is not necessarily :class:`int`. The result is always rounded towards minus infinity: ``1//2`` is ``0``, ``(-1)//2`` is ``-1``, ``1//(-2)`` is ``-1``, and ``(-1)//(-2)`` is ``0``.
it_it: Anche chiamato divisione intera. Per operandi di tipo :class:`int`, il risultato ha tipo :class:`int`. Per operandi di tipo :class:`float`, il risultato ha tipo :class:`float`. In generale, il risultato è un numero intero, anche se il tipo del risultato non è necessariamente :class:`int`. Il risultato è sempre arrotondato verso meno infinito: ``1//2`` è ``0``, ``(-1)//2`` è ``-1``, ``1//(-2)`` è ``-1``, e ``(-1)//(-2)`` è ``0``.

source: Not for complex numbers. Instead convert to floats using :func:`abs` if appropriate.
it_it: Non per numeri complessi. Convertire invece a float usando :func:`abs` se appropriato.

source: Conversion from :class:`float` to :class:`int` truncates, discarding the fractional part. See functions :func:`math.floor` and :func:`math.ceil` for alternative conversions.
it_it: La conversione da :class:`float` a :class:`int` tronca, scartando la parte frazionaria. Vedere le funzioni :func:`math.floor` e :func:`math.ceil` per conversioni alternative.

source: float also accepts the strings "nan" and "inf" with an optional prefix "+" or "-" for Not a Number (NaN) and positive or negative infinity.
it_it: float accetta anche le stringhe "nan" e "inf" con un prefisso opzionale "+" o "-" per Not a Number (NaN) e infinito positivo o negativo.

source: Python defines ``pow(0, 0)`` and ``0 ** 0`` to be ``1``, as is common for programming languages.
it_it: Python definisce ``pow(0, 0)`` e ``0 ** 0`` come ``1``, come è comune nei linguaggi di programmazione.

source: The numeric literals accepted include the digits ``0`` to ``9`` or any Unicode equivalent (code points with the ``Nd`` property).
it_it: I letterali numerici accettati includono le cifre ``0`` a ``9`` o qualsiasi equivalente Unicode (punti di codice con la proprietà ``Nd``).

source: See `the Unicode Standard <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_ for a complete list of code points with the ``Nd`` property.
it_it: Vedere `the Unicode Standard <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_ per un elenco completo dei punti di codice con la proprietà ``Nd``.

source: All :class:`numbers.Real` types (:class:`int` and :class:`float`) also include the following operations:
it_it: Tutti i tipi :class:`numbers.Real` (:class:`int` e :class:`float`) includono anche le seguenti operazioni:

source: *x* truncated to :class:`~numbers.Integral`
it_it: *x* troncato a :class:`~numbers.Integral`

source: *x* rounded to *n* digits, rounding half to even. If *n* is omitted, it defaults to 0.
it_it: *x* arrotondato a *n* cifre, arrotondando per eccesso in caso di mezza unità. Se *n* è omesso, il valore predefinito è 0.

source: the greatest :class:`~numbers.Integral` <= *x*
it_it: il più grande :class:`~numbers.Integral` <= *x*

source: the least :class:`~numbers.Integral` >= *x*
it_it: il più piccolo :class:`~numbers.Integral` >= *x*

source: For additional numeric operations see the :mod:`math` and :mod:`cmath` modules.
it_it: Per ulteriori operazioni numeriche vedere i moduli :mod:`math` e :mod:`cmath`.

source: Bitwise Operations on Integer Types
it_it: Operazioni Bitwise sui Tipi Integer

source: Bitwise operations only make sense for integers. The result of bitwise operations is calculated as though carried out in two's complement with an infinite number of sign bits.
it_it: Le operazioni bitwise hanno senso solo per gli interi. Il risultato delle operazioni bitwise è calcolato come se eseguito in complemento a due con un numero infinito di bit di segno.

source: The priorities of the binary bitwise operations are all lower than the numeric operations and higher than the comparisons; the unary operation ``~`` has the same priority as the other unary numeric operations (``+`` and ``-``).
it_it: Le priorità delle operazioni binarie bitwise sono tutte inferiori alle operazioni numeriche e superiori alle comparazioni; l'operazione unaria ``~`` ha la stessa priorità delle altre operazioni numeriche unarie (``+`` e ``-``).

source: This table lists the bitwise operations sorted in ascending priority:
it_it: Questa tabella elenca le operazioni bitwise ordinate per priorità crescente:

source: bitwise :dfn:`or` of *x* and *y*
it_it: bitwise :dfn:`or` di *x* e *y*

source: bitwise :dfn:`exclusive or` of *x* and *y*
it_it: bitwise :dfn:`or esclusivo` di *x* e *y*

source: bitwise :dfn:`and` of *x* and *y*
it_it: bitwise :dfn:`and` di *x* e *y*

source: *x* shifted left by *n* bits
it_it: *x* spostato a sinistra di *n* bit

source: *x* shifted right by *n* bits
it_it: *x* spostato a destra di *n* bit

source: the bits of *x* inverted
it_it: i bit di *x* invertiti

source: Negative shift counts are illegal and cause a :exc:`ValueError` to be raised.
it_it: I conteggi di shift negativi sono illegali e causano un'eccezione :exc:`ValueError`.

source: A left shift by *n* bits is equivalent to multiplication by ``pow(2, n)``.
it_it: Uno shift a sinistra di *n* bit è equivalente alla moltiplicazione per ``pow(2, n)``.

source: A right shift by *n* bits is equivalent to floor division by ``pow(2, n)``.
it_it: Uno shift a destra di *n* bit è equivalente alla divisione intera per ``pow(2, n)``.

source: Performing these calculations with at least one extra sign extension bit in a finite two's complement representation (a working bit-width of ``1 + max(x.bit_length(), y.bit_length())`` or more) is sufficient to get the same result as if there were an infinite number of sign bits.
it_it: Eseguire questi calcoli con almeno un bit di estensione del segno in più in una rappresentazione a complemento a due finita (una larghezza di bit lavorativa di ``1 + max(x.bit_length(), y.bit_length())`` o più) è sufficiente per ottenere lo stesso risultato come se ci fossero un numero infinito di bit di segno.

source: Additional Methods on Integer Types
it_it: Metodi Aggiuntivi sui Tipi Integer

source: The int type implements the :class:`numbers.Integral` :term:`abstract base class`. In addition, it provides a few more methods:
it_it: Il tipo int implementa la :class:`numbers.Integral` :term:`abstract base class`. Inoltre, fornisce qualche metodo in più:

source: Return the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros::
it_it: Restituisce il numero di bit necessari a rappresentare un intero in binario, escludendo il segno e gli zeri iniziali::

source: More precisely, if ``x`` is nonzero, then ``x.bit_length()`` is the unique positive integer ``k`` such that ``2**(k-1) <= abs(x) < 2**k``. Equivalently, when ``abs(x)`` is small enough to have a correctly rounded logarithm, then ``k = 1 + int(log(abs(x), 2))``. If ``x`` is zero, then ``x.bit_length()`` returns ``0``.
it_it: Più precisamente, se ``x`` è diverso da zero, allora ``x.bit_length()`` è l'unico intero positivo ``k`` tale che ``2**(k-1) <= abs(x) < 2**k``. Equivalentemente, quando ``abs(x)`` è sufficientemente piccolo da avere un logaritmo correttamente arrotondato, allora ``k = 1 + int(log(abs(x), 2))``. Se ``x`` è zero, allora ``x.bit_length()`` restituisce ``0``.

source: Equivalent to::
it_it: Equivalente a::

source: Return the number of ones in the binary representation of the absolute value of the integer. This is also known as the population count. Example::
it_it: Restituisce il numero di uno nella rappresentazione binaria del valore assoluto dell’intero. Questo è anche conosciuto come il conteggio della popolazione. Esempio::

source: Return an array of bytes representing an integer.
it_it: Restituisce un array di byte che rappresenta un intero.

source: The integer is represented using *length* bytes, and defaults to 1. An :exc:`OverflowError` is raised if the integer is not representable with the given number of bytes.
it_it: L'intero è rappresentato utilizzando *length* byte, e il valore predefinito è 1. Viene sollevata un'eccezione :exc:`OverflowError` se l'intero non è rappresentabile con il numero di byte fornito.

source: The *byteorder* argument determines the byte order used to represent the integer, and defaults to ``"big"``. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array.
it_it: L'argomento *byteorder* determina l'ordine dei byte utilizzato per rappresentare l'intero, e il valore predefinito è ``"big"``. Se *byteorder* è ``"big"``, il byte più significativo è all'inizio dell'array di byte. Se *byteorder* è ``"little"``, il byte più significativo è alla fine dell'array di byte.
