Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: Return a :class:`types.MappingProxyType` that wraps the original dictionary to which the view refers.
it_it: Restituisce un :class:`types.MappingProxyType` che incapsula il dizionario originale cui si riferisce la vista.

source: Keys views are set-like since their entries are unique and :term:`hashable`. Items views also have set-like operations since the (key, value) pairs are unique and the keys are hashable. If all values in an items view are hashable as well, then the items view can interoperate with other sets. (Values views are not treated as set-like since the entries are generally not unique.) For set-like views, all of the operations defined for the abstract base class :class:`collections.abc.Set` are available (for example, ``==``, ``<``, or ``^``). While using set operators, set-like views accept any iterable as the other operand, unlike sets which only accept sets as the input.
it_it: Le viste delle chiavi sono simili a insiemi poiché le loro voci sono uniche e :term:`hashable`. Anche le viste degli elementi hanno operazioni simili a insiemi poiché le coppie (key, value) sono uniche e le chiavi sono hashable. Se anche tutti i valori in una vista di elementi sono hashable, allora la vista degli elementi può interoperare con altri insiemi. (Le viste dei valori non sono trattate come simili agli insiemi poiché le voci generalmente non sono uniche.) Per le viste simili agli insiemi, sono disponibili tutte le operazioni definite per la classe base astratta :class:`collections.abc.Set` (ad esempio, ``==``, ``<``, o ``^``). Durante l'uso degli operatori di insiemi, le viste simili agli insiemi accettano qualsiasi iterabile come l'altro operando, a differenza degli insiemi che accettano solo insiemi come input.

source: An example of dictionary view usage::
it_it: Un esempio di utilizzo delle viste del dizionario::

source: Context Manager Types
it_it: Tipi di gestori di contesti

source: Python's :keyword:`with` statement supports the concept of a runtime context defined by a context manager. This is implemented using a pair of methods that allow user-defined classes to define a runtime context that is entered before the statement body is executed and exited when the statement ends:
it_it: La dichiarazione :keyword:`with` di Python supporta il concetto di un contesto di runtime definito da un gestore di contesto. Questo è implementato utilizzando una coppia di metodi che consentono alle classi definite dall'utente di definire un contesto di runtime che viene inserito prima che il corpo della dichiarazione venga eseguito ed esce quando la dichiarazione termina:

source: Enter the runtime context and return either this object or another object related to the runtime context. The value returned by this method is bound to the identifier in the :keyword:`!as` clause of :keyword:`with` statements using this context manager.
it_it: Entra nel contesto di runtime e restituisce questo oggetto o un altro oggetto relativo al contesto di runtime. Il valore restituito da questo metodo è associato all'identificatore nella clausola :keyword:`!as` di dichiarazioni :keyword:`with` che usano questo gestore di contesto.

source: An example of a context manager that returns itself is a :term:`file object`. File objects return themselves from __enter__() to allow :func:`open` to be used as the context expression in a :keyword:`with` statement.
it_it: Un esempio di un gestore di contesto che restituisce se stesso è un :term:`file object`. Gli oggetti file restituiscono se stessi da __enter__() per permettere di usare :func:`open` come espressione di contesto in una dichiarazione :keyword:`with`.

source: An example of a context manager that returns a related object is the one returned by :func:`decimal.localcontext`. These managers set the active decimal context to a copy of the original decimal context and then return the copy. This allows changes to be made to the current decimal context in the body of the :keyword:`with` statement without affecting code outside the :keyword:`!with` statement.
it_it: Un esempio di un gestore di contesto che restituisce un oggetto correlato è quello restituito da :func:`decimal.localcontext`. Questi gestori impostano il contesto decimale attivo su una copia del contesto decimale originale e quindi restituiscono la copia. Questo consente di apportare modifiche al contesto decimale corrente nel corpo della dichiarazione :keyword:`with` senza influenzare il codice al di fuori della dichiarazione :keyword:`!with`.

source: Exit the runtime context and return a Boolean flag indicating if any exception that occurred should be suppressed. If an exception occurred while executing the body of the :keyword:`with` statement, the arguments contain the exception type, value and traceback information. Otherwise, all three arguments are ``None``.
it_it: Esce dal contesto di runtime e restituisce un flag booleano che indica se deve essere soppressa un'eccezione che si è verificata. Se si è verificata un'eccezione durante l'esecuzione del corpo della dichiarazione :keyword:`with`, gli argomenti contengono il tipo di eccezione, il valore e le informazioni di traceback. Altrimenti, tutti e tre gli argomenti sono ``None``.

source: Returning a true value from this method will cause the :keyword:`with` statement to suppress the exception and continue execution with the statement immediately following the :keyword:`!with` statement. Otherwise the exception continues propagating after this method has finished executing. Exceptions that occur during execution of this method will replace any exception that occurred in the body of the :keyword:`!with` statement.
it_it: Restituire un valore vero da questo metodo farà sì che la dichiarazione :keyword:`with` sopprima l'eccezione e continui l'esecuzione con l'istruzione immediatamente successiva alla dichiarazione :keyword:`!with`. Altrimenti, l'eccezione continua a propagarsi dopo che questo metodo ha terminato l'esecuzione. Le eccezioni che si verificano durante l'esecuzione di questo metodo sostituiranno qualsiasi eccezione che si è verificata nel corpo della dichiarazione :keyword:`!with`.

source: The exception passed in should never be reraised explicitly - instead, this method should return a false value to indicate that the method completed successfully and does not want to suppress the raised exception. This allows context management code to easily detect whether or not an :meth:`~object.__exit__` method has actually failed.
it_it: L'eccezione passata non dovrebbe mai essere riesposta esplicitamente - invece, questo metodo dovrebbe restituire un valore falso per indicare che il metodo è stato completato con successo e non vuole sopprimere l'eccezione sollevata. Questo consente al codice di gestione del contesto di rilevare facilmente se un metodo :meth:`~object.__exit__` ha effettivamente fallito.

source: Python defines several context managers to support easy thread synchronisation, prompt closure of files or other objects, and simpler manipulation of the active decimal arithmetic context. The specific types are not treated specially beyond their implementation of the context management protocol. See the :mod:`contextlib` module for some examples.
it_it: Python definisce diversi gestori di contesto per supportare una facile sincronizzazione dei thread, la chiusura rapida di file o altri oggetti e una manipolazione più semplice del contesto di aritmetica decimale attivo. I tipi specifici non sono trattati in modo speciale oltre alla loro implementazione del protocollo di gestione del contesto. Vedi il modulo :mod:`contextlib` per alcuni esempi.

source: Python's :term:`generator`\s and the :class:`contextlib.contextmanager` decorator provide a convenient way to implement these protocols. If a generator function is decorated with the :class:`contextlib.contextmanager` decorator, it will return a context manager implementing the necessary :meth:`~contextmanager.__enter__` and :meth:`~contextmanager.__exit__` methods, rather than the iterator produced by an undecorated generator function.
it_it: I :term:`generator`\i di Python e il decoratore :class:`contextlib.contextmanager` forniscono un modo conveniente per implementare questi protocolli. Se una funzione generatrice è decorata con il decoratore :class:`contextlib.contextmanager`, restituirà un gestore di contesto che implementa i metodi necessari :meth:`~contextmanager.__enter__` e :meth:`~contextmanager.__exit__`, piuttosto che l'iteratore prodotto da una funzione generatrice non decorata.

source: Note that there is no specific slot for any of these methods in the type structure for Python objects in the Python/C API. Extension types wanting to define these methods must provide them as a normal Python accessible method. Compared to the overhead of setting up the runtime context, the overhead of a single class dictionary lookup is negligible.
it_it: Si noti che non esiste uno slot specifico per nessuno di questi metodi nella struttura dei tipi per gli oggetti Python nell'API Python/C. I tipi di estensione che desiderano definire questi metodi devono fornirli come un normale metodo accessibile da Python. Rispetto al sovraccarico di impostare il contesto di runtime, il sovraccarico di una singola ricerca nel dizionario della classe è trascurabile.

source: Type Annotation Types --- :ref:`Generic Alias <types-genericalias>`, :ref:`Union <types-union>`
it_it: Tipi di annotazione di tipo --- :ref:`Alias generico <types-genericalias>`, :ref:`Union <types-union>`

source: The core built-in types for :term:`type annotations <annotation>` are :ref:`Generic Alias <types-genericalias>` and :ref:`Union <types-union>`.
it_it: I tipi core incorporati per :term:`type annotations <annotation>` sono :ref:`Generic Alias <types-genericalias>` e :ref:`Union <types-union>`.

source: Generic Alias Type
it_it: Tipo Generic Alias

source: ``GenericAlias`` objects are generally created by :ref:`subscripting <subscriptions>` a class. They are most often used with :ref:`container classes <sequence-types>`, such as :class:`list` or :class:`dict`. For example, ``list[int]`` is a ``GenericAlias`` object created by subscripting the ``list`` class with the argument :class:`int`. ``GenericAlias`` objects are intended primarily for use with :term:`type annotations <annotation>`.
it_it: Gli oggetti ``GenericAlias`` sono generalmente creati tramite :ref:`subscripting <subscriptions>` di una classe. Sono più spesso utilizzati con :ref:`container classes <sequence-types>`, come :class:`list` o :class:`dict`. Ad esempio, ``list[int]`` è un oggetto ``GenericAlias`` creato facendo subscripting della classe ``list`` con l'argomento :class:`int`. Gli oggetti ``GenericAlias`` sono progettati principalmente per essere usati con :term:`type annotations <annotation>`.

source: It is generally only possible to subscript a class if the class implements the special method :meth:`~object.__class_getitem__`.
it_it: Generalmente è possibile fare subscripting di una classe solo se la classe implementa il metodo speciale :meth:`~object.__class_getitem__`.

source: A ``GenericAlias`` object acts as a proxy for a :term:`generic type`, implementing *parameterized generics*.
it_it: Un oggetto ``GenericAlias`` funge da proxy per un :term:`generic type`, implementando *parameterized generics*.

source: For a container class, the argument(s) supplied to a :ref:`subscription <subscriptions>` of the class may indicate the type(s) of the elements an object contains. For example, ``set[bytes]`` can be used in type annotations to signify a :class:`set` in which all the elements are of type :class:`bytes`.
it_it: Per una container class, l'argomento o gli argomenti forniti a un :ref:`subscription <subscriptions>` della classe possono indicare il tipo o i tipi degli elementi che un oggetto contiene. Ad esempio, ``set[bytes]`` può essere utilizzato nelle type annotations per indicare un :class:`set` in cui tutti gli elementi sono di tipo :class:`bytes`.

source: For a class which defines :meth:`~object.__class_getitem__` but is not a container, the argument(s) supplied to a subscription of the class will often indicate the return type(s) of one or more methods defined on an object. For example, :mod:`regular expressions <re>` can be used on both the :class:`str` data type and the :class:`bytes` data type:
it_it: Per una classe che definisce :meth:`~object.__class_getitem__` ma non è un container, l'argomento o gli argomenti forniti a un subscription della classe spesso indicheranno il tipo di ritorno di uno o più metodi definiti su un oggetto. Ad esempio, :mod:`regular expressions <re>` può essere utilizzato sia sul tipo di dato :class:`str` che sul tipo di dato :class:`bytes`:

source: If ``x = re.search('foo', 'foo')``, ``x`` will be a :ref:`re.Match <match-objects>` object where the return values of ``x.group(0)`` and ``x[0]`` will both be of type :class:`str`. We can represent this kind of object in type annotations with the ``GenericAlias`` ``re.Match[str]``.
it_it: Se ``x = re.search('foo', 'foo')``, ``x`` sarà un oggetto :ref:`re.Match <match-objects>` dove i valori di ritorno di ``x.group(0)`` e ``x[0]`` saranno entrambi di tipo :class:`str`. Possiamo rappresentare questo tipo di oggetto nelle type annotations con il ``GenericAlias`` ``re.Match[str]``.

source: If ``y = re.search(b'bar', b'bar')``, (note the ``b`` for :class:`bytes`), ``y`` will also be an instance of ``re.Match``, but the return values of ``y.group(0)`` and ``y[0]`` will both be of type :class:`bytes`. In type annotations, we would represent this variety of :ref:`re.Match <match-objects>` objects with ``re.Match[bytes]``.
it_it: Se ``y = re.search(b'bar', b'bar')``, (nota il ``b`` per :class:`bytes`), ``y`` sarà anch'esso un'istanza di ``re.Match``, ma i valori di ritorno di ``y.group(0)`` e ``y[0]`` saranno entrambi di tipo :class:`bytes`. Nelle type annotations, rappresenteremmo questa varietà di oggetti :ref:`re.Match <match-objects>` con ``re.Match[bytes]``.

source: ``GenericAlias`` objects are instances of the class :class:`types.GenericAlias`, which can also be used to create ``GenericAlias`` objects directly.
it_it: Gli oggetti ``GenericAlias`` sono istanze della classe :class:`types.GenericAlias`, che può essere utilizzata anche per creare direttamente oggetti ``GenericAlias``.

source: Creates a ``GenericAlias`` representing a type ``T`` parameterized by types *X*, *Y*, and more depending on the ``T`` used. For example, a function expecting a :class:`list` containing :class:`float` elements::
it_it: Crea un ``GenericAlias`` che rappresenta un tipo ``T`` parametrizzato dai tipi *X*, *Y* e altro a seconda del ``T`` utilizzato. Ad esempio, una funzione che si aspetta una :class:`list` contenente elementi di tipo :class:`float`::

source: Another example for :term:`mapping` objects, using a :class:`dict`, which is a generic type expecting two type parameters representing the key type and the value type. In this example, the function expects a ``dict`` with keys of type :class:`str` and values of type :class:`int`::
it_it: Un altro esempio per gli oggetti :term:`mapping`, utilizzando un :class:`dict`, che è un tipo generico che si aspetta due parametri di tipo che rappresentano il tipo delle chiavi e il tipo dei valori. In questo esempio, la funzione si aspetta un ``dict`` con chiavi di tipo :class:`str` e valori di tipo :class:`int`::

source: The builtin functions :func:`isinstance` and :func:`issubclass` do not accept ``GenericAlias`` types for their second argument::
it_it: Le funzioni incorporate :func:`isinstance` e :func:`issubclass` non accettano tipi ``GenericAlias`` come secondo argomento::

source: The Python runtime does not enforce :term:`type annotations <annotation>`. This extends to generic types and their type parameters. When creating a container object from a ``GenericAlias``, the elements in the container are not checked against their type. For example, the following code is discouraged, but will run without errors::
it_it: Il runtime Python non impone :term:`type annotations <annotation>`. Questo si estende ai tipi generici e ai loro parametri di tipo. Quando si crea un oggetto container da un ``GenericAlias``, gli elementi nel container non vengono verificati in base al loro tipo. Ad esempio, il seguente codice è sconsigliato, ma verrà eseguito senza errori::

source: Furthermore, parameterized generics erase type parameters during object creation::
it_it: Inoltre, i generici parametrizzati eliminano i parametri di tipo durante la creazione dell'oggetto::

source: Calling :func:`repr` or :func:`str` on a generic shows the parameterized type::
it_it: Chiamare :func:`repr` o :func:`str` su un generico mostra il tipo parametrizzato::

source: The :meth:`~object.__getitem__` method of generic containers will raise an exception to disallow mistakes like ``dict[str][str]``::
it_it: Il metodo :meth:`~object.__getitem__` dei container generici solleverà un'eccezione per impedire errori come ``dict[str][str]``::

source: However, such expressions are valid when :ref:`type variables <generics>` are used. The index must have as many elements as there are type variable items in the ``GenericAlias`` object's :attr:`~genericalias.__args__`. ::
it_it: Tuttavia, tali espressioni sono valide quando vengono utilizzate le :ref:`type variables <generics>`. L'indice deve avere tanti elementi quanti sono gli item delle variabili di tipo nell'oggetto ``GenericAlias`` :attr:`~genericalias.__args__`.::

source: Standard Generic Classes
it_it: Classi Generiche Standard

source: The following standard library classes support parameterized generics. This list is non-exhaustive.
it_it: Le seguenti classi della libreria standard supportano i generici parametrizzati. Questa lista non è esaustiva.

source: Special Attributes of ``GenericAlias`` objects
it_it: Attributi Speciali per oggetti ``GenericAlias``

source: All parameterized generics implement special read-only attributes.
it_it: Tutti i generici parametrici implementano attributi speciali di sola lettura.

source: This attribute points at the non-parameterized generic class::
it_it: Questo attributo punta alla classe generica non parametrizzata::

source: This attribute is a :class:`tuple` (possibly of length 1) of generic types passed to the original :meth:`~object.__class_getitem__` of the generic class::
it_it: Questo attributo è una :class:`tuple` (possibilmente di lunghezza 1) di tipi generici passati al metodo originale :meth:`~object.__class_getitem__` della classe generica::

source: This attribute is a lazily computed tuple (possibly empty) of unique type variables found in ``__args__``::
it_it: Questo attributo è una tupla calcolata pigramente (possibilmente vuota) di variabili di tipo uniche trovate in ``__args__``::

source: A ``GenericAlias`` object with :class:`typing.ParamSpec` parameters may not have correct ``__parameters__`` after substitution because :class:`typing.ParamSpec` is intended primarily for static type checking.
it_it: Un oggetto ``GenericAlias`` con parametri :class:`typing.ParamSpec` potrebbe non avere ``__parameters__`` corretti dopo la sostituzione perché :class:`typing.ParamSpec` è destinato principalmente al controllo statico dei tipi.

source: A boolean that is true if the alias has been unpacked using the ``*`` operator (see :data:`~typing.TypeVarTuple`).
it_it: Un booleano che è vero se l'alias è stato espanso usando l'operatore ``*`` (vedere :data:`~typing.TypeVarTuple`).

source: :pep:`484` - Type Hints
it_it: :pep:`484` - Suggerimenti di Tipo

source: Introducing Python's framework for type annotations.
it_it: Introduzione al framework di Python per le annotazioni di tipo.

source: :pep:`585` - Type Hinting Generics In Standard Collections
it_it: :pep:`585` - Indicazione di Tipo Generica nelle Collezioni Standard

source: Introducing the ability to natively parameterize standard-library classes, provided they implement the special class method :meth:`~object.__class_getitem__`.
it_it: Introduzione alla capacità di parametrizzare nativamente le classi della libreria standard, a condizione che implementino il metodo speciale di classe :meth:`~object.__class_getitem__`.

source: :ref:`Generics`, :ref:`user-defined generics <user-defined-generics>` and :class:`typing.Generic`
it_it: :ref:`Generics`, :ref:`user-defined generics <user-defined-generics>` e :class:`typing.Generic`

source: Documentation on how to implement generic classes that can be parameterized at runtime and understood by static type-checkers.
it_it: Documentazione su come implementare classi generiche che possono essere parametrizzate in fase di esecuzione e comprese dai controllori di tipo statico.

source: Union Type
it_it: Tipo Unione

source: A union object holds the value of the ``|`` (bitwise or) operation on multiple :ref:`type objects <bltin-type-objects>`. These types are intended primarily for :term:`type annotations <annotation>`. The union type expression enables cleaner type hinting syntax compared to :data:`typing.Union`.
it_it: Un oggetto unione contiene il valore dell'operazione ``|`` (or bit a bit) su più :ref:`oggetti di tipo <bltin-type-objects>`. Questi tipi sono destinati principalmente alle :term:`annotazioni di tipo <annotation>`. L'espressione del tipo unione consente una sintassi più pulita per i suggerimenti di tipo rispetto a :data:`typing.Union`.

source: Defines a union object which holds types *X*, *Y*, and so forth. ``X | Y`` means either X or Y. It is equivalent to ``typing.Union[X, Y]``. For example, the following function expects an argument of type :class:`int` or :class:`float`::
it_it: Definisce un oggetto unione che contiene i tipi *X*, *Y*, e così via. ``X | Y`` significa X o Y. È equivalente a ``typing.Union[X, Y]``. Ad esempio, la seguente funzione si aspetta un argomento di tipo :class:`int` o :class:`float`::

source: The ``|`` operand cannot be used at runtime to define unions where one or more members is a forward reference. For example, ``int | "Foo"``, where ``"Foo"`` is a reference to a class not yet defined, will fail at runtime. For unions which include forward references, present the whole expression as a string, e.g. ``"int | Foo"``.
it_it: L'operando ``|`` non può essere utilizzato in fase di esecuzione per definire unioni dove uno o più membri sono un riferimento in avanti. Ad esempio, ``int | "Foo"``, dove ``"Foo"`` è un riferimento a una classe non ancora definita, fallirà in fase di esecuzione. Per le unioni che includono riferimenti in avanti, presentare l'intera espressione come una stringa, ad esempio ``"int | Foo"``.

source: Union objects can be tested for equality with other union objects. Details:
it_it: Gli oggetti unione possono essere testati per uguaglianza con altri oggetti unione. Dettagli:

source: Unions of unions are flattened::
it_it: Le unioni di unioni sono appiattite::

source: Redundant types are removed::
it_it: I tipi ridondanti sono rimossi::

source: When comparing unions, the order is ignored::
it_it: Quando si confrontano le unioni, l'ordine è ignorato::

source: It is compatible with :data:`typing.Union`::
it_it: È compatibile con :data:`typing.Union`::

source: Optional types can be spelled as a union with ``None``::
it_it: I tipi opzionali possono essere scritti come un'unione con ``None``::

source: Calls to :func:`isinstance` and :func:`issubclass` are also supported with a union object::
it_it: Anche le chiamate a :func:`isinstance` e :func:`issubclass` sono supportate con un oggetto unione::

source: However, :ref:`parameterized generics <types-genericalias>` in union objects cannot be checked::
it_it: Tuttavia, :ref:`generici parametrici <types-genericalias>` negli oggetti unione non possono essere verificati::
