Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: :pep:`461` - Adding % formatting to bytes and bytearray
it_it: :pep:`461` - Aggiunta della formattazione % a bytes e bytearray

source: :class:`memoryview` objects allow Python code to access the internal data of an object that supports the :ref:`buffer protocol <bufferobjects>` without copying.
it_it: Gli oggetti :class:`memoryview` permettono al codice Python di accedere ai dati interni di un oggetto che supporta il :ref:`buffer protocol <bufferobjects>` senza copiarli.

source: Create a :class:`memoryview` that references *object*. *object* must support the buffer protocol. Built-in objects that support the buffer protocol include :class:`bytes` and :class:`bytearray`.
it_it: Crea un :class:`memoryview` che fa riferimento a *object*. *object* deve supportare il buffer protocol. Gli oggetti integrati che supportano il buffer protocol includono :class:`bytes` e :class:`bytearray`.

source: A :class:`memoryview` has the notion of an *element*, which is the atomic memory unit handled by the originating *object*. For many simple types such as :class:`bytes` and :class:`bytearray`, an element is a single byte, but other types such as :class:`array.array` may have bigger elements.
it_it: Un :class:`memoryview` ha la nozione di *elemento*, che è l'unità di memoria atomica gestita dall'*object* originario. Per molti tipi semplici come :class:`bytes` e :class:`bytearray`, un elemento è un byte singolo, ma altri tipi come :class:`array.array` possono avere elementi più grandi.

source: ``len(view)`` is equal to the length of :class:`~memoryview.tolist`, which is the nested list representation of the view. If ``view.ndim = 1``, this is equal to the number of elements in the view.
it_it: ``len(view)`` è uguale alla lunghezza di :class:`~memoryview.tolist`, che è la rappresentazione dell'elenco nidificato della vista. Se ``view.ndim = 1``, questo è uguale al numero di elementi nella vista.

source: If ``view.ndim == 0``, ``len(view)`` now raises :exc:`TypeError` instead of returning 1.
it_it: Se ``view.ndim == 0``, ``len(view)`` ora solleva :exc:`TypeError` invece di restituire 1.

source: The :class:`~memoryview.itemsize` attribute will give you the number of bytes in a single element.
it_it: L'attributo :class:`~memoryview.itemsize` ti fornirà il numero di byte in un singolo elemento.

source: A :class:`memoryview` supports slicing and indexing to expose its data. One-dimensional slicing will result in a subview::
it_it: Un :class:`memoryview` supporta slicing e indicizzazioni per esporre i suoi dati. Lo slicing monodimensionale risulterà in una sotto-vista::

source: If :class:`~memoryview.format` is one of the native format specifiers from the :mod:`struct` module, indexing with an integer or a tuple of integers is also supported and returns a single *element* with the correct type. One-dimensional memoryviews can be indexed with an integer or a one-integer tuple. Multi-dimensional memoryviews can be indexed with tuples of exactly *ndim* integers where *ndim* is the number of dimensions. Zero-dimensional memoryviews can be indexed with the empty tuple.
it_it: Se :class:`~memoryview.format` è uno degli specificatori di formato nativi del modulo :mod:`struct`, l'indicizzazione con un intero o una tupla di interi è anche supportata e restituisce un singolo *elemento* con il tipo corretto. Le memoryview monodimensionali possono essere indicizzate con un intero o una tupla di un intero. Le memoryview multidimensionali possono essere indicizzate con tuple di esattamente *ndim* interi dove *ndim* è il numero di dimensioni. Le memoryview zero-dimensionali possono essere indicizzate con la tupla vuota.

source: Here is an example with a non-byte format::
it_it: Ecco un esempio con un formato non-byte::

source: If the underlying object is writable, the memoryview supports one-dimensional slice assignment. Resizing is not allowed::
it_it: Se l'oggetto sottostante è scrivibile, la memoryview supporta l'assegnazione di slice monodimensionale. Non è permesso il ridimensionamento::

source: One-dimensional memoryviews of :term:`hashable` (read-only) types with formats 'B', 'b' or 'c' are also hashable. The hash is defined as ``hash(m) == hash(m.tobytes())``::
it_it: Le memoryview monodimensionali di tipi :term:`hashable` (di sola lettura) con formati 'B', 'b' o 'c' sono anche hashable. L'hash è definito come ``hash(m) == hash(m.tobytes())``::

source: One-dimensional memoryviews can now be sliced. One-dimensional memoryviews with formats 'B', 'b' or 'c' are now :term:`hashable`.
it_it: Le memoryview monodimensionali possono ora essere slice. Le memoryview monodimensionali con formati 'B', 'b' o 'c' sono ora :term:`hashable`.

source: memoryview is now registered automatically with :class:`collections.abc.Sequence`
it_it: memoryview è ora registrato automaticamente con :class:`collections.abc.Sequence`

source: memoryviews can now be indexed with tuple of integers.
it_it: le memoryview possono ora essere indicizzate con tuple di interi.

source: :class:`memoryview` has several methods:
it_it: :class:`memoryview` ha diversi metodi:

source: A memoryview and a :pep:`3118` exporter are equal if their shapes are equivalent and if all corresponding values are equal when the operands' respective format codes are interpreted using :mod:`struct` syntax.
it_it: Una memoryview e un esportatore :pep:`3118` sono uguali se le loro forme sono equivalenti e se tutti i valori corrispondenti sono uguali quando i rispettivi codici di formato degli operandi sono interpretati utilizzando la sintassi :mod:`struct`.

source: For the subset of :mod:`struct` format strings currently supported by :meth:`tolist`, ``v`` and ``w`` are equal if ``v.tolist() == w.tolist()``::
it_it: Per il sottoinsieme di stringhe di formato :mod:`struct` attualmente supportato da :meth:`tolist`, ``v`` e ``w`` sono uguali se ``v.tolist() == w.tolist()``::

source: If either format string is not supported by the :mod:`struct` module, then the objects will always compare as unequal (even if the format strings and buffer contents are identical)::
it_it: Se una delle stringhe di formato non è supportata dal modulo :mod:`struct`, allora gli oggetti saranno sempre considerati diversi (anche se le stringhe di formato e i contenuti del buffer sono identici)::

source: Note that, as with floating point numbers, ``v is w`` does *not* imply ``v == w`` for memoryview objects.
it_it: Si noti che, come per i numeri in virgola mobile, ``v is w`` non implica ``v == w`` per gli oggetti memoryview.

source: Previous versions compared the raw memory disregarding the item format and the logical array structure.
it_it: Le versioni precedenti confrontavano la memoria grezza senza considerare il formato degli elementi e la struttura dell'array logico.

source: Return the data in the buffer as a bytestring. This is equivalent to calling the :class:`bytes` constructor on the memoryview. ::
it_it: Restituisce i dati nel buffer come una stringa di byte. Questo è equivalente a chiamare il costruttore :class:`bytes` sulla memoryview. ::

source: For non-contiguous arrays the result is equal to the flattened list representation with all elements converted to bytes. :meth:`tobytes` supports all format strings, including those that are not in :mod:`struct` module syntax.
it_it: Per gli array non contigui il risultato è uguale alla rappresentazione dell'elenco appiattito con tutti gli elementi convertiti in byte. :meth:`tobytes` supporta tutte le stringhe di formato, comprese quelle che non sono nella sintassi del modulo :mod:`struct`.

source: *order* can be {'C', 'F', 'A'}. When *order* is 'C' or 'F', the data of the original array is converted to C or Fortran order. For contiguous views, 'A' returns an exact copy of the physical memory. In particular, in-memory Fortran order is preserved. For non-contiguous views, the data is converted to C first. *order=None* is the same as *order='C'*.
it_it: *order* può essere {'C', 'F', 'A'}. Quando *order* è 'C' o 'F', i dati dell'array originale sono convertiti in ordine C o Fortran. Per le viste contigue, 'A' restituisce una copia esatta della memoria fisica. In particolare, l'ordine Fortran in memoria viene preservato. Per le viste non contigue, i dati sono prima convertiti in C. *order=None* è equivalente a *order='C'*.

source: Return a string object containing two hexadecimal digits for each byte in the buffer. ::
it_it: Restituisce un oggetto stringa contenente due cifre esadecimali per ogni byte nel buffer. ::

source: Similar to :meth:`bytes.hex`, :meth:`memoryview.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
it_it: Simile a :meth:`bytes.hex`, :meth:`memoryview.hex` supporta ora i parametri opzionali *sep* e *bytes_per_sep* per inserire separatori tra i byte nell'output esadecimale.

source: Return the data in the buffer as a list of elements. ::
it_it: Restituisce i dati nel buffer come una lista di elementi. ::

source: :meth:`tolist` now supports all single character native formats in :mod:`struct` module syntax as well as multi-dimensional representations.
it_it: :meth:`tolist` supporta ora tutti i formati nativi a singolo carattere nella sintassi del modulo :mod:`struct` nonché rappresentazioni multidimensionali.

source: Return a readonly version of the memoryview object. The original memoryview object is unchanged. ::
it_it: Restituisce una versione di sola lettura dell'oggetto memoryview. L'oggetto memoryview originale rimane invariato. ::

source: Release the underlying buffer exposed by the memoryview object. Many objects take special actions when a view is held on them (for example, a :class:`bytearray` would temporarily forbid resizing); therefore, calling release() is handy to remove these restrictions (and free any dangling resources) as soon as possible.
it_it: Rilascia il buffer sottostante esposto dall'oggetto memoryview. Molti oggetti prendono azioni speciali quando una vista è mantenuta su di essi (ad esempio, un :class:`bytearray` temporaneamente vieterebbe il ridimensionamento); quindi, chiamare release() è utile per rimuovere queste restrizioni (e liberare eventuali risorse sospese) il più presto possibile.

source: After this method has been called, any further operation on the view raises a :class:`ValueError` (except :meth:`release()` itself which can be called multiple times)::
it_it: Dopo che questo metodo è stato chiamato, qualsiasi ulteriore operazione sulla vista solleva un'eccezione :class:`ValueError` (eccetto :meth:`release()` stesso che può essere chiamato più volte)::

source: The context management protocol can be used for a similar effect, using the ``with`` statement::
it_it: Il protocollo di gestione del contesto può essere utilizzato per un effetto simile, usando l'istruzione ``with``::

source: Cast a memoryview to a new format or shape. *shape* defaults to ``[byte_length//new_itemsize]``, which means that the result view will be one-dimensional. The return value is a new memoryview, but the buffer itself is not copied. Supported casts are 1D -> C-:term:`contiguous` and C-contiguous -> 1D.
it_it: Converte un memoryview in un nuovo formato o forma. *shape* di default è ``[byte_length//new_itemsize]``, il che significa che la vista risultante sarà unidimensionale. Il valore restituito è un nuovo memoryview, ma il buffer stesso non è copiato. I cast supportati sono 1D -> C-:term:`contiguous` e C-contiguous -> 1D.

source: The destination format is restricted to a single element native format in :mod:`struct` syntax. One of the formats must be a byte format ('B', 'b' or 'c'). The byte length of the result must be the same as the original length. Note that all byte lengths may depend on the operating system.
it_it: Il formato di destinazione è limitato a un formato nativo a singolo elemento nella sintassi del modulo :mod:`struct`. Uno dei formati deve essere un formato byte ('B', 'b' o 'c'). La lunghezza in byte del risultato deve essere uguale alla lunghezza originale. Nota che tutte le lunghezze in byte possono dipendere dal sistema operativo.

source: Cast 1D/long to 1D/unsigned bytes::
it_it: Converte 1D/long in 1D/unsigned bytes::

source: Cast 1D/unsigned bytes to 1D/char::
it_it: Converte 1D/unsigned bytes in 1D/char::

source: Cast 1D/bytes to 3D/ints to 1D/signed char::
it_it: Converte 1D/bytes in 3D/ints in 1D/signed char::

source: Cast 1D/unsigned long to 2D/unsigned long::
it_it: Converte 1D/unsigned long in 2D/unsigned long::

source: The source format is no longer restricted when casting to a byte view.
it_it: Il formato di origine non è più limitato quando si converte in una vista byte.

source: There are also several readonly attributes available:
it_it: Sono disponibili anche diversi attributi di sola lettura:

source: The underlying object of the memoryview::
it_it: L'oggetto sottostante del memoryview::

source: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. This is the amount of space in bytes that the array would use in a contiguous representation. It is not necessarily equal to ``len(m)``::
it_it: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. Questo è lo spazio in byte che l'array utilizzarebbe in una rappresentazione contigua. Non necessariamente uguale a ``len(m)``::

source: Multi-dimensional arrays::
it_it: Array multidimensionali::

source: A bool indicating whether the memory is read only.
it_it: Un bool che indica se la memoria è di sola lettura.

source: A string containing the format (in :mod:`struct` module style) for each element in the view. A memoryview can be created from exporters with arbitrary format strings, but some methods (e.g. :meth:`tolist`) are restricted to native single element formats.
it_it: Una stringa contenente il formato (nello stile del modulo :mod:`struct`) per ogni elemento nella vista. Un memoryview può essere creato da esportatori con stringhe di formato arbitrario, ma alcuni metodi (es.: :meth:`tolist`) sono limitati ai formati a singolo elemento nativi.

source: format ``'B'`` is now handled according to the struct module syntax. This means that ``memoryview(b'abc')[0] == b'abc'[0] == 97``.
it_it: Il formato ``'B'`` viene ora gestito secondo la sintassi del modulo struct. Ciò significa che ``memoryview(b'abc')[0] == b'abc'[0] == 97``.

source: The size in bytes of each element of the memoryview::
it_it: La dimensione in byte di ogni elemento del memoryview::

source: An integer indicating how many dimensions of a multi-dimensional array the memory represents.
it_it: Un intero che indica quante dimensioni di un array multidimensionale la memoria rappresenta.

source: A tuple of integers the length of :attr:`ndim` giving the shape of the memory as an N-dimensional array.
it_it: Una tupla di numeri interi della lunghezza di :attr:`ndim` che indica la forma della memoria come un array N-dimensionale.

source: An empty tuple instead of ``None`` when ndim = 0.
it_it: Una tupla vuota invece di ``None`` quando ndim = 0.

source: A tuple of integers the length of :attr:`ndim` giving the size in bytes to access each element for each dimension of the array.
it_it: Una tupla di numeri interi della lunghezza di :attr:`ndim` che indica la dimensione in byte per accedere a ogni elemento per ciascuna dimensione dell'array.

source: Used internally for PIL-style arrays. The value is informational only.
it_it: Usato internamente per array in stile PIL. Il valore è solo informativo.

source: A bool indicating whether the memory is C-:term:`contiguous`.
it_it: Un bool che indica se la memoria è C-:term:`contiguous`.

source: A bool indicating whether the memory is Fortran :term:`contiguous`.
it_it: Un bool che indica se la memoria è Fortran :term:`contiguous`.

source: A bool indicating whether the memory is :term:`contiguous`.
it_it: Un bool che indica se la memoria è :term:`contiguous`.

source: Set Types --- :class:`set`, :class:`frozenset`
it_it: Tipi di Insiemi --- :class:`set`, :class:`frozenset`

source: A :dfn:`set` object is an unordered collection of distinct :term:`hashable` objects. Common uses include membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference. (For other containers see the built-in :class:`dict`, :class:`list`, and :class:`tuple` classes, and the :mod:`collections` module.)
it_it: Un oggetto :dfn:`set` è una collezione non ordinata di oggetti distinti :term:`hashable`. Usati comunemente per test di appartenenza, rimozione di duplicati da una sequenza e operazioni matematiche come intersezione, unione, differenza e differenza simmetrica. (Per altri contenitori vedi le classi integrate :class:`dict`, :class:`list` e :class:`tuple`, e il modulo :mod:`collections`.)

source: Like other collections, sets support ``x in set``, ``len(set)``, and ``for x in set``. Being an unordered collection, sets do not record element position or order of insertion. Accordingly, sets do not support indexing, slicing, or other sequence-like behavior.
it_it: Come altre collezioni, gli insiemi supportano ``x in set``, ``len(set)`` e ``for x in set``. Essendo una collezione non ordinata, gli insiemi non tengono traccia della posizione degli elementi o dell'ordine di inserimento. Di conseguenza, gli insiemi non supportano indicizzazione, slicing o altro comportamento simile a una sequenza.

source: There are currently two built-in set types, :class:`set` and :class:`frozenset`. The :class:`set` type is mutable --- the contents can be changed using methods like :meth:`~set.add` and :meth:`~set.remove`. Since it is mutable, it has no hash value and cannot be used as either a dictionary key or as an element of another set. The :class:`frozenset` type is immutable and :term:`hashable` --- its contents cannot be altered after it is created; it can therefore be used as a dictionary key or as an element of another set.
it_it: Attualmente esistono due tipi di insiemi incorporati, :class:`set` e :class:`frozenset`. Il tipo :class:`set` è mutabile --- il contenuto può essere cambiato usando metodi come :meth:`~set.add` e :meth:`~set.remove`. Poiché è mutabile, non ha un valore di hash e non può essere utilizzato come chiave di un dizionario o come elemento di un altro insieme. Il tipo :class:`frozenset` è immutabile e :term:`hashable` --- i suoi contenuti non possono essere alterati dopo la sua creazione; può quindi essere utilizzato come chiave di un dizionario o come elemento di un altro insieme.

source: Non-empty sets (not frozensets) can be created by placing a comma-separated list of elements within braces, for example: ``{'jack', 'sjoerd'}``, in addition to the :class:`set` constructor.
it_it: Gli insiemi non vuoti (non i frozenset) possono essere creati mettendo un elenco di elementi separati da virgole tra parentesi graffe, per esempio: ``{'jack', 'sjoerd'}``, oltre al costruttore :class:`set`.

source: The constructors for both classes work the same:
it_it: I costruttori per entrambe le classi funzionano allo stesso modo:

source: Return a new set or frozenset object whose elements are taken from *iterable*. The elements of a set must be :term:`hashable`. To represent sets of sets, the inner sets must be :class:`frozenset` objects. If *iterable* is not specified, a new empty set is returned.
it_it: Restituisce un nuovo oggetto set o frozenset i cui elementi sono presi da *iterable*. Gli elementi di un insieme devono essere :term:`hashable`. Per rappresentare insiemi di insiemi, gli insiemi interni devono essere oggetti :class:`frozenset`. Se *iterable* non è specificato, viene restituito un nuovo insieme vuoto.

source: Sets can be created by several means:
it_it: Gli insiemi possono essere creati in diversi modi:

source: Use a comma-separated list of elements within braces: ``{'jack', 'sjoerd'}``
it_it: Usa un elenco di elementi separati da virgole tra parentesi graffe: ``{'jack', 'sjoerd'}``

source: Use a set comprehension: ``{c for c in 'abracadabra' if c not in 'abc'}``
it_it: Usa una comprensione dell'insieme: ``{c for c in 'abracadabra' if c not in 'abc'}``

source: Use the type constructor: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``
it_it: Usa il costruttore di tipo: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``

source: Instances of :class:`set` and :class:`frozenset` provide the following operations:
it_it: Le istanze di :class:`set` e :class:`frozenset` forniscono le seguenti operazioni:

source: Return the number of elements in set *s* (cardinality of *s*).
it_it: Restituisce il numero di elementi nell'insieme *s* (cardinalità di *s*).

source: Test *x* for membership in *s*.
it_it: Verifica l'appartenenza di *x* in *s*.

source: Test *x* for non-membership in *s*.
it_it: Verifica la non appartenenza di *x* in *s*.

source: Return ``True`` if the set has no elements in common with *other*. Sets are disjoint if and only if their intersection is the empty set.
it_it: Restituisce ``True`` se l'insieme non ha elementi in comune con *other*. Gli insiemi sono disgiunti se e solo se la loro intersezione è l'insieme vuoto.

source: Test whether every element in the set is in *other*.
it_it: Verifica se ogni elemento nell'insieme è in *other*.

source: Test whether the set is a proper subset of *other*, that is, ``set <= other and set != other``.
it_it: Verifica se l'insieme è un sottoinsieme proprio di *other*, cioè, ``set <= other e set != other``.

source: Test whether every element in *other* is in the set.
it_it: Verificare se ogni elemento in *other* è presente nell'insieme.

source: Test whether the set is a proper superset of *other*, that is, ``set >= other and set != other``.
it_it: Verificare se l'insieme è un superinsieme proprio di *other*, cioè ``set >= other and set != other``.

source: Return a new set with elements from the set and all others.
it_it: Restituire un nuovo insieme con elementi dall'insieme e tutti gli altri.

source: Return a new set with elements common to the set and all others.
it_it: Restituire un nuovo insieme con elementi comuni all'insieme e a tutti gli altri.

source: Return a new set with elements in the set that are not in the others.
it_it: Restituire un nuovo insieme con elementi presenti nell'insieme ma non negli altri.

source: Return a new set with elements in either the set or *other* but not both.
it_it: Restituire un nuovo insieme con elementi presenti nell'insieme o in *other* ma non in entrambi.

source: Return a shallow copy of the set.
it_it: Restituire una copia superficiale dell'insieme.

source: Note, the non-operator versions of :meth:`union`, :meth:`intersection`, :meth:`difference`, :meth:`symmetric_difference`, :meth:`issubset`, and :meth:`issuperset` methods will accept any iterable as an argument. In contrast, their operator based counterparts require their arguments to be sets. This precludes error-prone constructions like ``set('abc') & 'cbs'`` in favor of the more readable ``set('abc').intersection('cbs')``.
it_it: Nota, le versioni non operatore dei metodi :meth:`union`, :meth:`intersection`, :meth:`difference`, :meth:`symmetric_difference`, :meth:`issubset` e :meth:`issuperset` accettano qualsiasi iterabile come argomento. Al contrario, le loro controparti basate su operatori richiedono che i loro argomenti siano insiemi. Questo esclude costruzioni inclini all'errore come ``set('abc') & 'cbs'`` a favore di ``set('abc').intersection('cbs')`` più leggibile.
