Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: Using the :func:`tuple` built-in: ``tuple()`` or ``tuple(iterable)``
it_it: Utilizzando la funzione built-in :func:`tuple`: ``tuple()`` o ``tuple(iterable)``

source: The constructor builds a tuple whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a tuple, it is returned unchanged. For example, ``tuple('abc')`` returns ``('a', 'b', 'c')`` and ``tuple( [1, 2, 3] )`` returns ``(1, 2, 3)``. If no argument is given, the constructor creates a new empty tuple, ``()``.
it_it: Il costruttore costruisce una tupla i cui elementi sono gli stessi e nello stesso ordine degli elementi di *iterable*. *iterable* può essere una sequenza, un contenitore che supporta l'iterazione, o un oggetto iteratore. Se *iterable* è già una tupla, viene restituita invariata. Ad esempio, ``tuple('abc')`` restituisce ``('a', 'b', 'c')`` e ``tuple( [1, 2, 3] )`` restituisce ``(1, 2, 3)``. Se non viene fornito alcun argomento, il costruttore crea una nuova tupla vuota, ``()``.

source: Note that it is actually the comma which makes a tuple, not the parentheses. The parentheses are optional, except in the empty tuple case, or when they are needed to avoid syntactic ambiguity. For example, ``f(a, b, c)`` is a function call with three arguments, while ``f((a, b, c))`` is a function call with a 3-tuple as the sole argument.
it_it: Nota che in realtà è la virgola che crea una tupla, non le parentesi. Le parentesi sono facoltative, tranne nel caso della tupla vuota, o quando sono necessarie per evitare ambiguità sintattiche. Ad esempio, ``f(a, b, c)`` è una chiamata a funzione con tre argomenti, mentre ``f((a, b, c))`` è una chiamata a funzione con una 3-tuple come unico argomento.

source: Tuples implement all of the :ref:`common <typesseq-common>` sequence operations.
it_it: Le tuple implementano tutte le operazioni di sequenza comuni: :ref:`common <typesseq-common>`.

source: For heterogeneous collections of data where access by name is clearer than access by index, :func:`collections.namedtuple` may be a more appropriate choice than a simple tuple object.
it_it: Per collezioni eterogenee di dati dove l'accesso per nome è più chiaro che l'accesso per indice, :func:`collections.namedtuple` può essere una scelta più appropriata di un semplice oggetto tupla.

source: Ranges
it_it: Intervalli

source: The :class:`range` type represents an immutable sequence of numbers and is commonly used for looping a specific number of times in :keyword:`for` loops.
it_it: Il tipo :class:`range` rappresenta una sequenza immutabile di numeri ed è comunemente utilizzato per iterare un numero specifico di volte nei cicli :keyword:`for`.

source: The arguments to the range constructor must be integers (either built-in :class:`int` or any object that implements the :meth:`~object.__index__` special method). If the *step* argument is omitted, it defaults to ``1``. If the *start* argument is omitted, it defaults to ``0``. If *step* is zero, :exc:`ValueError` is raised.
it_it: Gli argomenti al costruttore di range devono essere interi (sia la classe built-in :class:`int` o qualsiasi oggetto che implementa il metodo speciale :meth:`~object.__index__`). Se l'argomento *step* è omesso, il valore predefinito è ``1``. Se l'argomento *start* è omesso, il valore predefinito è ``0``. Se *step* è zero, viene sollevata l'eccezione :exc:`ValueError`.

source: For a positive *step*, the contents of a range ``r`` are determined by the formula ``r[i] = start + step*i`` where ``i >= 0`` and ``r[i] < stop``.
it_it: Per un *step* positivo, il contenuto di un intervallo ``r`` è determinato dalla formula ``r[i] = start + step*i`` dove ``i >= 0`` e ``r[i] < stop``.

source: For a negative *step*, the contents of the range are still determined by the formula ``r[i] = start + step*i``, but the constraints are ``i >= 0`` and ``r[i] > stop``.
it_it: Per un *step* negativo, il contenuto dell'intervallo è ancora determinato dalla formula ``r[i] = start + step*i``, ma i vincoli sono ``i >= 0`` e ``r[i] > stop``.

source: A range object will be empty if ``r[0]`` does not meet the value constraint. Ranges do support negative indices, but these are interpreted as indexing from the end of the sequence determined by the positive indices.
it_it: Un oggetto range sarà vuoto se ``r[0]`` non soddisfa il vincolo di valore. Gli intervalli supportano indici negativi, ma questi sono interpretati come indice dalla fine della sequenza determinata dagli indici positivi.

source: Ranges containing absolute values larger than :data:`sys.maxsize` are permitted but some features (such as :func:`len`) may raise :exc:`OverflowError`.
it_it: Gli intervalli contenenti valori assoluti maggiori di :data:`sys.maxsize` sono permessi, ma alcune funzionalità (come :func:`len`) potrebbero sollevare l'eccezione :exc:`OverflowError`.

source: Range examples::
it_it: Esempi di intervalli::

source: Ranges implement all of the :ref:`common <typesseq-common>` sequence operations except concatenation and repetition (due to the fact that range objects can only represent sequences that follow a strict pattern and repetition and concatenation will usually violate that pattern).
it_it: Gli intervalli implementano tutte le operazioni di sequenza comuni: :ref:`common <typesseq-common>`, eccezion fatta per la concatenazione e la ripetizione (a causa del fatto che gli oggetti range possono rappresentare solo sequenze che seguono un modello rigoroso e la ripetizione e la concatenazione violerebbero di solito tale modello).

source: The value of the *start* parameter (or ``0`` if the parameter was not supplied)
it_it: Il valore del parametro *start* (o ``0`` se il parametro non è stato fornito)

source: The value of the *stop* parameter
it_it: Il valore del parametro *stop*

source: The value of the *step* parameter (or ``1`` if the parameter was not supplied)
it_it: Il valore del parametro *step* (o ``1`` se il parametro non è stato fornito)

source: The advantage of the :class:`range` type over a regular :class:`list` or :class:`tuple` is that a :class:`range` object will always take the same (small) amount of memory, no matter the size of the range it represents (as it only stores the ``start``, ``stop`` and ``step`` values, calculating individual items and subranges as needed).
it_it: Il vantaggio del tipo :class:`range` rispetto a una lista regolare :class:`list` o una tupla :class:`tuple` è che un oggetto :class:`range` utilizzerà sempre la stessa (piccola) quantità di memoria, indipendentemente dalla dimensione dell'intervallo che rappresenta (poiché memorizza solo i valori ``start``, ``stop`` e ``step``, calcolando gli elementi individuali e i sottointervalli secondo necessità).

source: Range objects implement the :class:`collections.abc.Sequence` ABC, and provide features such as containment tests, element index lookup, slicing and support for negative indices (see :ref:`typesseq`):
it_it: Gli oggetti range implementano l'ABC :class:`collections.abc.Sequence`, e forniscono funzionalità come test di inclusione, ricerca dell'indice degli elementi, slicing e supporto per indici negativi (vedi :ref:`typesseq`):

source: Testing range objects for equality with ``==`` and ``!=`` compares them as sequences. That is, two range objects are considered equal if they represent the same sequence of values. (Note that two range objects that compare equal might have different :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes, for example ``range(0) == range(2, 1, 3)`` or ``range(0, 3, 2) == range(0, 4, 2)``.)
it_it: Testare gli oggetti range per uguaglianza con ``==`` e ``!=`` li confronta come sequenze. Cioè, due oggetti range sono considerati uguali se rappresentano la stessa sequenza di valori. (Nota che due oggetti range che risultano uguali potrebbero avere attributi :attr:`~range.start`, :attr:`~range.stop` e :attr:`~range.step` diversi, ad esempio ``range(0) == range(2, 1, 3)`` oppure ``range(0, 3, 2) == range(0, 4, 2)``.)

source: Implement the Sequence ABC. Support slicing and negative indices. Test :class:`int` objects for membership in constant time instead of iterating through all items.
it_it: Implementare l'ABC Sequence. Supporto per slicing e indici negativi. Testare gli oggetti :class:`int` per la membership in tempo costante invece di iterare attraverso tutti gli elementi.

source: Define '==' and '!=' to compare range objects based on the sequence of values they define (instead of comparing based on object identity).
it_it: Definire '==' e '!=' per confrontare gli oggetti range basandosi sulla sequenza di valori che definiscono (invece di confrontare basandosi sull'identità degli oggetti).

source: Added the :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes.
it_it: Aggiunti gli attributi :attr:`~range.start`, :attr:`~range.stop` e :attr:`~range.step`.

source: The `linspace recipe <https://code.activestate.com/recipes/579000-equally-spaced-numbers-linspace/>`_ shows how to implement a lazy version of range suitable for floating point applications.
it_it: La `ricetta linspace <https://code.activestate.com/recipes/579000-equally-spaced-numbers-linspace/>`_ mostra come implementare una versione lazy di range adatta per applicazioni con numeri in virgola mobile.

source: Text Sequence Type --- :class:`str`
it_it: Tipo Sequenza di Testo --- :class:`str`

source: Textual data in Python is handled with :class:`str` objects, or :dfn:`strings`. Strings are immutable :ref:`sequences <typesseq>` of Unicode code points. String literals are written in a variety of ways:
it_it: I dati testuali in Python sono gestiti con oggetti :class:`str`, o :dfn:`string`. Le stringhe sono :ref:`sequenze <typesseq>` immutabili di punti di codice Unicode. I letterali stringa possono essere scritti in vari modi:

source: Single quotes: ``'allows embedded "double" quotes'``
it_it: Apici singoli: ``'allows embedded "double" quotes'``

source: Double quotes: ``"allows embedded 'single' quotes"``
it_it: Apici doppi: ``"allows embedded 'single' quotes"``

source: Triple quoted: ``'''Three single quotes'''``, ``"""Three double quotes"""``
it_it: Apici tripli: ``'''Three single quotes'''``, ``"""Three double quotes"""``

source: Triple quoted strings may span multiple lines - all associated whitespace will be included in the string literal.
it_it: Le stringhe con tripla virgoletta possono estendersi su più righe - tutti gli spazi bianchi associati saranno inclusi nel letterale della stringa.

source: String literals that are part of a single expression and have only whitespace between them will be implicitly converted to a single string literal. That is, ``("spam " "eggs") == "spam eggs"``.
it_it: I letterali di stringa che fanno parte di una singola espressione e contengono solo spazi bianchi tra di loro saranno convertiti implicitamente in un singolo letterale di stringa. Cioè, ``("spam " "eggs") == "spam eggs"``.

source: See :ref:`strings` for more about the various forms of string literal, including supported :ref:`escape sequences <escape-sequences>`, and the ``r`` ("raw") prefix that disables most escape sequence processing.
it_it: Vedi :ref:`strings` per ulteriori dettagli sulle varie forme di letterali di stringa, comprese le :ref:`sequenze di escape <escape-sequences>` supportate, e il prefisso ``r`` ("raw") che disabilita la maggior parte delle elaborazioni delle sequenze di escape.

source: Strings may also be created from other objects using the :class:`str` constructor.
it_it: Le stringhe possono anche essere create da altri oggetti utilizzando il costruttore :class:`str`.

source: Since there is no separate "character" type, indexing a string produces strings of length 1. That is, for a non-empty string *s*, ``s[0] == s[0:1]``.
it_it: Poiché non esiste un tipo "carattere" separato, l'indicizzazione di una stringa produce stringhe di lunghezza 1. Cioè, per una stringa non vuota *s*, ``s[0] == s[0:1]``.

source: There is also no mutable string type, but :meth:`str.join` or :class:`io.StringIO` can be used to efficiently construct strings from multiple fragments.
it_it: Inoltre, non esiste un tipo di stringa mutabile, ma :meth:`str.join` o :class:`io.StringIO` possono essere usati per costruire efficientemente stringhe da più frammenti.

source: For backwards compatibility with the Python 2 series, the ``u`` prefix is once again permitted on string literals. It has no effect on the meaning of string literals and cannot be combined with the ``r`` prefix.
it_it: Per retrocompatibilità con la serie Python 2, il prefisso ``u`` è nuovamente permesso sui letterali di stringa. Non ha effetto sul significato dei letterali di stringa e non può essere combinato con il prefisso ``r``.

source: Return a :ref:`string <textseq>` version of *object*. If *object* is not provided, returns the empty string. Otherwise, the behavior of ``str()`` depends on whether *encoding* or *errors* is given, as follows.
it_it: Restituisce una versione :ref:`stringa <textseq>` di *object*. Se *object* non viene fornito, restituisce la stringa vuota. Altrimenti, il comportamento di ``str()`` dipende dalla presenza di *encoding* o *errors*, come segue.

source: If neither *encoding* nor *errors* is given, ``str(object)`` returns :meth:`type(object).__str__(object) <object.__str__>`, which is the "informal" or nicely printable string representation of *object*. For string objects, this is the string itself. If *object* does not have a :meth:`~object.__str__` method, then :func:`str` falls back to returning :func:`repr(object) <repr>`.
it_it: Se né *encoding* né *errors* vengono forniti, ``str(object)`` restituisce :meth:`type(object).__str__(object) <object.__str__>` che è la rappresentazione "informale" o ben stampabile di *object*. Per gli oggetti stringa, questa è la stringa stessa. Se *object* non ha un metodo :meth:`~object.__str__`, allora :func:`str` ricorre alla restituzione di :func:`repr(object) <repr>`.

source: If at least one of *encoding* or *errors* is given, *object* should be a :term:`bytes-like object` (e.g. :class:`bytes` or :class:`bytearray`). In this case, if *object* is a :class:`bytes` (or :class:`bytearray`) object, then ``str(bytes, encoding, errors)`` is equivalent to :meth:`bytes.decode(encoding, errors) <bytes.decode>`. Otherwise, the bytes object underlying the buffer object is obtained before calling :meth:`bytes.decode`. See :ref:`binaryseq` and :ref:`bufferobjects` for information on buffer objects.
it_it: Se viene fornito almeno uno tra *encoding* o *errors*, *object* dovrebbe essere un :term:`bytes-like object` (ad es. :class:`bytes` o :class:`bytearray`). In questo caso, se *object* è un oggetto :class:`bytes` (o :class:`bytearray`), allora ``str(bytes, encoding, errors)`` è equivalente a :meth:`bytes.decode(encoding, errors) <bytes.decode>`. Altrimenti, l'oggetto bytes sottostante l'oggetto buffer viene ottenuto prima di chiamare :meth:`bytes.decode`. Vedi :ref:`binaryseq` e :ref:`bufferobjects` per informazioni sugli oggetti buffer.

source: Passing a :class:`bytes` object to :func:`str` without the *encoding* or *errors* arguments falls under the first case of returning the informal string representation (see also the :option:`-b` command-line option to Python). For example::
it_it: Passare un oggetto :class:`bytes` a :func:`str` senza argomenti *encoding* o *errors* rientra nel primo caso che restituisce la rappresentazione informale della stringa (vedi anche l'opzione della riga di comando :option:`-b` di Python). Per esempio::

source: For more information on the ``str`` class and its methods, see :ref:`textseq` and the :ref:`string-methods` section below. To output formatted strings, see the :ref:`f-strings` and :ref:`formatstrings` sections. In addition, see the :ref:`stringservices` section.
it_it: Per maggiori informazioni sulla classe ``str`` e i suoi metodi, vedere :ref:`textseq` e la sezione :ref:`string-methods` qui sotto. Per generare stringhe formattate, vedere le sezioni :ref:`f-strings` e :ref:`formatstrings`. Inoltre, vedere la sezione :ref:`stringservices`.

source: String Methods
it_it: Metodi per le Stringhe

source: Strings implement all of the :ref:`common <typesseq-common>` sequence operations, along with the additional methods described below.
it_it: Le stringhe implementano tutte le operazioni delle sequenze :ref:`comuni <typesseq-common>`, insieme ai metodi aggiuntivi descritti di seguito.

source: Strings also support two styles of string formatting, one providing a large degree of flexibility and customization (see :meth:`str.format`, :ref:`formatstrings` and :ref:`string-formatting`) and the other based on C ``printf`` style formatting that handles a narrower range of types and is slightly harder to use correctly, but is often faster for the cases it can handle (:ref:`old-string-formatting`).
it_it: Le stringhe supportano anche due stili di formattazione delle stringhe, uno che fornisce un alto grado di flessibilità e personalizzazione (vedi :meth:`str.format`, :ref:`formatstrings` e :ref:`string-formatting`) e l'altro basato sulla formattazione in stile C ``printf`` che gestisce una gamma più ristretta di tipi ed è leggermente più difficile da usare correttamente, ma è spesso più veloce nei casi che può gestire (:ref:`old-string-formatting`).

source: The :ref:`textservices` section of the standard library covers a number of other modules that provide various text related utilities (including regular expression support in the :mod:`re` module).
it_it: La sezione :ref:`textservices` della libreria standard copre un certo numero di altri moduli che forniscono vari utilità relative al testo (incluso il supporto per le espressioni regolari nel modulo :mod:`re`).

source: Return a copy of the string with its first character capitalized and the rest lowercased.
it_it: Restituisce una copia della stringa con il primo carattere in maiuscolo e il resto in minuscolo.

source: The first character is now put into titlecase rather than uppercase. This means that characters like digraphs will only have their first letter capitalized, instead of the full character.
it_it: Il primo carattere è ora convertito in titlecase piuttosto che in maiuscolo. Questo significa che caratteri come i digrammi avranno solo la prima lettera maiuscola, invece del carattere completo.

source: Return a casefolded copy of the string. Casefolded strings may be used for caseless matching.
it_it: Restituisce una copia della stringa normalizzata in minuscolo. Le stringhe normalizzate in minuscolo possono essere utilizzate per confronti senza distinzione tra maiuscole e minuscole.

source: Casefolding is similar to lowercasing but more aggressive because it is intended to remove all case distinctions in a string. For example, the German lowercase letter ``'ß'`` is equivalent to ``"ss"``. Since it is already lowercase, :meth:`lower` would do nothing to ``'ß'``; :meth:`casefold` converts it to ``"ss"``.
it_it: La normalizzazione in minuscolo è simile alla conversione in minuscolo ma più aggressiva perché è pensata per rimuovere tutte le differenze di maiuscolo e minuscolo in una stringa. Ad esempio, la lettera tedesca minuscola ``'ß'`` è equivalente a ``"ss"``. Poiché è già minuscola, :meth:`lower` non farebbe nulla per ``'ß'``; :meth:`casefold` la converte in ``"ss"``.

source: Return centered in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
it_it: Restituisce la stringa centrata in una lunghezza di *width*. L'imbottitura è fatta usando il *fillchar* specificato (il default è uno spazio ASCII). La stringa originale viene restituita se *width* è minore o uguale a ``len(s)``.

source: Return the number of non-overlapping occurrences of substring *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
it_it: Restituisce il numero di occorrenze non sovrapposte della sottostringa *sub* nell'intervallo [*start*, *end*]. Gli argomenti opzionali *start* e *end* sono interpretati come nella notazione delle slice.

source: If *sub* is empty, returns the number of empty strings between characters which is the length of the string plus one.
it_it: Se *sub* è vuoto, restituisce il numero di stringhe vuote tra i caratteri, che è la lunghezza della stringa più uno.

source: Return the string encoded to :class:`bytes`.
it_it: Restituisce la stringa codificata in :class:`bytes`.

source: *encoding* defaults to ``'utf-8'``; see :ref:`standard-encodings` for possible values.
it_it: *encoding* di default è ``'utf-8'``; vedere :ref:`standard-encodings` per i valori possibili.

source: *errors* controls how encoding errors are handled. If ``'strict'`` (the default), a :exc:`UnicodeError` exception is raised. Other possible values are ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` and any other name registered via :func:`codecs.register_error`. See :ref:`error-handlers` for details.
it_it: *errors* controlla come vengono gestiti gli errori di codifica. Se ``'strict'`` (il default), viene sollevata un'eccezione :exc:`UnicodeError`. Altri valori possibili sono ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` e qualsiasi altro nome registrato tramite :func:`codecs.register_error`. Vedi :ref:`error-handlers` per dettagli.

source: For performance reasons, the value of *errors* is not checked for validity unless an encoding error actually occurs, :ref:`devmode` is enabled or a :ref:`debug build <debug-build>` is used.
it_it: Per motivi di prestazioni, il valore di *errors* non viene controllato per validità a meno che non si verifichi effettivamente un errore di codifica, :ref:`devmode` è abilitato o viene utilizzata una :ref:`build di debug <debug-build>`.

source: Added support for keyword arguments.
it_it: Aggiunto supporto per argomenti di tipo keyword.

source: The value of the *errors* argument is now checked in :ref:`devmode` and in :ref:`debug mode <debug-build>`.
it_it: Il valore dell'argomento *errors* ora viene controllato in :ref:`devmode` e in :ref:`modalità di debug <debug-build>`.

source: Return ``True`` if the string ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
it_it: Restituisce ``True`` se la stringa termina con il *suffix* specificato, altrimenti restituisce ``False``. *suffix* può anche essere una tupla di suffixes da cercare. Con *start* opzionale, il test inizia dalla posizione specificata. Con *end* opzionale, si interrompe il confronto in quella posizione.
