Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: slice of *s* from *i* to *j* with step *k*
it_it: fetta di *s* da *i* a *j* con passo *k*

source: length of *s*
it_it: lunghezza di *s*

source: smallest item of *s*
it_it: l'elemento più piccolo di *s*

source: largest item of *s*
it_it: l'elemento più grande di *s*

source: index of the first occurrence of *x* in *s* (at or after index *i* and before index *j*)
it_it: indice della prima occorrenza di *x* in *s* (a partire dall'indice *i* e prima dell'indice *j*)

source: total number of occurrences of *x* in *s*
it_it: numero totale delle occorrenze di *x* in *s*

source: Sequences of the same type also support comparisons. In particular, tuples and lists are compared lexicographically by comparing corresponding elements. This means that to compare equal, every element must compare equal and the two sequences must be of the same type and have the same length. (For full details see :ref:`comparisons` in the language reference.)
it_it: Sequenze dello stesso tipo supportano anche confronti. In particolare, tuple e liste sono confrontate lessicograficamente confrontando gli elementi corrispondenti. Questo significa che per risultare uguali, ogni elemento deve risultare uguale e le due sequenze devono essere dello stesso tipo e avere la stessa lunghezza. (Per i dettagli completi, vedere :ref:`comparisons` nella documentazione del linguaggio.)

source: Forward and reversed iterators over mutable sequences access values using an index. That index will continue to march forward (or backward) even if the underlying sequence is mutated. The iterator terminates only when an :exc:`IndexError` or a :exc:`StopIteration` is encountered (or when the index drops below zero).
it_it: Gli iteratori avanti e indietro su sequenze mutabili accedono ai valori usando un indice. Questo indice continuerà ad avanzare (o retrocedere) anche se la sequenza sottostante viene mutata. L'iteratore termina solo quando viene trovata un'eccezione :exc:`IndexError` o :exc:`StopIteration` (o quando l'indice scende sotto zero).

source: While the ``in`` and ``not in`` operations are used only for simple containment testing in the general case, some specialised sequences (such as :class:`str`, :class:`bytes` and :class:`bytearray`) also use them for subsequence testing::
it_it: Anche se le operazioni ``in`` e ``not in`` sono usate solo per testare la semplice appartenenza nel caso generale, alcune sequenze specializzate (come :class:`str`, :class:`bytes` e :class:`bytearray`) le usano anche per il test di sotto-sequenza::

source: Values of *n* less than ``0`` are treated as ``0`` (which yields an empty sequence of the same type as *s*). Note that items in the sequence *s* are not copied; they are referenced multiple times. This often haunts new Python programmers; consider::
it_it: I valori di *n* inferiori a ``0`` sono trattati come ``0`` (il che produce una sequenza vuota dello stesso tipo di *s*). Nota che gli elementi nella sequenza *s* non vengono copiati; sono referenziati più volte. Questo spesso confonde i nuovi programmatori Python; considera::

source: What has happened is that ``[[]]`` is a one-element list containing an empty list, so all three elements of ``[[]] * 3`` are references to this single empty list. Modifying any of the elements of ``lists`` modifies this single list. You can create a list of different lists this way::
it_it: Quello che è successo è che ``[[]]`` è una lista a un solo elemento contenente una lista vuota, quindi tutti e tre gli elementi di ``[[]] * 3`` sono riferimenti a questa singola lista vuota. Modificare uno qualsiasi degli elementi di ``lists`` modifica questa singola lista. Puoi creare una lista di liste diverse in questo modo::

source: Further explanation is available in the FAQ entry :ref:`faq-multidimensional-list`.
it_it: Ulteriori spiegazioni sono disponibili nella voce delle FAQ :ref:`faq-multidimensional-list`.

source: If *i* or *j* is negative, the index is relative to the end of sequence *s*: ``len(s) + i`` or ``len(s) + j`` is substituted. But note that ``-0`` is still ``0``.
it_it: Se *i* o *j* è negativo, l'indice è relativo alla fine della sequenza *s*: viene sostituito da ``len(s) + i`` o ``len(s) + j``. Ma nota che ``-0`` è ancora ``0``.

source: The slice of *s* from *i* to *j* is defined as the sequence of items with index *k* such that ``i <= k < j``. If *i* or *j* is greater than ``len(s)``, use ``len(s)``. If *i* is omitted or ``None``, use ``0``. If *j* is omitted or ``None``, use ``len(s)``. If *i* is greater than or equal to *j*, the slice is empty.
it_it: La fetta di *s* da *i* a *j* è definita come la sequenza degli elementi con indice *k* tale che ``i <= k < j``. Se *i* o *j* è maggiore di ``len(s)``, viene usato ``len(s)``. Se *i* è omesso o ``None``, viene usato ``0``. Se *j* è omesso o ``None``, viene usato ``len(s)``. Se *i* è maggiore o uguale a *j*, la fetta è vuota.

source: The slice of *s* from *i* to *j* with step *k* is defined as the sequence of items with index ``x = i + n*k`` such that ``0 <= n < (j-i)/k``. In other words, the indices are ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` and so on, stopping when *j* is reached (but never including *j*). When *k* is positive, *i* and *j* are reduced to ``len(s)`` if they are greater. When *k* is negative, *i* and *j* are reduced to ``len(s) - 1`` if they are greater. If *i* or *j* are omitted or ``None``, they become "end" values (which end depends on the sign of *k*). Note, *k* cannot be zero. If *k* is ``None``, it is treated like ``1``.
it_it: La fetta di *s* da *i* a *j* con passo *k* è definita come la sequenza degli elementi con indice ``x = i + n*k`` tale che ``0 <= n < (j-i)/k``. In altre parole, gli indici sono ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` e così via, fermandosi quando si raggiunge *j* (ma senza includere *j*). Quando *k* è positivo, *i* e *j* sono ridotti a ``len(s)`` se sono maggiori. Quando *k* è negativo, *i* e *j* sono ridotti a ``len(s) - 1`` se sono maggiori. Se *i* o *j* sono omessi o ``None``, diventano valori "finali" (quale finale dipende dal segno di *k*). Nota, *k* non può essere zero. Se *k* è ``None``, viene trattato come ``1``.

source: Concatenating immutable sequences always results in a new object. This means that building up a sequence by repeated concatenation will have a quadratic runtime cost in the total sequence length. To get a linear runtime cost, you must switch to one of the alternatives below:
it_it: La concatenazione di sequenze immutabili produce sempre un nuovo oggetto. Questo significa che costruire una sequenza concatenando ripetutamente avrà un costo di runtime quadratico in relazione alla lunghezza totale della sequenza. Per ottenere un costo di runtime lineare, è necessario passare a una delle alternative seguenti:

source: if concatenating :class:`str` objects, you can build a list and use :meth:`str.join` at the end or else write to an :class:`io.StringIO` instance and retrieve its value when complete
it_it: se stai concatenando oggetti :class:`str`, puoi costruire una lista e usare :meth:`str.join` alla fine oppure scrivere a un'istanza di :class:`io.StringIO` e recuperare il suo valore al termine

source: if concatenating :class:`bytes` objects, you can similarly use :meth:`bytes.join` or :class:`io.BytesIO`, or you can do in-place concatenation with a :class:`bytearray` object. :class:`bytearray` objects are mutable and have an efficient overallocation mechanism
it_it: se stai concatenando oggetti :class:`bytes`, puoi allo stesso modo usare :meth:`bytes.join` o :class:`io.BytesIO`, oppure puoi fare una concatenazione in loco con un oggetto :class:`bytearray`. Gli oggetti :class:`bytearray` sono mutabili e hanno un meccanismo di sovra-allocazione efficiente

source: if concatenating :class:`tuple` objects, extend a :class:`list` instead
it_it: se concatenare oggetti :class:`tuple`, estendere una :class:`list` invece

source: for other types, investigate the relevant class documentation
it_it: per altri tipi, consultare la documentazione della classe pertinente

source: Some sequence types (such as :class:`range`) only support item sequences that follow specific patterns, and hence don't support sequence concatenation or repetition.
it_it: Alcuni tipi di sequenze (come :class:`range`) supportano solo sequenze di elementi che seguono schemi specifici, e quindi non supportano la concatenazione o la ripetizione della sequenza.

source: ``index`` raises :exc:`ValueError` when *x* is not found in *s*. Not all implementations support passing the additional arguments *i* and *j*. These arguments allow efficient searching of subsections of the sequence. Passing the extra arguments is roughly equivalent to using ``s[i:j].index(x)``, only without copying any data and with the returned index being relative to the start of the sequence rather than the start of the slice.
it_it: ``index`` solleva :exc:`ValueError` quando *x* non è trovato in *s*. Non tutte le implementazioni supportano il passaggio degli argomenti aggiuntivi *i* e *j*. Questi argomenti permettono una ricerca efficiente di sottosezioni della sequenza. Passare gli argomenti extra è grosso modo equivalente a usare ``s[i:j].index(x)``, solo senza copiare alcun dato e con l'indice restituito relativo all'inizio della sequenza piuttosto che all'inizio del sottoinsieme.

source: Immutable Sequence Types
it_it: Tipi di Sequenza Immutabili

source: The only operation that immutable sequence types generally implement that is not also implemented by mutable sequence types is support for the :func:`hash` built-in.
it_it: L'unica operazione che i tipi di sequenza immutabili generalmente implementano che non è implementata anche dai tipi di sequenza mutabili è il supporto per la funzione built-in :func:`hash`.

source: This support allows immutable sequences, such as :class:`tuple` instances, to be used as :class:`dict` keys and stored in :class:`set` and :class:`frozenset` instances.
it_it: Questo supporto consente alle sequenze immutabili, come le istanze di :class:`tuple`, di essere utilizzate come chiavi di :class:`dict` e memorizzate in istanze di :class:`set` e :class:`frozenset`.

source: Attempting to hash an immutable sequence that contains unhashable values will result in :exc:`TypeError`.
it_it: Tentare di fare l'hash di una sequenza immutabile che contiene valori non hashabili risulterà in un :exc:`TypeError`.

source: Mutable Sequence Types
it_it: Tipi di Sequenza Mutabili

source: The operations in the following table are defined on mutable sequence types. The :class:`collections.abc.MutableSequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
it_it: Le operazioni nella tabella seguente sono definite sui tipi di sequenza mutabili. L'ABC :class:`collections.abc.MutableSequence` è fornito per rendere più facile implementare correttamente queste operazioni su tipi di sequenza personalizzati.

source: In the table *s* is an instance of a mutable sequence type, *t* is any iterable object and *x* is an arbitrary object that meets any type and value restrictions imposed by *s* (for example, :class:`bytearray` only accepts integers that meet the value restriction ``0 <= x <= 255``).
it_it: Nella tabella, *s* è un'istanza di un tipo di sequenza mutabile, *t* è un qualsiasi oggetto iterabile e *x* è un oggetto arbitrario che soddisfa qualsiasi restrizione di tipo e valore imposta da *s* (ad esempio, :class:`bytearray` accetta solo interi che soddisfano la restrizione di valore ``0 <= x <= 255``).

source: item *i* of *s* is replaced by *x*
it_it: l'elemento *i* di *s* è sostituito da *x*

source: slice of *s* from *i* to *j* is replaced by the contents of the iterable *t*
it_it: il sottoinsieme di *s* da *i* a *j* è sostituito dal contenuto dell'iterabile *t*

source: same as ``s[i:j] = []``
it_it: come ``s[i:j] = []``

source: the elements of ``s[i:j:k]`` are replaced by those of *t*
it_it: gli elementi di ``s[i:j:k]`` sono sostituiti da quelli di *t*

source: removes the elements of ``s[i:j:k]`` from the list
it_it: rimuove gli elementi di ``s[i:j:k]`` dalla lista

source: appends *x* to the end of the sequence (same as ``s[len(s):len(s)] = [x]``)
it_it: aggiunge *x* alla fine della sequenza (come ``s[len(s):len(s)] = [x]``)

source: removes all items from *s* (same as ``del s[:]``)
it_it: rimuove tutti gli elementi da *s* (come ``del s[:]``)

source: creates a shallow copy of *s* (same as ``s[:]``)
it_it: crea una copia superficiale di *s* (come ``s[:]``)

source: ``s.extend(t)`` or ``s += t``
it_it: ``s.extend(t)`` o ``s += t``

source: extends *s* with the contents of *t* (for the most part the same as ``s[len(s):len(s)] = t``)
it_it: estende *s* con il contenuto di *t* (per lo più come ``s[len(s):len(s)] = t``)

source: updates *s* with its contents repeated *n* times
it_it: aggiorna *s* con il suo contenuto ripetuto *n* volte

source: inserts *x* into *s* at the index given by *i* (same as ``s[i:i] = [x]``)
it_it: inserisce *x* in *s* all'indice dato da *i* (come ``s[i:i] = [x]``)

source: ``s.pop()`` or ``s.pop(i)``
it_it: ``s.pop()`` o ``s.pop(i)``

source: retrieves the item at *i* and also removes it from *s*
it_it: recupera l'elemento a *i* e lo rimuove anche da *s*

source: remove the first item from *s* where ``s[i]`` is equal to *x*
it_it: rimuove il primo elemento da *s* dove ``s[i]`` è uguale a *x*

source: reverses the items of *s* in place
it_it: inverte gli elementi di *s* in loco

source: *t* must have the same length as the slice it is replacing.
it_it: *t* deve avere la stessa lunghezza del sottoinsieme che sta sostituendo.

source: The optional argument *i* defaults to ``-1``, so that by default the last item is removed and returned.
it_it: L'argomento opzionale *i* di default è ``-1``, in modo che per default l'ultimo elemento sia rimosso e restituito.

source: :meth:`remove` raises :exc:`ValueError` when *x* is not found in *s*.
it_it: :meth:`remove` solleva :exc:`ValueError` quando *x* non è trovato in *s*.

source: The :meth:`reverse` method modifies the sequence in place for economy of space when reversing a large sequence. To remind users that it operates by side effect, it does not return the reversed sequence.
it_it: Il metodo :meth:`reverse` modifica la sequenza in loco per economia di spazio quando si inverte una grande sequenza. Per ricordare agli utenti che opera tramite effetti collaterali, non restituisce la sequenza invertita.

source: :meth:`clear` and :meth:`!copy` are included for consistency with the interfaces of mutable containers that don't support slicing operations (such as :class:`dict` and :class:`set`). :meth:`!copy` is not part of the :class:`collections.abc.MutableSequence` ABC, but most concrete mutable sequence classes provide it.
it_it: :meth:`clear` e :meth:`!copy` sono inclusi per coerenza con le interfacce dei contenitori mutabili che non supportano le operazioni di slicing (come :class:`dict` e :class:`set`). :meth:`!copy` non fa parte dell'ABC :class:`collections.abc.MutableSequence`, ma la maggior parte delle classi di sequenze mutabili concrete lo forniscono.

source: :meth:`clear` and :meth:`!copy` methods.
it_it: Metodi :meth:`clear` e :meth:`!copy`.

source: The value *n* is an integer, or an object implementing :meth:`~object.__index__`. Zero and negative values of *n* clear the sequence. Items in the sequence are not copied; they are referenced multiple times, as explained for ``s * n`` under :ref:`typesseq-common`.
it_it: Il valore *n* è un intero, o un oggetto che implementa :meth:`~object.__index__`. Valori zero e negativi di *n* svuotano la sequenza. Gli elementi nella sequenza non sono copiati; sono referenziati più volte, come spiegato per ``s * n`` sotto :ref:`typesseq-common`.

source: Lists
it_it: Liste

source: Lists are mutable sequences, typically used to store collections of homogeneous items (where the precise degree of similarity will vary by application).
it_it: Le liste sono sequenze mutabili, tipicamente utilizzate per memorizzare collezioni di elementi omogenei (dove il grado di somiglianza preciso varia in base all'applicazione).

source: Lists may be constructed in several ways:
it_it: Le liste possono essere costruite in diversi modi:

source: Using a pair of square brackets to denote the empty list: ``[]``
it_it: Usare una coppia di parentesi quadre per denotare la lista vuota: ``[]``

source: Using square brackets, separating items with commas: ``[a]``, ``[a, b, c]``
it_it: Utilizzo delle parentesi quadre, separando gli elementi con virgole: ``[a]``, ``[a, b, c]``

source: Using a list comprehension: ``[x for x in iterable]``
it_it: Utilizzo di una lista comprensiva: ``[x for x in iterable]``

source: Using the type constructor: ``list()`` or ``list(iterable)``
it_it: Utilizzo del costruttore del tipo: ``list()`` o ``list(iterable)``

source: The constructor builds a list whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a list, a copy is made and returned, similar to ``iterable[:]``. For example, ``list('abc')`` returns ``['a', 'b', 'c']`` and ``list( (1, 2, 3) )`` returns ``[1, 2, 3]``. If no argument is given, the constructor creates a new empty list, ``[]``.
it_it: Il costruttore costruisce una lista i cui elementi sono gli stessi e nello stesso ordine degli elementi di *iterable*. *iterable* può essere una sequenza, un contenitore che supporta l'iterazione, o un oggetto iteratore. Se *iterable* è già una lista, viene fatta una copia e restituita, simile a ``iterable[:]``. Ad esempio, ``list('abc')`` restituisce ``['a', 'b', 'c']`` e ``list( (1, 2, 3) )`` restituisce ``[1, 2, 3]``. Se non viene fornito alcun argomento, il costruttore crea una nuova lista vuota, ``[]``.

source: Many other operations also produce lists, including the :func:`sorted` built-in.
it_it: Molte altre operazioni producono anche liste, includendo la funzione built-in :func:`sorted`.

source: Lists implement all of the :ref:`common <typesseq-common>` and :ref:`mutable <typesseq-mutable>` sequence operations. Lists also provide the following additional method:
it_it: Le liste implementano tutte le operazioni comuni di sequenza: :ref:`common <typesseq-common>` e modificabili: :ref:`mutable <typesseq-mutable>`. Le liste forniscono anche il seguente metodo aggiuntivo:

source: This method sorts the list in place, using only ``<`` comparisons between items. Exceptions are not suppressed - if any comparison operations fail, the entire sort operation will fail (and the list will likely be left in a partially modified state).
it_it: Questo metodo ordina la lista sul posto, utilizzando solo i confronti ``<`` tra gli elementi. Le eccezioni non vengono soppresse - se una qualsiasi operazione di confronto fallisce, l'intera operazione di ordinamento fallirà (e la lista sarà probabilmente lasciata in uno stato parzialmente modificato).

source: :meth:`sort` accepts two arguments that can only be passed by keyword (:ref:`keyword-only arguments <keyword-only_parameter>`):
it_it: :meth:`sort` accetta due argomenti che possono essere passati solo tramite parola chiave (:ref:`keyword-only arguments <keyword-only_parameter>`):

source: *key* specifies a function of one argument that is used to extract a comparison key from each list element (for example, ``key=str.lower``). The key corresponding to each item in the list is calculated once and then used for the entire sorting process. The default value of ``None`` means that list items are sorted directly without calculating a separate key value.
it_it: *key* specifica una funzione di un argomento che viene utilizzata per estrarre una chiave di confronto da ciascun elemento della lista (ad esempio, ``key=str.lower``). La chiave corrispondente a ciascun elemento nella lista viene calcolata una volta e poi utilizzata per l'intero processo di ordinamento. Il valore predefinito di ``None`` significa che gli elementi della lista vengono ordinati direttamente senza calcolare un valore di chiave separato.

source: The :func:`functools.cmp_to_key` utility is available to convert a 2.x style *cmp* function to a *key* function.
it_it: L'utilità :func:`functools.cmp_to_key` è disponibile per convertire una funzione *cmp* in stile 2.x in una funzione *key*.

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
it_it: *reverse* è un valore booleano. Se impostato su ``True``, gli elementi della lista vengono ordinati come se ogni confronto fosse invertito.

source: This method modifies the sequence in place for economy of space when sorting a large sequence. To remind users that it operates by side effect, it does not return the sorted sequence (use :func:`sorted` to explicitly request a new sorted list instance).
it_it: Questo metodo modifica la sequenza in loco per risparmiare spazio quando si ordina una grande sequenza. Per ricordare agli utenti che funziona con effetti collaterali, non restituisce la sequenza ordinata (utilizzare :func:`sorted` per richiedere esplicitamente una nuova istanza di lista ordinata).

source: The :meth:`sort` method is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
it_it: Il metodo :meth:`sort` è garantito per essere stabile. Un ordinamento è stabile se garantisce di non cambiare l'ordine relativo degli elementi che risultano uguali --- questo è utile per l'ordinamento in più passate (ad esempio, ordinare per reparto, poi per grado salariale).

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
it_it: Per esempi di ordinamento e un breve tutorial sull'ordinamento, vedere :ref:`sortinghowto`.

source: While a list is being sorted, the effect of attempting to mutate, or even inspect, the list is undefined. The C implementation of Python makes the list appear empty for the duration, and raises :exc:`ValueError` if it can detect that the list has been mutated during a sort.
it_it: Mentre una lista viene ordinata, l'effetto di tentare di modificarla o anche solo ispezionarla è indefinito. L'implementazione C di Python fa apparire la lista vuota per la durata, e solleva :exc:`ValueError` se riesce a rilevare che la lista è stata modificata durante un ordinamento.

source: Tuples
it_it: Tuple

source: Tuples are immutable sequences, typically used to store collections of heterogeneous data (such as the 2-tuples produced by the :func:`enumerate` built-in). Tuples are also used for cases where an immutable sequence of homogeneous data is needed (such as allowing storage in a :class:`set` or :class:`dict` instance).
it_it: Le tuple sono sequenze immutabili, tipicamente utilizzate per memorizzare collezioni di dati eterogenei (come le 2-tuple prodotte dalla funzione built-in :func:`enumerate`). Le tuple sono utilizzate anche nei casi in cui è necessaria una sequenza immutabile di dati omogenei (come permettere la memorizzazione in un'istanza di :class:`set` o :class:`dict`).

source: Tuples may be constructed in a number of ways:
it_it: Le tuple possono essere costruite in diversi modi:

source: Using a pair of parentheses to denote the empty tuple: ``()``
it_it: Utilizzando una coppia di parentesi per denotare la tupla vuota: ``()``

source: Using a trailing comma for a singleton tuple: ``a,`` or ``(a,)``
it_it: Utilizzando una virgola finale per una tupla singleton: ``a,`` o ``(a,)``

source: Separating items with commas: ``a, b, c`` or ``(a, b, c)``
it_it: Separando gli elementi con virgole: ``a, b, c`` o ``(a, b, c)``
