Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: Return a copy of the object left justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
it_it: Restituisce una copia dell'oggetto giustificato a sinistra in una sequenza di lunghezza *width*. L'imbottitura viene fatta usando il *fillbyte* specificato (il predefinito è uno spazio ASCII). Per oggetti :class:`bytes`, la sequenza originale viene restituita se *width* è minore o uguale a ``len(s)``.

source: Return a copy of the sequence with specified leading bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
it_it: Restituisce una copia della sequenza con i bytes iniziali specificati rimossi. L'argomento *chars* è una sequenza binaria che specifica il set di valori dei byte da rimuovere - il nome si riferisce al fatto che questo metodo è solitamente usato con caratteri ASCII. Se omesso o ``None``, l'argomento *chars* predefinito è rimuovere gli spazi bianchi ASCII. L'argomento *chars* non è un prefisso; piuttosto, tutte le combinazioni dei suoi valori vengono rimosse::

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`. See :meth:`~bytes.removeprefix` for a method that will remove a single prefix string rather than all of a set of characters. For example::
it_it: La sequenza binaria di valori byte da rimuovere può essere qualsiasi :term:`oggetto simile a bytes <bytes-like object>`. Vedi :meth:`~bytes.removeprefix` per un metodo che rimuoverà una singola stringa prefisso anziché tutti i caratteri di un set. Ad esempio::

source: Return a copy of the object right justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
it_it: Restituisce una copia dell'oggetto giustificato a destra in una sequenza di lunghezza *width*. L'imbottitura viene fatta usando il *fillbyte* specificato (il predefinito è uno spazio ASCII). Per oggetti :class:`bytes`, la sequenza originale viene restituita se *width* è minore o uguale a ``len(s)``.

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any subsequence consisting solely of ASCII whitespace is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
it_it: Divide la sequenza binaria in sottosequenze dello stesso tipo, usando *sep* come stringa delimitatore. Se viene specificato *maxsplit*, vengono effettuate al massimo *maxsplit* divisioni, le ultime. Se *sep* non è specificato o è ``None``, qualsiasi sottosequenza costituita esclusivamente da spazi bianchi ASCII è un separatore. A parte per la divisione da destra, :meth:`rsplit` si comporta come :meth:`split` che è descritto in dettaglio di seguito.

source: Return a copy of the sequence with specified trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
it_it: Restituisce una copia della sequenza con i bytes finali specificati rimossi. L'argomento *chars* è una sequenza binaria che specifica il set di valori dei byte da rimuovere - il nome si riferisce al fatto che questo metodo è solitamente usato con caratteri ASCII. Se omesso o ``None``, l'argomento *chars* predefinito è rimuovere gli spazi bianchi ASCII. L'argomento *chars* non è un suffisso; piuttosto, tutte le combinazioni dei suoi valori vengono rimosse::

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`. See :meth:`~bytes.removesuffix` for a method that will remove a single suffix string rather than all of a set of characters. For example::
it_it: La sequenza binaria di valori byte da rimuovere può essere qualsiasi :term:`oggetto simile a bytes <bytes-like object>`. Vedi :meth:`~bytes.removesuffix` per un metodo che rimuoverà una singola stringa suffisso anziché tutti i caratteri di un set. Ad esempio::

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given and non-negative, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or is ``-1``, then there is no limit on the number of splits (all possible splits are made).
it_it: Divide la sequenza binaria in sottosequenze dello stesso tipo, usando *sep* come stringa delimitatore. Se *maxsplit* è dato e non negativo, vengono effettuate al massimo *maxsplit* divisioni (quindi, la lista avrà al massimo ``maxsplit+1`` elementi). Se *maxsplit* non è specificato o è ``-1``, non c'è limite al numero di divisioni (vengono effettuate tutte le possibili divisioni).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty subsequences (for example, ``b'1,,2'.split(b',')`` returns ``[b'1', b'', b'2']``). The *sep* argument may consist of a multibyte sequence (for example, ``b'1<>2<>3'.split(b'<>')`` returns ``[b'1', b'2', b'3']``). Splitting an empty sequence with a specified separator returns ``[b'']`` or ``[bytearray(b'')]`` depending on the type of object being split. The *sep* argument may be any :term:`bytes-like object`.
it_it: Se *sep* è dato, i delimitatori consecutivi non sono raggruppati insieme e sono considerati delimitatori per sottosequenze vuote (ad esempio, ``b'1,,2'.split(b',')`` restituisce ``[b'1', b'', b'2']``). L'argomento *sep* può consistere in una sequenza multibyte (ad esempio, ``b'1<>2<>3'.split(b'<>')`` restituisce ``[b'1', b'2', b'3']``). Divisione di una sequenza vuota con un separatore specificato restituisce ``[b'']`` o ``[bytearray(b'')]`` a seconda del tipo di oggetto che viene diviso. L'argomento *sep* può essere qualsiasi :term:`oggetto simile a bytes <bytes-like object>`.

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive ASCII whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the sequence has leading or trailing whitespace. Consequently, splitting an empty sequence or a sequence consisting solely of ASCII whitespace without a specified separator returns ``[]``.
it_it: Se *sep* non è specificato o è ``None``, viene applicato un diverso algoritmo di divisione: le sequenze di spazi bianchi ASCII consecutivi sono considerate come un singolo separatore, e il risultato non conterrà stringhe vuote all'inizio o alla fine se la sequenza ha spazi bianchi iniziali o finali. Pertanto, dividendo una sequenza vuota o una sequenza costituita esclusivamente da spazi bianchi ASCII senza un separatore specificato si ottiene ``[]``.

source: Return a copy of the sequence with specified leading and trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
it_it: Restituisce una copia della sequenza con i bytes iniziali e finali specificati rimossi. L'argomento *chars* è una sequenza binaria che specifica il set di valori dei byte da rimuovere - il nome si riferisce al fatto che questo metodo è solitamente usato con caratteri ASCII. Se omesso o ``None``, l'argomento *chars* predefinito è rimuovere gli spazi bianchi ASCII. L'argomento *chars* non è un prefisso o un suffisso; piuttosto, tutte le combinazioni dei suoi valori vengono rimosse::

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`.
it_it: La sequenza binaria di valori byte da rimuovere può essere qualsiasi :term:`oggetto simile a bytes <bytes-like object>`.

source: The following methods on bytes and bytearray objects assume the use of ASCII compatible binary formats and should not be applied to arbitrary binary data. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
it_it: I seguenti metodi sugli oggetti bytes e bytearray assumono l'uso di formati binari compatibili con ASCII e non dovrebbero essere applicati a dati binari arbitrari. Nota che tutti i metodi bytearray in questa sezione *non* operano in place, e invece producono nuovi oggetti.

source: Return a copy of the sequence with each byte interpreted as an ASCII character, and the first byte capitalized and the rest lowercased. Non-ASCII byte values are passed through unchanged.
it_it: Restituisce una copia della sequenza con ogni byte interpretato come un carattere ASCII, e il primo byte capitalizzato e il resto in minuscolo. I valori dei byte non ASCII vengono trasmessi senza modifiche.

source: Return a copy of the sequence where all ASCII tab characters are replaced by one or more ASCII spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* bytes (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the sequence, the current column is set to zero and the sequence is examined byte by byte. If the byte is an ASCII tab character (``b'\t'``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the current byte is an ASCII newline (``b'\n'``) or carriage return (``b'\r'``), it is copied and the current column is reset to zero. Any other byte value is copied unchanged and the current column is incremented by one regardless of how the byte value is represented when printed::
it_it: Restituisce una copia della sequenza dove tutti i caratteri ASCII tab sono sostituiti da uno o più spazi ASCII, a seconda della colonna corrente e della dimensione del tab fornita. Le posizioni della tabulazione si verificano ogni *tabsize* byte (il valore predefinito è 8, dando le posizioni della tabulazione alle colonne 0, 8, 16 e così via). Per espandere la sequenza, la colonna corrente viene impostata a zero e la sequenza viene esaminata byte per byte. Se il byte è un carattere tabulazione ASCII (``b'\t'``), uno o più spazi vengono inseriti nel risultato fino a quando la colonna corrente è uguale alla prossima posizione di tabulazione. (Il carattere tabulazione stesso non viene copiato.) Se il byte corrente è una nuova riga ASCII (``b'\n'``) o ritorno a capo (``b'\r'``), viene copiato e la colonna corrente viene reimpostata a zero. Qualsiasi altro valore di byte viene copiato senza modifiche e la colonna corrente viene incrementata di uno indipendentemente da come il valore del byte viene rappresentato quando viene stampato::

source: Return ``True`` if all bytes in the sequence are alphabetical ASCII characters or ASCII decimal digits and the sequence is not empty, ``False`` otherwise. Alphabetic ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``. ASCII decimal digits are those byte values in the sequence ``b'0123456789'``.
it_it: Restituisce ``True`` se tutti i byte nella sequenza sono caratteri alfabetici ASCII o cifre decimali ASCII e la sequenza non è vuota, ``False`` altrimenti. I caratteri alfabetici ASCII sono quei valori di byte nella sequenza ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``. Le cifre decimali ASCII sono quei valori di byte nella sequenza ``b'0123456789'``.

source: Return ``True`` if all bytes in the sequence are alphabetic ASCII characters and the sequence is not empty, ``False`` otherwise. Alphabetic ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
it_it: Restituisce ``True`` se tutti i byte nella sequenza sono caratteri alfabetici ASCII e la sequenza non è vuota, ``False`` altrimenti. I caratteri alfabetici ASCII sono quei valori di byte nella sequenza ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``.

source: Return ``True`` if the sequence is empty or all bytes in the sequence are ASCII, ``False`` otherwise. ASCII bytes are in the range 0-0x7F.
it_it: Restituisce ``True`` se la sequenza è vuota o se tutti i byte nella sequenza sono ASCII, ``False`` altrimenti. I byte ASCII sono nell'intervallo 0-0x7F.

source: Return ``True`` if all bytes in the sequence are ASCII decimal digits and the sequence is not empty, ``False`` otherwise. ASCII decimal digits are those byte values in the sequence ``b'0123456789'``.
it_it: Restituisce ``True`` se tutti i byte nella sequenza sono cifre decimali ASCII e la sequenza non è vuota, ``False`` altrimenti. Le cifre decimali ASCII sono quei valori di byte nella sequenza ``b'0123456789'``.

source: Return ``True`` if there is at least one lowercase ASCII character in the sequence and no uppercase ASCII characters, ``False`` otherwise.
it_it: Restituisce ``True`` se c'è almeno un carattere minuscolo ASCII nella sequenza e nessun carattere maiuscolo ASCII, ``False`` altrimenti.

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
it_it: I caratteri minuscoli ASCII sono quei valori di byte nella sequenza ``b'abcdefghijklmnopqrstuvwxyz'``. I caratteri maiuscoli ASCII sono quei valori di byte nella sequenza ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.

source: Return ``True`` if all bytes in the sequence are ASCII whitespace and the sequence is not empty, ``False`` otherwise. ASCII whitespace characters are those byte values in the sequence ``b' \t\n\r\x0b\f'`` (space, tab, newline, carriage return, vertical tab, form feed).
it_it: Restituisce ``True`` se tutti i byte nella sequenza sono spazi bianchi ASCII e la sequenza non è vuota, ``False`` altrimenti. I caratteri di spazio bianco ASCII sono quei valori di byte nella sequenza ``b' \t\n\r\x0b\f'`` (spazio, tabulazione, nuova riga, ritorno a capo, tabulazione verticale, form feed).

source: Return ``True`` if the sequence is ASCII titlecase and the sequence is not empty, ``False`` otherwise. See :meth:`bytes.title` for more details on the definition of "titlecase".
it_it: Restituisce ``True`` se la sequenza è in formato ASCII "titlecase" e la sequenza non è vuota, ``False`` altrimenti. Vedi :meth:`bytes.title` per maggiori dettagli sulla definizione di "titlecase".

source: Return ``True`` if there is at least one uppercase alphabetic ASCII character in the sequence and no lowercase ASCII characters, ``False`` otherwise.
it_it: Restituisce ``True`` se c'è almeno un carattere alfabetico ASCII maiuscolo nella sequenza e nessun carattere ASCII minuscolo, ``False`` altrimenti.

source: Return a copy of the sequence with all the uppercase ASCII characters converted to their corresponding lowercase counterpart.
it_it: Restituisce una copia della sequenza con tutti i caratteri ASCII maiuscoli convertiti nei loro corrispondenti caratteri minuscoli.

source: Return a list of the lines in the binary sequence, breaking at ASCII line boundaries. This method uses the :term:`universal newlines` approach to splitting lines. Line breaks are not included in the resulting list unless *keepends* is given and true.
it_it: Restituisce un elenco delle linee nella sequenza binaria, suddividendo ai confini delle linee ASCII. Questo metodo utilizza l'approccio delle :term:`universal newlines` per dividere le linee. Le interruzioni di linea non sono incluse nell'elenco risultante a meno che *keepends* non sia fornito e impostato su vero.

source: Unlike :meth:`~bytes.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
it_it: A differenza di :meth:`~bytes.split` quando viene dato un delimitatore di stringa *sep*, questo metodo restituisce un elenco vuoto per la stringa vuota, e un'interruzione di linea terminale non produce una linea extra::

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart and vice-versa.
it_it: Restituisce una copia della sequenza con tutti i caratteri ASCII minuscoli convertiti nei loro corrispondenti caratteri maiuscoli e viceversa.

source: Unlike :func:`str.swapcase()`, it is always the case that ``bin.swapcase().swapcase() == bin`` for the binary versions. Case conversions are symmetrical in ASCII, even though that is not generally true for arbitrary Unicode code points.
it_it: A differenza di :func:`str.swapcase()`, è sempre il caso che ``bin.swapcase().swapcase() == bin`` per le versioni binarie. Le conversioni di maiuscole e minuscole sono simmetriche in ASCII, anche se ciò non è generalmente vero per punti di codice Unicode arbitrari.

source: Return a titlecased version of the binary sequence where words start with an uppercase ASCII character and the remaining characters are lowercase. Uncased byte values are left unmodified.
it_it: Restituisce una versione in formato "titlecase" della sequenza binaria in cui le parole iniziano con un carattere ASCII maiuscolo e i rimanenti caratteri sono minuscoli. I valori di byte senza distinzione di maiuscole e minuscole non vengono modificati.

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. All other byte values are uncased.
it_it: I caratteri ASCII minuscoli sono quei valori di byte nella sequenza ``b'abcdefghijklmnopqrstuvwxyz'``. I caratteri ASCII maiuscoli sono quei valori di byte nella sequenza ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. Tutti gli altri valori di byte sono senza distinzione di maiuscole e minuscole.

source: A workaround for apostrophes can be constructed using regular expressions::
it_it: Una soluzione alternativa per gli apostrofi può essere costruita utilizzando espressioni regolari::

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart.
it_it: Restituisce una copia della sequenza con tutti i caratteri ASCII minuscoli convertiti nei loro corrispondenti caratteri maiuscoli.

source: Return a copy of the sequence left filled with ASCII ``b'0'`` digits to make a sequence of length *width*. A leading sign prefix (``b'+'``/ ``b'-'``) is handled by inserting the padding *after* the sign character rather than before. For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(seq)``.
it_it: Restituisce una copia della sequenza riempita a sinistra con i caratteri ASCII ``b'0'`` per creare una sequenza della lunghezza *width*. Un prefisso di segno principale (``b'+'``/ ``b'-'``) viene gestito inserendo il padding *dopo* il carattere del segno anziché prima. Per gli oggetti :class:`bytes`, la sequenza originale viene restituita se *width* è inferiore o uguale a ``len(seq)``.

source: ``printf``-style Bytes Formatting
it_it: Formattazione Bytes stile ``printf``

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). If the value being printed may be a tuple or dictionary, wrap it in a tuple.
it_it: Le operazioni di formattazione descritte qui mostrano una varietà di stranezze che portano a numerosi errori comuni (come la visualizzazione errata di tuple e dizionari). Se il valore da stampare potrebbe essere una tupla o un dizionario, racchiudilo in una tupla.

source: Bytes objects (``bytes``/``bytearray``) have one unique built-in operation: the ``%`` operator (modulo). This is also known as the bytes *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a bytes object), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` in the C language.
it_it: Gli oggetti Bytes (``bytes``/``bytearray``) hanno un'operazione integrata unica: l'operatore ``%`` (modulo). Questo è anche noto come operatore di *formattazione* o *interpolazione* dei bytes. Dato ``format % values`` (dove *format* è un oggetto bytes), le specifiche di conversione ``%`` in *format* sono sostituite con uno o più elementi di *values*. L'effetto è simile all'uso della funzione :c:func:`sprintf` nel linguaggio C.

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format bytes object, or a single mapping object (for example, a dictionary).
it_it: Se *format* richiede un singolo argomento, *values* può essere un singolo oggetto non-tuple. [5]_ Altrimenti, *values* deve essere una tupla con esattamente il numero di elementi specificati dall'oggetto bytes di formato, o un singolo oggetto di mappatura (ad esempio, un dizionario).

source: When the right argument is a dictionary (or other mapping type), then the formats in the bytes object *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
it_it: Quando l'argomento a destra è un dizionario (o un altro tipo di mappatura), allora i formati nell'oggetto bytes *devono* includere una chiave di mappatura tra parentesi in quel dizionario inserita immediatamente dopo il carattere ``'%'``. La chiave di mappatura seleziona il valore da formattare dalla mappatura. Ad esempio:

source: Single byte (accepts integer or single byte objects).
it_it: Byte singolo (accetta oggetti interi o byte singoli).

source: Bytes (any object that follows the :ref:`buffer protocol <bufferobjects>` or has :meth:`~object.__bytes__`).
it_it: Bytes (qualsiasi oggetto che segue il :ref:`buffer protocol <bufferobjects>` o ha :meth:`~object.__bytes__`).

source: ``'s'`` is an alias for ``'b'`` and should only be used for Python2/3 code bases.
it_it: ``'s'`` è un alias per ``'b'`` e dovrebbe essere usato solo per basi di codice Python2/3.

source: Bytes (converts any Python object using ``repr(obj).encode('ascii', 'backslashreplace')``).
it_it: Bytes (converte qualsiasi oggetto Python utilizzando ``repr(obj).encode('ascii', 'backslashreplace')``).

source: ``'r'`` is an alias for ``'a'`` and should only be used for Python2/3 code bases.
it_it: ``'r'`` è un alias per ``'a'`` e dovrebbe essere usato solo per basi di codice Python2/3.

source: ``b'%s'`` is deprecated, but will not be removed during the 3.x series.
it_it: ``b'%s'`` è deprecato, ma non verrà rimosso durante la serie 3.x.

source: ``b'%r'`` is deprecated, but will not be removed during the 3.x series.
it_it: ``b'%r'`` è deprecato, ma non verrà rimosso durante la serie 3.x.
