Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytes type has an additional class method to read data in that format:
it_it: Poiché 2 cifre esadecimali corrispondono esattamente a un singolo byte, i numeri esadecimali sono un formato comunemente usato per descrivere i dati binari. Di conseguenza, il tipo bytes ha un metodo di classe aggiuntivo per leggere i dati in tale formato:

source: This :class:`bytes` class method returns a bytes object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
it_it: Questo metodo di classe :class:`bytes` restituisce un oggetto bytes, decodificando il dato oggetto stringa. La stringa deve contenere due cifre esadecimali per byte, e gli spazi bianchi ASCII vengono ignorati.

source: :meth:`bytes.fromhex` now skips all ASCII whitespace in the string, not just spaces.
it_it: :meth:`bytes.fromhex` ora salta tutti gli spazi bianchi ASCII nella stringa, non solo gli spazi.

source: A reverse conversion function exists to transform a bytes object into its hexadecimal representation.
it_it: Esiste una funzione di conversione inversa per trasformare un oggetto bytes nella sua rappresentazione esadecimale.

source: Return a string object containing two hexadecimal digits for each byte in the instance.
it_it: Restituisce un oggetto stringa contenente due cifre esadecimali per ogni byte nell'istanza.

source: If you want to make the hex string easier to read, you can specify a single character separator *sep* parameter to include in the output. By default, this separator will be included between each byte. A second optional *bytes_per_sep* parameter controls the spacing. Positive values calculate the separator position from the right, negative values from the left.
it_it: Se vuoi rendere la stringa esadecimale più leggibile, puoi specificare un parametro separatore *sep* per includere un singolo carattere nell'output. Per impostazione predefinita, questo separatore verrà incluso tra ogni byte. Un secondo parametro opzionale *bytes_per_sep* controlla la spaziatura. I valori positivi calcolano la posizione del separatore da destra, i valori negativi da sinistra.

source: :meth:`bytes.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
it_it: :meth:`bytes.hex` ora supporta i parametri opzionali *sep* e *bytes_per_sep* per inserire separatori tra i byte nell'output esadecimale.

source: Since bytes objects are sequences of integers (akin to a tuple), for a bytes object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytes object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
it_it: Poiché gli oggetti bytes sono sequenze di interi (simili a una tupla), per un oggetto bytes *b*, ``b[0]`` sarà un intero, mentre ``b[0:1]`` sarà un oggetto bytes di lunghezza 1. (Questo contrasta con le stringhe di testo, dove sia l'indicizzazione che il slicing produrranno una stringa di lunghezza 1)

source: The representation of bytes objects uses the literal format (``b'...'``) since it is often more useful than e.g. ``bytes([46, 46, 46])``. You can always convert a bytes object into a list of integers using ``list(b)``.
it_it: La rappresentazione degli oggetti bytes usa il formato letterale (``b'...'``) poiché è spesso più utile di, ad esempio, ``bytes([46, 46, 46])``. Puoi sempre convertire un oggetto bytes in una lista di interi usando ``list(b)``.

source: Bytearray Objects
it_it: Oggetti Bytearray

source: :class:`bytearray` objects are a mutable counterpart to :class:`bytes` objects.
it_it: Gli oggetti :class:`bytearray` sono una controparte mutabile degli oggetti :class:`bytes`.

source: There is no dedicated literal syntax for bytearray objects, instead they are always created by calling the constructor:
it_it: Non esiste una sintassi letterale dedicata per gli oggetti bytearray, essi vengono sempre creati chiamando il costruttore:

source: Creating an empty instance: ``bytearray()``
it_it: Creazione di un'istanza vuota: ``bytearray()``

source: Creating a zero-filled instance with a given length: ``bytearray(10)``
it_it: Creazione di un'istanza riempita di zeri con una lunghezza data: ``bytearray(10)``

source: From an iterable of integers: ``bytearray(range(20))``
it_it: Da un iterable di interi: ``bytearray(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytearray(b'Hi!')``
it_it: Copiando dati binari esistenti tramite il protocollo buffer: ``bytearray(b'Hi!')``

source: As bytearray objects are mutable, they support the :ref:`mutable <typesseq-mutable>` sequence operations in addition to the common bytes and bytearray operations described in :ref:`bytes-methods`.
it_it: Poiché gli oggetti bytearray sono mutabili, supportano le operazioni di sequenza :ref:`mutable <typesseq-mutable>` oltre alle comuni operazioni bytes e bytearray descritte in :ref:`bytes-methods`.

source: Also see the :ref:`bytearray <func-bytearray>` built-in.
it_it: Vedi anche il built-in :ref:`bytearray <func-bytearray>`.

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytearray type has an additional class method to read data in that format:
it_it: Poiché 2 cifre esadecimali corrispondono esattamente a un singolo byte, i numeri esadecimali sono un formato comunemente usato per descrivere i dati binari. Di conseguenza, il tipo bytearray ha un metodo di classe aggiuntivo per leggere i dati in tale formato:

source: This :class:`bytearray` class method returns bytearray object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
it_it: Questo metodo di classe :class:`bytearray` restituisce un oggetto bytearray, decodificando il dato oggetto stringa. La stringa deve contenere due cifre esadecimali per byte, e gli spazi bianchi ASCII vengono ignorati.

source: :meth:`bytearray.fromhex` now skips all ASCII whitespace in the string, not just spaces.
it_it: :meth:`bytearray.fromhex` ora salta tutti gli spazi bianchi ASCII nella stringa, non solo gli spazi.

source: A reverse conversion function exists to transform a bytearray object into its hexadecimal representation.
it_it: Esiste una funzione di conversione inversa per trasformare un oggetto bytearray nella sua rappresentazione esadecimale.

source: Similar to :meth:`bytes.hex`, :meth:`bytearray.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
it_it: Simile a :meth:`bytes.hex`, :meth:`bytearray.hex` ora supporta i parametri opzionali *sep* e *bytes_per_sep* per inserire separatori tra i byte nell'output esadecimale.

source: Since bytearray objects are sequences of integers (akin to a list), for a bytearray object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytearray object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
it_it: Poiché gli oggetti bytearray sono sequenze di interi (simili a una lista), per un oggetto bytearray *b*, ``b[0]`` sarà un intero, mentre ``b[0:1]`` sarà un oggetto bytearray di lunghezza 1. (Questo contrasta con le stringhe di testo, dove sia l'indicizzazione che il slicing produrranno una stringa di lunghezza 1)

source: The representation of bytearray objects uses the bytes literal format (``bytearray(b'...')``) since it is often more useful than e.g. ``bytearray([46, 46, 46])``. You can always convert a bytearray object into a list of integers using ``list(b)``.
it_it: La rappresentazione degli oggetti bytearray usa il formato letterale bytes (``bytearray(b'...')``) poiché è spesso più utile di, ad esempio, ``bytearray([46, 46, 46])``. Puoi sempre convertire un oggetto bytearray in una lista di interi usando ``list(b)``.

source: Bytes and Bytearray Operations
it_it: Operazioni su Bytes e Bytearray

source: Both bytes and bytearray objects support the :ref:`common <typesseq-common>` sequence operations. They interoperate not just with operands of the same type, but with any :term:`bytes-like object`. Due to this flexibility, they can be freely mixed in operations without causing errors. However, the return type of the result may depend on the order of operands.
it_it: Sia gli oggetti bytes che bytearray supportano le operazioni di sequenza :ref:`common <typesseq-common>`. Essi interoperano non solo con operandi dello stesso tipo, ma con qualsiasi :term:`bytes-like object`. Grazie a questa flessibilità, possono essere liberamente mescolati nelle operazioni senza causare errori. Tuttavia, il tipo restituito del risultato può dipendere dall'ordine degli operandi.

source: The methods on bytes and bytearray objects don't accept strings as their arguments, just as the methods on strings don't accept bytes as their arguments. For example, you have to write::
it_it: I metodi sugli oggetti bytes e bytearray non accettano stringhe come argomenti, così come i metodi sulle stringhe non accettano bytes come argomenti. Ad esempio, devi scrivere::

source: and::
it_it: e::

source: Some bytes and bytearray operations assume the use of ASCII compatible binary formats, and hence should be avoided when working with arbitrary binary data. These restrictions are covered below.
it_it: Alcune operazioni su bytes e bytearray presumono l'uso di formati binari compatibili con ASCII e, pertanto, dovrebbero essere evitate quando si lavora con dati binari arbitrari. Queste restrizioni sono trattate di seguito.

source: Using these ASCII based operations to manipulate binary data that is not stored in an ASCII based format may lead to data corruption.
it_it: Utilizzare queste operazioni basate su ASCII per manipolare dati binari che non sono memorizzati in un formato basato su ASCII può portare a corruzione dei dati.

source: The following methods on bytes and bytearray objects can be used with arbitrary binary data.
it_it: I seguenti metodi sugli oggetti bytes e bytearray possono essere utilizzati con dati binari arbitrari.

source: Return the number of non-overlapping occurrences of subsequence *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
it_it: Restituisce il numero di occorrenze non sovrapposte della sottosequenza *sub* nell'intervallo [*start*, *end*]. Gli argomenti opzionali *start* e *end* sono interpretati come nella notazione di slice.

source: The subsequence to search for may be any :term:`bytes-like object` or an integer in the range 0 to 255.
it_it: La sottosequenza da cercare può essere qualsiasi :term:`bytes-like object` o un intero nell'intervallo da 0 a 255.

source: If *sub* is empty, returns the number of empty slices between characters which is the length of the bytes object plus one.
it_it: Se *sub* è vuoto, restituisce il numero di slice vuoti tra i caratteri che è la lunghezza dell'oggetto bytes più uno.

source: Also accept an integer in the range 0 to 255 as the subsequence.
it_it: Accetta anche un intero nell'intervallo da 0 a 255 come sottosequenza.

source: If the binary data starts with the *prefix* string, return ``bytes[len(prefix):]``. Otherwise, return a copy of the original binary data::
it_it: Se i dati binari iniziano con la stringa *prefix*, restituisce ``bytes[len(prefix):]``. Altrimenti, restituisce una copia dei dati binari originali::

source: The *prefix* may be any :term:`bytes-like object`.
it_it: Il *prefix* può essere qualsiasi :term:`bytes-like object`.

source: The bytearray version of this method does *not* operate in place - it always produces a new object, even if no changes were made.
it_it: La versione di questo metodo per bytearray non opera *in place* - produce sempre un nuovo oggetto, anche se non sono state apportate modifiche.

source: If the binary data ends with the *suffix* string and that *suffix* is not empty, return ``bytes[:-len(suffix)]``. Otherwise, return a copy of the original binary data::
it_it: Se i dati binari terminano con la stringa *suffix* e questo *suffix* non è vuoto, ritorna ``bytes[:-len(suffix)]``. Altrimenti, ritorna una copia dei dati binari originali::

source: The *suffix* may be any :term:`bytes-like object`.
it_it: Il *suffix* può essere qualsiasi :term:`oggetto simile a bytes <bytes-like object>`.

source: Return the bytes decoded to a :class:`str`.
it_it: Restituisce i bytes decodificati in una :class:`str`.

source: *errors* controls how decoding errors are handled. If ``'strict'`` (the default), a :exc:`UnicodeError` exception is raised. Other possible values are ``'ignore'``, ``'replace'``, and any other name registered via :func:`codecs.register_error`. See :ref:`error-handlers` for details.
it_it: *errors* controlla come vengono gestiti gli errori di decodifica. Se ``'strict'`` (il valore predefinito), viene sollevata un'eccezione :exc:`UnicodeError`. Altri valori possibili sono ``'ignore'``, ``'replace'``, e qualsiasi altro nome registrato tramite :func:`codecs.register_error`. Vedi :ref:`error-handlers` per i dettagli.

source: For performance reasons, the value of *errors* is not checked for validity unless a decoding error actually occurs, :ref:`devmode` is enabled or a :ref:`debug build <debug-build>` is used.
it_it: Per ragioni di prestazioni, il valore di *errors* non viene verificato per validità a meno che non si verifichi effettivamente un errore di decodifica, sia abilitato :ref:`devmode` o venga utilizzata una :ref:`build di debug <debug-build>`.

source: Passing the *encoding* argument to :class:`str` allows decoding any :term:`bytes-like object` directly, without needing to make a temporary :class:`!bytes` or :class:`!bytearray` object.
it_it: Passare l'argomento *encoding* a :class:`str` permette di decodificare qualsiasi :term:`oggetto simile a bytes <bytes-like object>` direttamente, senza dover creare un oggetto temporaneo :class:`!bytes` o :class:`!bytearray`.

source: Return ``True`` if the binary data ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
it_it: Restituisce ``True`` se i dati binari terminano con il *suffix* specificato, altrimenti restituisce ``False``. *suffix* può essere anche una tupla di suffissi da cercare. Con *start* opzionale, il test inizia a quella posizione. Con *end* opzionale, smette di confrontare a quella posizione.

source: The suffix(es) to search for may be any :term:`bytes-like object`.
it_it: Il/i suffisso/i da cercare possono essere qualsiasi :term:`oggetto simile a bytes <bytes-like object>`.

source: Return the lowest index in the data where the subsequence *sub* is found, such that *sub* is contained in the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
it_it: Restituisce l'indice più basso nei dati dove si trova la sottosequenza *sub*, tale che *sub* sia contenuto nella slice ``s[start:end]``. Gli argomenti opzionali *start* e *end* sono interpretati come nella notazione delle slice. Restituisce ``-1`` se *sub* non viene trovato.

source: The :meth:`~bytes.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
it_it: Il metodo :meth:`~bytes.find` dovrebbe essere utilizzato solo se hai bisogno di conoscere la posizione di *sub*. Per verificare se *sub* è una sottostringa o no, usa l'operatore :keyword:`in`::

source: Like :meth:`~bytes.find`, but raise :exc:`ValueError` when the subsequence is not found.
it_it: Come :meth:`~bytes.find`, ma solleva :exc:`ValueError` quando la sottosequenza non viene trovata.

source: Return a bytes or bytearray object which is the concatenation of the binary data sequences in *iterable*. A :exc:`TypeError` will be raised if there are any values in *iterable* that are not :term:`bytes-like objects <bytes-like object>`, including :class:`str` objects. The separator between elements is the contents of the bytes or bytearray object providing this method.
it_it: Restituisce un oggetto bytes o bytearray che è la concatenazione delle sequenze di dati binari in *iterable*. Verrà sollevata una :exc:`TypeError` se ci sono valori in *iterable* che non sono :term:`oggetti simili a bytes <bytes-like object>`, inclusi gli oggetti :class:`str`. Il separatore tra gli elementi è il contenuto dell'oggetto bytes o bytearray che fornisce questo metodo.

source: This static method returns a translation table usable for :meth:`bytes.translate` that will map each character in *from* into the character at the same position in *to*; *from* and *to* must both be :term:`bytes-like objects <bytes-like object>` and have the same length.
it_it: Questo metodo statico restituisce una tabella di traduzione utilizzabile per :meth:`bytes.translate` che mapperà ciascun carattere in *from* nel carattere nella stessa posizione in *to*; *from* e *to* devono essere entrambi :term:`oggetti simili a bytes <bytes-like object>` e avere la stessa lunghezza.

source: Split the sequence at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing a copy of the original sequence, followed by two empty bytes or bytearray objects.
it_it: Divide la sequenza alla prima occorrenza di *sep*, e restituisce una tupla a 3 elementi contenente la parte prima del separatore, il separatore stesso o la sua copia bytearray, e la parte dopo il separatore. Se il separatore non viene trovato, restituisce una tupla a 3 elementi contenente una copia della sequenza originale, seguita da due oggetti vuoti bytes o bytearray.

source: The separator to search for may be any :term:`bytes-like object`.
it_it: Il separatore da cercare può essere qualsiasi :term:`oggetto simile a bytes <bytes-like object>`.

source: Return a copy of the sequence with all occurrences of subsequence *old* replaced by *new*. If the optional argument *count* is given, only the first *count* occurrences are replaced.
it_it: Restituisce una copia della sequenza con tutte le occorrenze della sottosequenza *old* sostituite da *new*. Se viene specificato l'argomento opzionale *count*, vengono sostituite solo le prime *count* occorrenze.

source: The subsequence to search for and its replacement may be any :term:`bytes-like object`.
it_it: La sottosequenza da cercare e la sua sostituzione possono essere qualsiasi :term:`oggetto simile a bytes <bytes-like object>`.

source: Return the highest index in the sequence where the subsequence *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
it_it: Restituisce l'indice più alto nella sequenza dove si trova la sottosequenza *sub*, tale che *sub* sia contenuto in ``s[start:end]``. Gli argomenti opzionali *start* e *end* sono interpretati come nella notazione delle slice. Restituisce ``-1`` in caso di fallimento.

source: Like :meth:`~bytes.rfind` but raises :exc:`ValueError` when the subsequence *sub* is not found.
it_it: Come :meth:`~bytes.rfind` ma solleva :exc:`ValueError` quando la sottosequenza *sub* non viene trovata.

source: Split the sequence at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty bytes or bytearray objects, followed by a copy of the original sequence.
it_it: Divide la sequenza all'ultima occorrenza di *sep*, e restituisce una tupla a 3 elementi contenente la parte prima del separatore, il separatore stesso o la sua copia bytearray, e la parte dopo il separatore. Se il separatore non viene trovato, restituisce una tupla a 3 elementi contenente due oggetti vuoti bytes o bytearray, seguiti da una copia della sequenza originale.

source: Return ``True`` if the binary data starts with the specified *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
it_it: Restituisce ``True`` se i dati binari iniziano con il *prefix* specificato, altrimenti restituisce ``False``. *prefix* può essere anche una tupla di prefissi da cercare. Con *start* opzionale, il test inizia a quella posizione. Con *end* opzionale, smette di confrontare a quella posizione.

source: The prefix(es) to search for may be any :term:`bytes-like object`.
it_it: Il/i prefisso/i da cercare possono essere qualsiasi :term:`oggetto simile a bytes <bytes-like object>`.

source: Return a copy of the bytes or bytearray object where all bytes occurring in the optional argument *delete* are removed, and the remaining bytes have been mapped through the given translation table, which must be a bytes object of length 256.
it_it: Restituisce una copia dell'oggetto bytes o bytearray dove tutti i bytes presenti nell'argomento opzionale *delete* sono stati rimossi, e i bytes rimanenti sono stati mappati attraverso la tabella di traduzione data, che deve essere un oggetto bytes di lunghezza 256.

source: You can use the :func:`bytes.maketrans` method to create a translation table.
it_it: Puoi usare il metodo :func:`bytes.maketrans` per creare una tabella di traduzione.

source: Set the *table* argument to ``None`` for translations that only delete characters::
it_it: Imposta l'argomento *table* su ``None`` per traduzioni che eliminano solo i caratteri::

source: *delete* is now supported as a keyword argument.
it_it: *delete* ora è supportato come argomento keyword.

source: The following methods on bytes and bytearray objects have default behaviours that assume the use of ASCII compatible binary formats, but can still be used with arbitrary binary data by passing appropriate arguments. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
it_it: I seguenti metodi su oggetti bytes e bytearray hanno comportamenti predefiniti che assumono l'uso di formati binari compatibili con ASCII, ma possono essere comunque utilizzati con dati binari arbitrari passando argomenti appropriati. Nota che tutti i metodi bytearray in questa sezione *non* operano in place, e invece producono nuovi oggetti.

source: Return a copy of the object centered in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
it_it: Restituisce una copia dell'oggetto centrato in una sequenza di lunghezza *width*. L'imbottitura viene fatta usando il *fillbyte* specificato (il predefinito è uno spazio ASCII). Per oggetti :class:`bytes`, la sequenza originale viene restituita se *width* è minore o uguale a ``len(s)``.
