Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: Test your application thoroughly if you use a low limit. Ensure your tests run with the limit set early via the environment or flag so that it applies during startup and even during any installation step that may invoke Python to precompile ``.py`` sources to ``.pyc`` files.
it_it: Testa accuratamente la tua applicazione se utilizzi un limite basso. Assicurati che i tuoi test vengano eseguiti con il limite impostato in anticipo tramite l'ambiente o il flag in modo che si applichi durante l'avvio e anche durante qualsiasi passaggio di installazione che potrebbe invocare Python per precompilare i sorgenti ``.py`` in file ``.pyc``.

source: Recommended configuration
it_it: Configurazione consigliata

source: The default :data:`sys.int_info.default_max_str_digits` is expected to be reasonable for most applications. If your application requires a different limit, set it from your main entry point using Python version agnostic code as these APIs were added in security patch releases in versions before 3.12.
it_it: Il :data:`sys.int_info.default_max_str_digits` predefinito è previsto per essere ragionevole per la maggior parte delle applicazioni. Se la tua applicazione richiede un limite diverso, impostalo dal tuo punto di ingresso principale utilizzando codice agnostico alla versione di Python poiché queste API sono state aggiunte in rilasci di patch di sicurezza in versioni precedenti alla 3.12.

source: Example::
it_it: Esempio::

source: If you need to disable it entirely, set it to ``0``.
it_it: Se hai bisogno di disabilitarlo completamente, impostalo a ``0``.

source: Footnotes
it_it: Note a piè di pagina

source: Additional information on these special methods may be found in the Python Reference Manual (:ref:`customization`).
it_it: Ulteriori informazioni su questi metodi speciali possono essere trovate nel Manuale di Riferimento Python (:ref:`customization`).

source: As a consequence, the list ``[1, 2]`` is considered equal to ``[1.0, 2.0]``, and similarly for tuples.
it_it: Di conseguenza, l'elenco ``[1, 2]`` è considerato uguale a ``[1.0, 2.0]``, e analogamente per le tuple.

source: They must have since the parser can't tell the type of the operands.
it_it: Devono esserlo poiché il parser non può determinare il tipo degli operandi.

source: Cased characters are those with general category property being one of "Lu" (Letter, uppercase), "Ll" (Letter, lowercase), or "Lt" (Letter, titlecase).
it_it: I caratteri con distinzione di maiuscole e minuscole sono quelli con proprietà di categoria generale "Lu" (Lettera, maiuscola), "Ll" (Lettera, minuscola) o "Lt" (Lettera, maiuscola a inizio parola).

source: To format only a tuple you should therefore provide a singleton tuple whose only element is the tuple to be formatted.
it_it: Per formattare solo una tupla, dovresti quindi fornire una tupla singleton il cui unico elemento è la tupla da formattare.

source: built-in
it_it: incorporato

source: types
it_it: tipi

source: statement
it_it: istruzione

source: truth
it_it: verità

source: value
it_it: valore

source: Boolean
it_it: Booleano

source: operations
it_it: operazioni

source: false
it_it: falso

source: true
it_it: vero

source: None (Built-in object)
it_it: None (Oggetto integrato)

source: False (Built-in object)
it_it: False (Oggetto integrato)

source: operator
it_it: operatore

source: or
it_it: oppure

source: and
it_it: e

source: False
it_it: Falso

source: True
it_it: Vero

source: not
it_it: non

source: chaining
it_it: concatenamento

source: comparisons
it_it: confronti

source: comparison
it_it: confronto

source: < (less)
it_it: < (minore)

source: > (greater)
it_it: > (maggiore)

source: is
it_it: è

source: is not
it_it: non è

source: object
it_it: oggetto

source: numeric
it_it: numerico

source: objects
it_it: oggetti

source: comparing
it_it: confrontare

source: __eq__() (instance method)
it_it: __eq__() (metodo di istanza)

source: __ne__() (instance method)
it_it: __ne__() (metodo di istanza)

source: __lt__() (instance method)
it_it: __lt__() (metodo di istanza)

source: __le__() (instance method)
it_it: __le__() (metodo di istanza)

source: __gt__() (instance method)
it_it: __gt__() (metodo di istanza)

source: __ge__() (instance method)
it_it: __ge__() (metodo di istanza)

source: not in
it_it: non in

source: integer
it_it: intero

source: floating point
it_it: punto flottante

source: complex number
it_it: numero complesso

source: language
it_it: linguaggio

source: literals
it_it: letterali

source: hexadecimal
it_it: esadecimale

source: octal
it_it: ottale

source: binary
it_it: binario

source: arithmetic
it_it: aritmetica

source: built-in function
it_it: funzione integrata

source: + (plus)
it_it: + (più)

source: unary operator
it_it: operatore unario

source: binary operator
it_it: operatore binario

source: - (minus)
it_it: - (meno)

source: * (asterisk)
it_it: * (asterisco)

source: / (slash)
it_it: / (barra)

source: % (percent)
it_it: % (percento)

source: operations on
it_it: operazioni su

source: conjugate() (complex number method)
it_it: conjugate() (metodo numero complesso)

source: module
it_it: modulo

source: floor() (in module math)
it_it: floor() (nel modulo math)

source: ceil() (in module math)
it_it: ceil() (nel modulo math)

source: trunc() (in module math)
it_it: trunc() (nel modulo math)

source: conversions
it_it: conversioni

source: shifting
it_it: shift

source: masking
it_it: mascheramento

source: | (vertical bar)
it_it: | (barra verticale)

source: ^ (caret)
it_it: ^ (circonflesso)

source: & (ampersand)
it_it: & (e commerciale)

source: values
it_it: valori

source: iterator protocol
it_it: protocollo iteratore

source: protocol
it_it: protocollo

source: iterator
it_it: iteratore

source: sequence
it_it: sequenza

source: iteration
it_it: iterazione

source: container
it_it: contenitore

source: iteration over
it_it: iterazione su

source: concatenation
it_it: concatenazione

source: operation
it_it: operazione

source: repetition
it_it: ripetizione

source: subscript
it_it: sottoscrizione

source: count() (sequence method)
it_it: count() (metodo sequenza)

source: index() (sequence method)
it_it: index() (metodo sequenza)

source: loop
it_it: ciclo

source: over mutable sequence
it_it: su sequenza mutabile

source: mutable sequence
it_it: sequenza mutabile

source: loop over
it_it: ciclo su

source: immutable
it_it: immutabile

source: tuple
it_it: tupla

source: assignment
it_it: assegnazione

source: append() (sequence method)
it_it: append() (metodo di sequenza)

source: clear() (sequence method)
it_it: clear() (metodo di sequenza)

source: copy() (sequence method)
it_it: copy() (metodo di sequenza)

source: extend() (sequence method)
it_it: extend() (metodo di sequenza)

source: insert() (sequence method)
it_it: insert() (metodo di sequenza)

source: pop() (sequence method)
it_it: pop() (metodo di sequenza)

source: remove() (sequence method)
it_it: remove() (metodo di sequenza)

source: reverse() (sequence method)
it_it: reverse() (metodo di sequenza)

source: string
it_it: stringa

source: text sequence type
it_it: tipo di sequenza di testo

source: str (built-in class)
it_it: str (classe incorporata)

source: (see also string)
it_it: (vedi anche stringa)

source: buffer protocol
it_it: protocollo buffer

source: methods
it_it: metodi

source: universal newlines
it_it: newline universali

source: str.splitlines method
it_it: metodo str.splitlines

source: formatting, string (%)
it_it: formattazione, stringa (%)

source: interpolation, string (%)
it_it: interpolazione, stringa (%)

source: formatting, printf
it_it: formattazione, printf

source: interpolation, printf
it_it: interpolazione, printf

source: printf-style formatting
it_it: formattazione stile printf

source: sprintf-style formatting
it_it: formattazione stile sprintf

source: () (parentheses)
it_it: () (parentesi)

source: in printf-style formatting
it_it: nella formattazione stile printf

source: . (dot)
it_it: . (punto)

source: # (hash)
it_it: # (cancelletto)

source: space
it_it: spazio

source: binary sequence types
it_it: tipi di sequenze binarie

source: bytes.splitlines method
it_it: metodo bytes.splitlines

source: bytearray.splitlines method
it_it: metodo bytearray.splitlines

source: formatting
it_it: formattazione

source: interpolation
it_it: interpolazione

source: dictionary
it_it: dizionario

source: context manager
it_it: gestore di contesto

source: context management protocol
it_it: protocollo di gestione del contesto

source: context management
it_it: gestione del contesto

source: annotation
it_it: annotazione

source: type annotation; type hint
it_it: annotazione di tipo; suggerimento di tipo

source: Generic
it_it: Generico

source: union
it_it: unione

source: method
it_it: metodo

source: code
it_it: codice

source: code object
it_it: oggetto codice

source: compile
it_it: compilare

source: __code__ (function object attribute)
it_it: __code__ (attributo dell'oggetto funzione)

source: ellipsis literal
it_it: letterale ellissi
