Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: Both :class:`set` and :class:`frozenset` support set to set comparisons. Two sets are equal if and only if every element of each set is contained in the other (each is a subset of the other). A set is less than another set if and only if the first set is a proper subset of the second set (is a subset, but is not equal). A set is greater than another set if and only if the first set is a proper superset of the second set (is a superset, but is not equal).
it_it: Sia :class:`set` che :class:`frozenset` supportano confronti tra insiemi. Due insiemi sono uguali se e solo se ogni elemento di ciascun insieme è contenuto nell'altro (ciascuno è un sottoinsieme dell'altro). Un insieme è minore di un altro insieme se e solo se il primo insieme è un sottoinsieme proprio del secondo insieme (è un sottoinsieme, ma non è uguale). Un insieme è maggiore di un altro insieme se e solo se il primo insieme è un superinsieme proprio del secondo insieme (è un superinsieme, ma non è uguale).

source: Instances of :class:`set` are compared to instances of :class:`frozenset` based on their members. For example, ``set('abc') == frozenset('abc')`` returns ``True`` and so does ``set('abc') in set([frozenset('abc')])``.
it_it: Le istanze di :class:`set` sono confrontate con le istanze di :class:`frozenset` basandosi sui loro membri. Ad esempio, ``set('abc') == frozenset('abc')`` restituisce ``True`` e anche ``set('abc') in set([frozenset('abc')])``.

source: The subset and equality comparisons do not generalize to a total ordering function. For example, any two nonempty disjoint sets are not equal and are not subsets of each other, so *all* of the following return ``False``: ``a<b``, ``a==b``, or ``a>b``.
it_it: I confronti di sottoinsieme e uguaglianza non si generalizzano a una funzione di ordinamento totale. Ad esempio, due insiemi non vuoti e disgiunti non sono uguali e non sono sottoinsiemi l'uno dell'altro, quindi *tutti* i seguenti restituiscono ``False``: ``a<b``, ``a==b`` o ``a>b``.

source: Since sets only define partial ordering (subset relationships), the output of the :meth:`list.sort` method is undefined for lists of sets.
it_it: Poiché gli insiemi definiscono solo un ordinamento parziale (relazioni di sottoinsieme), l'output del metodo :meth:`list.sort` è indefinito per le liste di insiemi.

source: Set elements, like dictionary keys, must be :term:`hashable`.
it_it: Gli elementi dell'insieme, come le chiavi del dizionario, devono essere :term:`hashable`.

source: Binary operations that mix :class:`set` instances with :class:`frozenset` return the type of the first operand. For example: ``frozenset('ab') | set('bc')`` returns an instance of :class:`frozenset`.
it_it: Le operazioni binarie che mescolano istanze di :class:`set` con :class:`frozenset` restituiscono il tipo del primo operando. Ad esempio: ``frozenset('ab') | set('bc')`` restituisce un'istanza di :class:`frozenset`.

source: The following table lists operations available for :class:`set` that do not apply to immutable instances of :class:`frozenset`:
it_it: La seguente tabella elenca le operazioni disponibili per :class:`set` che non si applicano alle istanze immutabili di :class:`frozenset`:

source: Update the set, adding elements from all others.
it_it: Aggiornare l'insieme, aggiungendo elementi da tutti gli altri.

source: Update the set, keeping only elements found in it and all others.
it_it: Aggiornare l'insieme, mantenendo solo gli elementi presenti in esso e in tutti gli altri.

source: Update the set, removing elements found in others.
it_it: Aggiornare l'insieme, rimuovendo gli elementi trovati negli altri.

source: Update the set, keeping only elements found in either set, but not in both.
it_it: Aggiornare l'insieme, mantenendo solo gli elementi presenti in un insieme o nell'altro, ma non in entrambi.

source: Add element *elem* to the set.
it_it: Aggiungere l'elemento *elem* all'insieme.

source: Remove element *elem* from the set. Raises :exc:`KeyError` if *elem* is not contained in the set.
it_it: Rimuovere l'elemento *elem* dall'insieme. Solleva :exc:`KeyError` se *elem* non è contenuto nell'insieme.

source: Remove element *elem* from the set if it is present.
it_it: Rimuovere l'elemento *elem* dall'insieme, se presente.

source: Remove and return an arbitrary element from the set. Raises :exc:`KeyError` if the set is empty.
it_it: Rimuovere e restituire un elemento arbitrario dall'insieme. Solleva :exc:`KeyError` se l'insieme è vuoto.

source: Remove all elements from the set.
it_it: Rimuovere tutti gli elementi dall'insieme.

source: Note, the non-operator versions of the :meth:`update`, :meth:`intersection_update`, :meth:`difference_update`, and :meth:`symmetric_difference_update` methods will accept any iterable as an argument.
it_it: Nota, le versioni non operatore dei metodi :meth:`update`, :meth:`intersection_update`, :meth:`difference_update` e :meth:`symmetric_difference_update` accettano qualsiasi iterabile come argomento.

source: Note, the *elem* argument to the :meth:`~object.__contains__`, :meth:`remove`, and :meth:`discard` methods may be a set. To support searching for an equivalent frozenset, a temporary one is created from *elem*.
it_it: Nota, l'argomento *elem* per i metodi :meth:`~object.__contains__`, :meth:`remove` e :meth:`discard` può essere un insieme. Per supportare la ricerca di un frozenset equivalente, uno temporaneo viene creato da *elem*.

source: Mapping Types --- :class:`dict`
it_it: Tipi di Mapping --- :class:`dict`

source: A :term:`mapping` object maps :term:`hashable` values to arbitrary objects. Mappings are mutable objects. There is currently only one standard mapping type, the :dfn:`dictionary`. (For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, and the :mod:`collections` module.)
it_it: Un oggetto :term:`mapping` mappa valori :term:`hashable` a oggetti arbitrari. Le mappature sono oggetti mutabili. Attualmente esiste solo un tipo standard di mappatura, il :dfn:`dizionario`. (Per altri contenitori, vedere le classi incorporate :class:`list`, :class:`set` e :class:`tuple`, e il modulo :mod:`collections`.)

source: A dictionary's keys are *almost* arbitrary values. Values that are not :term:`hashable`, that is, values containing lists, dictionaries or other mutable types (that are compared by value rather than by object identity) may not be used as keys. Values that compare equal (such as ``1``, ``1.0``, and ``True``) can be used interchangeably to index the same dictionary entry.
it_it: Le chiavi di un dizionario sono valori *quasi* arbitrari. Valori che non sono :term:`hashable`, cioè valori che contengono liste, dizionari o altri tipi mutabili (che sono comparati per valore anziché per identità dell'oggetto) non possono essere usati come chiavi. Valori che sono comparati come uguali (come ``1``, ``1.0`` e ``True``) possono essere usati in modo intercambiabile per indicizzare la stessa voce del dizionario.

source: Return a new dictionary initialized from an optional positional argument and a possibly empty set of keyword arguments.
it_it: Restituire un nuovo dizionario inizializzato da un argomento posizionale opzionale e un insieme possibilmente vuoto di argomenti chiave-valore.

source: Dictionaries can be created by several means:
it_it: I dizionari possono essere creati con diversi metodi:

source: Use a comma-separated list of ``key: value`` pairs within braces: ``{'jack': 4098, 'sjoerd': 4127}`` or ``{4098: 'jack', 4127: 'sjoerd'}``
it_it: Utilizzare un elenco separato da virgole di coppie ``chiave: valore`` tra parentesi graffe: ``{'jack': 4098, 'sjoerd': 4127}`` o ``{4098: 'jack', 4127: 'sjoerd'}``

source: Use a dict comprehension: ``{}``, ``{x: x ** 2 for x in range(10)}``
it_it: Usare una comprensione del dizionario: ``{}``, ``{x: x ** 2 per x in range(10)}``

source: Use the type constructor: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``
it_it: Utilizzare il costruttore di tipi: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``

source: If no positional argument is given, an empty dictionary is created. If a positional argument is given and it is a mapping object, a dictionary is created with the same key-value pairs as the mapping object. Otherwise, the positional argument must be an :term:`iterable` object. Each item in the iterable must itself be an iterable with exactly two objects. The first object of each item becomes a key in the new dictionary, and the second object the corresponding value. If a key occurs more than once, the last value for that key becomes the corresponding value in the new dictionary.
it_it: Se non viene fornito alcun argomento posizionale, viene creato un dizionario vuoto. Se viene fornito un argomento posizionale ed è un oggetto di mappatura, viene creato un dizionario con le stesse coppie chiave-valore dell'oggetto di mappatura. Altrimenti, l'argomento posizionale deve essere un oggetto :term:`iterable`. Ogni elemento dell'iterabile deve essere esso stesso un iterabile con esattamente due oggetti. Il primo oggetto di ciascun elemento diventa una chiave nel nuovo dizionario e il secondo oggetto il valore corrispondente. Se una chiave si presenta più di una volta, l'ultimo valore per quella chiave diventa il valore corrispondente nel nuovo dizionario.

source: If keyword arguments are given, the keyword arguments and their values are added to the dictionary created from the positional argument. If a key being added is already present, the value from the keyword argument replaces the value from the positional argument.
it_it: Se vengono forniti argomenti chiave-valore, gli argomenti chiave-valore e i loro valori vengono aggiunti al dizionario creato dall'argomento posizionale. Se una chiave aggiunta è già presente, il valore dall'argomento chiave-valore sostituisce il valore dall'argomento posizionale.

source: To illustrate, the following examples all return a dictionary equal to ``{"one": 1, "two": 2, "three": 3}``::
it_it: Per illustrare, i seguenti esempi restituiscono tutti un dizionario uguale a ``{"one": 1, "two": 2, "three": 3}``::

source: Providing keyword arguments as in the first example only works for keys that are valid Python identifiers. Otherwise, any valid keys can be used.
it_it: Fornire argomenti chiave-valore come nel primo esempio funziona solo per chiavi che sono identificatori Python validi. Altrimenti, è possibile utilizzare qualsiasi chiave valida.

source: These are the operations that dictionaries support (and therefore, custom mapping types should support too):
it_it: Queste sono le operazioni che i dizionari supportano (e che quindi, anche i tipi di mappatura personalizzati dovrebbero supportare):

source: Return a list of all the keys used in the dictionary *d*.
it_it: Restituire un elenco di tutte le chiavi utilizzate nel dizionario *d*.

source: Return the number of items in the dictionary *d*.
it_it: Restituire il numero di voci nel dizionario *d*.

source: Return the item of *d* with key *key*. Raises a :exc:`KeyError` if *key* is not in the map.
it_it: Restituire la voce di *d* con chiave *key*. Solleva un'eccezione :exc:`KeyError` se *key* non è nella mappa.

source: If a subclass of dict defines a method :meth:`__missing__` and *key* is not present, the ``d[key]`` operation calls that method with the key *key* as argument. The ``d[key]`` operation then returns or raises whatever is returned or raised by the ``__missing__(key)`` call. No other operations or methods invoke :meth:`__missing__`. If :meth:`__missing__` is not defined, :exc:`KeyError` is raised. :meth:`__missing__` must be a method; it cannot be an instance variable::
it_it: Se una sottoclasse di dict definisce un metodo :meth:`__missing__` e *key* non è presente, l'operazione ``d[key]`` chiama quel metodo con la chiave *key* come argomento. L'operazione ``d[key]`` quindi restituisce o solleva qualunque cosa venga restituita o sollevata dalla chiamata ``__missing__(key)``. Nessun'altra operazione o metodo invoca :meth:`__missing__`. Se :meth:`__missing__` non è definito, viene sollevata un'eccezione :exc:`KeyError`. :meth:`__missing__` deve essere un metodo; non può essere una variabile di istanza::

source: The example above shows part of the implementation of :class:`collections.Counter`. A different ``__missing__`` method is used by :class:`collections.defaultdict`.
it_it: L'esempio sopra mostra parte dell'implementazione di :class:`collections.Counter`. Un diverso metodo ``__missing__`` è utilizzato da :class:`collections.defaultdict`.

source: Set ``d[key]`` to *value*.
it_it: Impostare ``d[key]`` su *value*.

source: Remove ``d[key]`` from *d*. Raises a :exc:`KeyError` if *key* is not in the map.
it_it: Rimuovere ``d[key]`` da *d*. Solleva una :exc:`KeyError` se *key* non è nella mappa.

source: Return ``True`` if *d* has a key *key*, else ``False``.
it_it: Restituire ``True`` se *d* ha una chiave *key*, altrimenti ``False``.

source: Equivalent to ``not key in d``.
it_it: Equivalente a ``not key in d``.

source: Return an iterator over the keys of the dictionary. This is a shortcut for ``iter(d.keys())``.
it_it: Restituire un iteratore sulle chiavi del dizionario. Questo è un collegamento a ``iter(d.keys())``.

source: Remove all items from the dictionary.
it_it: Rimuovere tutte le voci dal dizionario.

source: Return a shallow copy of the dictionary.
it_it: Restituisce una copia superficiale del dizionario.

source: Create a new dictionary with keys from *iterable* and values set to *value*.
it_it: Crea un nuovo dizionario con chiavi da *iterable* e valori impostati su *value*.

source: :meth:`fromkeys` is a class method that returns a new dictionary. *value* defaults to ``None``. All of the values refer to just a single instance, so it generally doesn't make sense for *value* to be a mutable object such as an empty list. To get distinct values, use a :ref:`dict comprehension <dict>` instead.
it_it: :meth:`fromkeys` è un metodo di classe che restituisce un nuovo dizionario. *value* predefinito è ``None``. Tutti i valori si riferiscono a una singola istanza, quindi generalmente non ha senso che *value* sia un oggetto mutabile come una lista vuota. Per ottenere valori distinti, utilizzare invece una :ref:`dict comprehension <dict>`.

source: Return the value for *key* if *key* is in the dictionary, else *default*. If *default* is not given, it defaults to ``None``, so that this method never raises a :exc:`KeyError`.
it_it: Restituisce il valore per *key* se *key* è nel dizionario, altrimenti *default*. Se *default* non è fornito, predefinito è ``None``, in modo che questo metodo non sollevi mai una :exc:`KeyError`.

source: Return a new view of the dictionary's items (``(key, value)`` pairs). See the :ref:`documentation of view objects <dict-views>`.
it_it: Restituisce una nuova vista degli elementi del dizionario (coppie ``(key, value)``). Vedi la :ref:`documentazione degli oggetti view <dict-views>`.

source: Return a new view of the dictionary's keys. See the :ref:`documentation of view objects <dict-views>`.
it_it: Restituisce una nuova vista delle chiavi del dizionario. Vedi la :ref:`documentazione degli oggetti view <dict-views>`.

source: If *key* is in the dictionary, remove it and return its value, else return *default*. If *default* is not given and *key* is not in the dictionary, a :exc:`KeyError` is raised.
it_it: Se *key* è nel dizionario, rimuovilo e restituisci il suo valore, altrimenti restituisci *default*. Se *default* non è fornito e *key* non è nel dizionario, viene sollevata una :exc:`KeyError`.

source: Remove and return a ``(key, value)`` pair from the dictionary. Pairs are returned in :abbr:`LIFO (last-in, first-out)` order.
it_it: Rimuove e restituisce una coppia ``(key, value)`` dal dizionario. Le coppie sono restituite in ordine :abbr:`LIFO (last-in, first-out)`.

source: :meth:`popitem` is useful to destructively iterate over a dictionary, as often used in set algorithms. If the dictionary is empty, calling :meth:`popitem` raises a :exc:`KeyError`.
it_it: :meth:`popitem` è utile per iterare distruttivamente su un dizionario, come spesso utilizzato negli algoritmi di set. Se il dizionario è vuoto, chiamare :meth:`popitem` solleva una :exc:`KeyError`.

source: LIFO order is now guaranteed. In prior versions, :meth:`popitem` would return an arbitrary key/value pair.
it_it: L'ordine LIFO è ora garantito. Nelle versioni precedenti, :meth:`popitem` avrebbe restituito una coppia chiave/valore arbitraria.

source: Return a reverse iterator over the keys of the dictionary. This is a shortcut for ``reversed(d.keys())``.
it_it: Restituisce un iteratore inverso sulle chiavi del dizionario. Questo è un collegamento rapido per ``reversed(d.keys())``.

source: If *key* is in the dictionary, return its value. If not, insert *key* with a value of *default* and return *default*. *default* defaults to ``None``.
it_it: Se *key* è nel dizionario, restituisce il suo valore. Se non lo è, inserisce *key* con un valore di *default* e restituisce *default*. *default* predefinito è ``None``.

source: Update the dictionary with the key/value pairs from *other*, overwriting existing keys. Return ``None``.
it_it: Aggiorna il dizionario con le coppie chiave/valore da *other*, sovrascrivendo le chiavi esistenti. Restituisce ``None``.

source: :meth:`update` accepts either another dictionary object or an iterable of key/value pairs (as tuples or other iterables of length two). If keyword arguments are specified, the dictionary is then updated with those key/value pairs: ``d.update(red=1, blue=2)``.
it_it: :meth:`update` accetta un altro oggetto dizionario o un iterabile di coppie chiave/valore (come tuple o altri iterabili di lunghezza due). Se vengono specificati argomenti di parole chiave, il dizionario viene quindi aggiornato con quelle coppie chiave/valore: ``d.update(red=1, blue=2)``.

source: Return a new view of the dictionary's values. See the :ref:`documentation of view objects <dict-views>`.
it_it: Restituisce una nuova vista dei valori del dizionario. Vedi la :ref:`documentazione degli oggetti view <dict-views>`.

source: An equality comparison between one ``dict.values()`` view and another will always return ``False``. This also applies when comparing ``dict.values()`` to itself::
it_it: Un confronto di uguaglianza tra una vista ``dict.values()`` e un'altra restituirà sempre ``False``. Questo vale anche quando si confronta ``dict.values()`` con se stesso::

source: Create a new dictionary with the merged keys and values of *d* and *other*, which must both be dictionaries. The values of *other* take priority when *d* and *other* share keys.
it_it: Crea un nuovo dizionario con le chiavi e i valori uniti di *d* e *other*, che devono essere entrambi dizionari. I valori di *other* hanno la priorità quando *d* e *other* condividono chiavi.

source: Update the dictionary *d* with keys and values from *other*, which may be either a :term:`mapping` or an :term:`iterable` of key/value pairs. The values of *other* take priority when *d* and *other* share keys.
it_it: Aggiorna il dizionario *d* con chiavi e valori da *other*, che può essere un :term:`mapping` o un :term:`iterable` di coppie chiave/valore. I valori di *other* hanno la priorità quando *d* e *other* condividono chiavi.

source: Dictionaries compare equal if and only if they have the same ``(key, value)`` pairs (regardless of ordering). Order comparisons ('<', '<=', '>=', '>') raise :exc:`TypeError`.
it_it: I dizionari si confrontano uguali se e solo se hanno le stesse coppie ``(key, value)`` (indipendentemente dall'ordinamento). I confronti di ordine ('<', '<=', '>=', '>') sollevano :exc:`TypeError`.

source: Dictionaries preserve insertion order. Note that updating a key does not affect the order. Keys added after deletion are inserted at the end. ::
it_it: I dizionari preservano l'ordine di inserimento. Nota che aggiornare una chiave non influenza l'ordine. Le chiavi aggiunte dopo la cancellazione vengono inserite alla fine. ::

source: Dictionary order is guaranteed to be insertion order. This behavior was an implementation detail of CPython from 3.6.
it_it: L'ordine del dizionario è garantito essere l'ordine di inserimento. Questo comportamento era un dettaglio di implementazione di CPython dalla versione 3.6.

source: Dictionaries and dictionary views are reversible. ::
it_it: I dizionari e le viste del dizionario sono reversibili. ::

source: Dictionaries are now reversible.
it_it: I dizionari sono ora reversibili.

source: :class:`types.MappingProxyType` can be used to create a read-only view of a :class:`dict`.
it_it: :class:`types.MappingProxyType` può essere utilizzato per creare una vista di sola lettura di un :class:`dict`.

source: Dictionary view objects
it_it: Oggetti vista del dizionario

source: The objects returned by :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` are *view objects*. They provide a dynamic view on the dictionary's entries, which means that when the dictionary changes, the view reflects these changes.
it_it: Gli oggetti restituiti da :meth:`dict.keys`, :meth:`dict.values` e :meth:`dict.items` sono *oggetti vista*. Forniscono una vista dinamica sulle voci del dizionario, il che significa che quando il dizionario cambia, la vista riflette questi cambiamenti.

source: Dictionary views can be iterated over to yield their respective data, and support membership tests:
it_it: Le viste del dizionario possono essere iterate per restituire i rispettivi dati e supportano i test di appartenenza:

source: Return the number of entries in the dictionary.
it_it: Restituisce il numero di voci nel dizionario.

source: Return an iterator over the keys, values or items (represented as tuples of ``(key, value)``) in the dictionary.
it_it: Restituisce un iteratore sulle chiavi, valori o elementi (rappresentati come tuple ``(key, value)``) nel dizionario.

source: Keys and values are iterated over in insertion order. This allows the creation of ``(value, key)`` pairs using :func:`zip`: ``pairs = zip(d.values(), d.keys())``. Another way to create the same list is ``pairs = [(v, k) for (k, v) in d.items()]``.
it_it: Le chiavi e i valori sono iterati in ordine di inserimento. Questo permette la creazione di coppie ``(value, key)`` usando :func:`zip`: ``pairs = zip(d.values(), d.keys())``. Un altro modo per creare la stessa lista è ``pairs = [(v, k) for (k, v) in d.items()]``.

source: Iterating views while adding or deleting entries in the dictionary may raise a :exc:`RuntimeError` or fail to iterate over all entries.
it_it: Le viste di iterazione durante l'aggiunta o l'eliminazione di voci nel dizionario possono sollevare una :exc:`RuntimeError` o fallire nell'iterare su tutte le voci.

source: Dictionary order is guaranteed to be insertion order.
it_it: L'ordine del dizionario è garantito essere l'ordine di inserimento.

source: Return ``True`` if *x* is in the underlying dictionary's keys, values or items (in the latter case, *x* should be a ``(key, value)`` tuple).
it_it: Restituisce ``True`` se *x* è nelle chiavi, valori o elementi del dizionario sottostante (in quest'ultimo caso, *x* deve essere una tupla ``(key, value)``).

source: Return a reverse iterator over the keys, values or items of the dictionary. The view will be iterated in reverse order of the insertion.
it_it: Restituisce un iteratore inverso sulle chiavi, valori o elementi del dizionario. La vista verrà iterata in ordine inverso rispetto all'inserimento.

source: Dictionary views are now reversible.
it_it: Le viste del dizionario sono ora reversibili.
