Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: The user-exposed type for the union object can be accessed from :data:`types.UnionType` and used for :func:`isinstance` checks. An object cannot be instantiated from the type::
it_it: Il tipo esposto all'utente per l'oggetto unione può essere accessibile da :data:`types.UnionType` e utilizzato per i controlli :func:`isinstance`. Un oggetto non può essere istanziato dal tipo::

source: The :meth:`!__or__` method for type objects was added to support the syntax ``X | Y``. If a metaclass implements :meth:`!__or__`, the Union may override it:
it_it: Il metodo :meth:`!__or__` per gli oggetti di tipo è stato aggiunto per supportare la sintassi ``X | Y``. Se una metaclasse implementa :meth:`!__or__`, l'Unione può sovrascriverlo:

source: :pep:`604` -- PEP proposing the ``X | Y`` syntax and the Union type.
it_it: :pep:`604` -- PEP che propone la sintassi ``X | Y`` e il tipo Unione.

source: Other Built-in Types
it_it: Altri Tipi Integrati

source: The interpreter supports several other kinds of objects. Most of these support only one or two operations.
it_it: L'interprete supporta diversi altri tipi di oggetti. La maggior parte di questi supporta solo una o due operazioni.

source: Modules
it_it: Moduli

source: The only special operation on a module is attribute access: ``m.name``, where *m* is a module and *name* accesses a name defined in *m*'s symbol table. Module attributes can be assigned to. (Note that the :keyword:`import` statement is not, strictly speaking, an operation on a module object; ``import foo`` does not require a module object named *foo* to exist, rather it requires an (external) *definition* for a module named *foo* somewhere.)
it_it: L'unica operazione speciale su un modulo è l'accesso agli attributi: ``m.name``, dove *m* è un modulo e *name* accede a un nome definito nella tabella dei simboli di *m*. Gli attributi del modulo possono essere assegnati. (Nota che l'istruzione :keyword:`import` non è, strettamente parlando, un'operazione su un oggetto modulo; ``import foo`` non richiede che esista un oggetto modulo chiamato *foo*, ma richiede una *definizione* (esterna) per un modulo denominato *foo* da qualche parte.)

source: A special attribute of every module is :attr:`~object.__dict__`. This is the dictionary containing the module's symbol table. Modifying this dictionary will actually change the module's symbol table, but direct assignment to the :attr:`~object.__dict__` attribute is not possible (you can write ``m.__dict__['a'] = 1``, which defines ``m.a`` to be ``1``, but you can't write ``m.__dict__ = {}``). Modifying :attr:`~object.__dict__` directly is not recommended.
it_it: Un attributo speciale di ogni modulo è :attr:`~object.__dict__`. Questo è il dizionario contenente la tabella dei simboli del modulo. La modifica di questo dizionario cambierà effettivamente la tabella dei simboli del modulo, ma l'assegnazione diretta all'attributo :attr:`~object.__dict__` non è possibile (puoi scrivere ``m.__dict__['a'] = 1``, che definisce ``m.a`` come ``1``, ma non puoi scrivere ``m.__dict__ = {}``). Modificare direttamente :attr:`~object.__dict__` non è consigliato.

source: Modules built into the interpreter are written like this: ``<module 'sys' (built-in)>``. If loaded from a file, they are written as ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.
it_it: I moduli integrati nell'interprete sono scritti così: ``<module 'sys' (built-in)>``. Se caricati da un file, sono scritti come ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.

source: Classes and Class Instances
it_it: Classi e Istanze di Classe

source: See :ref:`objects` and :ref:`class` for these.
it_it: Vedi :ref:`objects` e :ref:`class` per questi.

source: Functions
it_it: Funzioni

source: Function objects are created by function definitions. The only operation on a function object is to call it: ``func(argument-list)``.
it_it: Gli oggetti funzione sono creati dalle definizioni di funzione. L'unica operazione su un oggetto funzione è chiamarlo: ``func(lista-argomenti)``.

source: There are really two flavors of function objects: built-in functions and user-defined functions. Both support the same operation (to call the function), but the implementation is different, hence the different object types.
it_it: Esistono realmente due tipi di oggetti funzione: funzioni integrate e funzioni definite dall'utente. Entrambi supportano la stessa operazione (chiamare la funzione), ma l'implementazione è diversa, da cui i diversi tipi di oggetti.

source: See :ref:`function` for more information.
it_it: Vedi :ref:`function` per ulteriori informazioni.

source: Methods
it_it: Metodi

source: Methods are functions that are called using the attribute notation. There are two flavors: :ref:`built-in methods <builtin-methods>` (such as :meth:`append` on lists) and :ref:`class instance method <instance-methods>`. Built-in methods are described with the types that support them.
it_it: I metodi sono funzioni chiamate utilizzando la notazione degli attributi. Ci sono due tipi: :ref:`metodi integrati <builtin-methods>` (come :meth:`append` su liste) e :ref:`metodi delle istanze di classe <instance-methods>`. I metodi integrati sono descritti con i tipi che li supportano.

source: If you access a method (a function defined in a class namespace) through an instance, you get a special object: a :dfn:`bound method` (also called :ref:`instance method <instance-methods>`) object. When called, it will add the ``self`` argument to the argument list. Bound methods have two special read-only attributes: :attr:`m.__self__ <method.__self__>` is the object on which the method operates, and :attr:`m.__func__ <method.__func__>` is the function implementing the method. Calling ``m(arg-1, arg-2, ..., arg-n)`` is completely equivalent to calling ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.
it_it: Se accedi a un metodo (una funzione definita in uno spazio dei nomi di una classe) tramite un'istanza, ottieni un oggetto speciale: un oggetto :dfn:`metodo vincolato` (anche chiamato :ref:`metodo istanza <instance-methods>`). Quando viene chiamato, aggiungerà l'argomento ``self`` all'elenco degli argomenti. I metodi vincolati hanno due attributi speciali di sola lettura: :attr:`m.__self__ <method.__self__>` è l'oggetto su cui il metodo opera, e :attr:`m.__func__ <method.__func__>` è la funzione che implementa il metodo. Chiamare ``m(arg-1, arg-2, ..., arg-n)`` è completamente equivalente a chiamare ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.

source: Like :ref:`function objects <user-defined-funcs>`, bound method objects support getting arbitrary attributes. However, since method attributes are actually stored on the underlying function object (:attr:`method.__func__`), setting method attributes on bound methods is disallowed. Attempting to set an attribute on a method results in an :exc:`AttributeError` being raised. In order to set a method attribute, you need to explicitly set it on the underlying function object:
it_it: Come :ref:`oggetti funzione <user-defined-funcs>`, gli oggetti metodo vincolati supportano l'acquisizione di attributi arbitrari. Tuttavia, poiché gli attributi del metodo sono effettivamente memorizzati sull'oggetto funzione sottostante (:attr:`method.__func__`), impostare attributi del metodo sui metodi vincolati non è consentito. Il tentativo di impostare un attributo su un metodo provoca il sollevamento di un'eccezione :exc:`AttributeError`. Per impostare un attributo del metodo, devi esplicitamente impostarlo sull'oggetto funzione sottostante:

source: See :ref:`instance-methods` for more information.
it_it: Vedi :ref:`instance-methods` per ulteriori informazioni.

source: Code Objects
it_it: Oggetti Codice

source: Code objects are used by the implementation to represent "pseudo-compiled" executable Python code such as a function body. They differ from function objects because they don't contain a reference to their global execution environment. Code objects are returned by the built-in :func:`compile` function and can be extracted from function objects through their :attr:`~function.__code__` attribute. See also the :mod:`code` module.
it_it: Gli oggetti codice sono utilizzati dall'implementazione per rappresentare il codice Python "pseudo-compilato" eseguibile come il corpo di una funzione. Differiscono dagli oggetti funzione perché non contengono un riferimento al loro ambiente di esecuzione globale. Gli oggetti codice sono restituiti dalla funzione integrata :func:`compile` e possono essere estratti dagli oggetti funzione attraverso il loro attributo :attr:`~function.__code__`. Vedi anche il modulo :mod:`code`.

source: Accessing :attr:`~function.__code__` raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``"__code__"``.
it_it: L'accesso a :attr:`~function.__code__` solleva un :ref:`evento di auditing <auditing>` ``object.__getattr__`` con argomenti ``obj`` e ``"__code__"``.

source: A code object can be executed or evaluated by passing it (instead of a source string) to the :func:`exec` or :func:`eval` built-in functions.
it_it: Un oggetto codice può essere eseguito o valutato passandolo (anziché una stringa sorgente) alle funzioni integrate :func:`exec` o :func:`eval`.

source: See :ref:`types` for more information.
it_it: Vedi :ref:`types` per ulteriori informazioni.

source: Type Objects
it_it: Oggetti Tipo

source: Type objects represent the various object types. An object's type is accessed by the built-in function :func:`type`. There are no special operations on types. The standard module :mod:`types` defines names for all standard built-in types.
it_it: Gli oggetti tipo rappresentano i vari tipi di oggetto. Il tipo di un oggetto è accessibile tramite la funzione integrata :func:`type`. Non ci sono operazioni speciali sui tipi. Il modulo standard :mod:`types` definisce nomi per tutti i tipi integrati standard.

source: Types are written like this: ``<class 'int'>``.
it_it: I tipi sono scritti così: ``<class 'int'>``.

source: The Null Object
it_it: L'Oggetto Null

source: This object is returned by functions that don't explicitly return a value. It supports no special operations. There is exactly one null object, named ``None`` (a built-in name). ``type(None)()`` produces the same singleton.
it_it: Questo oggetto è restituito da funzioni che non restituiscono esplicitamente un valore. Non supporta operazioni speciali. C'è esattamente un oggetto null, chiamato ``None`` (un nome integrato). ``type(None)()`` produce lo stesso singleton.

source: It is written as ``None``.
it_it: È scritto come ``None``.

source: The Ellipsis Object
it_it: L'Oggetto Ellipsis

source: This object is commonly used by slicing (see :ref:`slicings`). It supports no special operations. There is exactly one ellipsis object, named :const:`Ellipsis` (a built-in name). ``type(Ellipsis)()`` produces the :const:`Ellipsis` singleton.
it_it: Questo oggetto è comunemente usato dall'operatore di slicing (vedi :ref:`slicings`). Non supporta operazioni speciali. C'è esattamente un oggetto ellissi, chiamato :const:`Ellipsis` (un nome integrato). ``type(Ellipsis)()`` produce il singleton :const:`Ellipsis`.

source: It is written as ``Ellipsis`` or ``...``.
it_it: È scritto come ``Ellipsis`` o ``...``.

source: The NotImplemented Object
it_it: L'Oggetto NotImplemented

source: This object is returned from comparisons and binary operations when they are asked to operate on types they don't support. See :ref:`comparisons` for more information. There is exactly one :data:`NotImplemented` object. :code:`type(NotImplemented)()` produces the singleton instance.
it_it: Questo oggetto è restituito da confronti e operazioni binarie quando questi sono richiesti di operare su tipi che non supportano. Vedi :ref:`comparisons` per maggiori informazioni. C'è esattamente un oggetto :data:`NotImplemented`. :code:`type(NotImplemented)()` produce l'istanza singleton.

source: It is written as :code:`NotImplemented`.
it_it: È scritto come :code:`NotImplemented`.

source: Internal Objects
it_it: Oggetti Interni

source: See :ref:`types` for this information. It describes :ref:`stack frame objects <frame-objects>`, :ref:`traceback objects <traceback-objects>`, and slice objects.
it_it: Vedi :ref:`types` per queste informazioni. Descrive :ref:`stack frame objects <frame-objects>`, :ref:`traceback objects <traceback-objects>`, e oggetti slice.

source: Special Attributes
it_it: Attributi Speciali

source: The implementation adds a few special read-only attributes to several object types, where they are relevant. Some of these are not reported by the :func:`dir` built-in function.
it_it: L'implementazione aggiunge alcuni attributi speciali di sola lettura a diversi tipi di oggetti, ove rilevanti. Alcuni di questi non sono riportati dalla funzione integrata :func:`dir`.

source: A dictionary or other mapping object used to store an object's (writable) attributes.
it_it: Un dizionario o altro oggetto di mappatura usato per memorizzare gli attributi (scrivibili) di un oggetto.

source: The class to which a class instance belongs.
it_it: La classe a cui appartiene un'istanza di classe.

source: The tuple of base classes of a class object.
it_it: La tupla delle classi base di un oggetto classe.

source: The name of the class, function, method, descriptor, or generator instance.
it_it: Il nome della classe, funzione, metodo, descrittore o istanza del generatore.

source: The :term:`qualified name` of the class, function, method, descriptor, or generator instance.
it_it: Il :term:`qualified name` della classe, funzione, metodo, descrittore o istanza del generatore.

source: The :ref:`type parameters <type-params>` of generic classes, functions, and :ref:`type aliases <type-aliases>`.
it_it: I :ref:`parametri di tipo <type-params>` delle classi generiche, funzioni e :ref:`alias di tipo <type-aliases>`.

source: This attribute is a tuple of classes that are considered when looking for base classes during method resolution.
it_it: Questo attributo è una tupla di classi che sono considerate quando si cercano classi base durante la risoluzione dei metodi.

source: This method can be overridden by a metaclass to customize the method resolution order for its instances. It is called at class instantiation, and its result is stored in :attr:`~class.__mro__`.
it_it: Questo metodo può essere sovrascritto da una metaclasse per personalizzare l'ordine di risoluzione dei metodi per le sue istanze. È chiamato durante l'istanza della classe, e il suo risultato è memorizzato in :attr:`~class.__mro__`.

source: Each class keeps a list of weak references to its immediate subclasses. This method returns a list of all those references still alive. The list is in definition order. Example::
it_it: Ogni classe mantiene un elenco di riferimenti deboli alle sue sottoclassi immediate. Questo metodo restituisce un elenco di tutti quei riferimenti ancora vivi. L'elenco è in ordine di definizione. Esempio::

source: Integer string conversion length limitation
it_it: Limitazione della lunghezza di conversione delle stringhe di interi

source: CPython has a global limit for converting between :class:`int` and :class:`str` to mitigate denial of service attacks. This limit *only* applies to decimal or other non-power-of-two number bases. Hexadecimal, octal, and binary conversions are unlimited. The limit can be configured.
it_it: CPython ha un limite globale per la conversione tra :class:`int` e :class:`str` per mitigare gli attacchi denial of service. Questo limite *si applica solo* alle basi decimali o ad altre basi numeriche non potenze di due. Le conversioni esadecimali, ottali e binarie sono illimitate. Il limite può essere configurato.

source: The :class:`int` type in CPython is an arbitrary length number stored in binary form (commonly known as a "bignum"). There exists no algorithm that can convert a string to a binary integer or a binary integer to a string in linear time, *unless* the base is a power of 2. Even the best known algorithms for base 10 have sub-quadratic complexity. Converting a large value such as ``int('1' * 500_000)`` can take over a second on a fast CPU.
it_it: Il tipo :class:`int` in CPython è un numero di lunghezza arbitraria memorizzato in forma binaria (comunemente noto come "bignum"). Non esiste alcun algoritmo che possa convertire una stringa in un intero binario o un intero binario in una stringa in tempo lineare, *a meno che* la base non sia una potenza di 2. Anche i migliori algoritmi conosciuti per la base 10 hanno una complessità sub-quadratica. La conversione di un valore grande come ``int('1' * 500_000)`` può richiedere più di un secondo su una CPU veloce.

source: Limiting conversion size offers a practical way to avoid :cve:`2020-10735`.
it_it: Limitare la dimensione della conversione offre un modo pratico per evitare :cve:`2020-10735`.

source: The limit is applied to the number of digit characters in the input or output string when a non-linear conversion algorithm would be involved. Underscores and the sign are not counted towards the limit.
it_it: Il limite si applica al numero di caratteri numerici nella stringa di input o output quando sarebbe coinvolto un algoritmo di conversione non lineare. Gli underscore e il segno non vengono contati ai fini del limite.

source: When an operation would exceed the limit, a :exc:`ValueError` is raised:
it_it: Quando un'operazione supererebbe il limite, viene sollevata un'eccezione :exc:`ValueError`:

source: The default limit is 4300 digits as provided in :data:`sys.int_info.default_max_str_digits <sys.int_info>`. The lowest limit that can be configured is 640 digits as provided in :data:`sys.int_info.str_digits_check_threshold <sys.int_info>`.
it_it: Il limite predefinito è di 4300 cifre come indicato in :data:`sys.int_info.default_max_str_digits <sys.int_info>`. Il limite più basso che può essere configurato è 640 cifre come indicato in :data:`sys.int_info.str_digits_check_threshold <sys.int_info>`.

source: Verification:
it_it: Verifica:

source: Affected APIs
it_it: API influenzate

source: The limitation only applies to potentially slow conversions between :class:`int` and :class:`str` or :class:`bytes`:
it_it: La limitazione si applica solo alle conversioni potenzialmente lente tra :class:`int` e :class:`str` o :class:`bytes`:

source: ``int(string)`` with default base 10.
it_it: ``int(string)`` con base predefinita 10.

source: ``int(string, base)`` for all bases that are not a power of 2.
it_it: ``int(string, base)`` per tutte le basi che non sono una potenza di 2.

source: any other string conversion to base 10, for example ``f"{integer}"``, ``"{}".format(integer)``, or ``b"%d" % integer``.
it_it: qualsiasi altra conversione di stringhe in base 10, ad esempio ``f"{integer}"``, ``"{}".format(integer)``, o ``b"%d" % integer``.

source: The limitations do not apply to functions with a linear algorithm:
it_it: Le limitazioni non si applicano alle funzioni con un algoritmo lineare:

source: ``int(string, base)`` with base 2, 4, 8, 16, or 32.
it_it: ``int(string, base)`` con base 2, 4, 8, 16 o 32.

source: :func:`int.from_bytes` and :func:`int.to_bytes`.
it_it: :func:`int.from_bytes` e :func:`int.to_bytes`.

source: :ref:`formatspec` for hex, octal, and binary numbers.
it_it: :ref:`formatspec` per i numeri esadecimali, ottali e binari.

source: :class:`str` to :class:`float`.
it_it: :class:`str` a :class:`float`.

source: :class:`str` to :class:`decimal.Decimal`.
it_it: :class:`str` a :class:`decimal.Decimal`.

source: Configuring the limit
it_it: Configurazione del limite

source: Before Python starts up you can use an environment variable or an interpreter command line flag to configure the limit:
it_it: Prima dell'avvio di Python, è possibile utilizzare una variabile d'ambiente o un flag da linea di comando dell'interprete per configurare il limite:

source: :envvar:`PYTHONINTMAXSTRDIGITS`, e.g. ``PYTHONINTMAXSTRDIGITS=640 python3`` to set the limit to 640 or ``PYTHONINTMAXSTRDIGITS=0 python3`` to disable the limitation.
it_it: :envvar:`PYTHONINTMAXSTRDIGITS`, ad es. ``PYTHONINTMAXSTRDIGITS=640 python3`` per impostare il limite a 640 o ``PYTHONINTMAXSTRDIGITS=0 python3`` per disabilitare la limitazione.

source: :option:`-X int_max_str_digits <-X>`, e.g. ``python3 -X int_max_str_digits=640``
it_it: :option:`-X int_max_str_digits <-X>`, ad es. ``python3 -X int_max_str_digits=640``

source: :data:`sys.flags.int_max_str_digits` contains the value of :envvar:`PYTHONINTMAXSTRDIGITS` or :option:`-X int_max_str_digits <-X>`. If both the env var and the ``-X`` option are set, the ``-X`` option takes precedence. A value of *-1* indicates that both were unset, thus a value of :data:`sys.int_info.default_max_str_digits` was used during initialization.
it_it: :data:`sys.flags.int_max_str_digits` contiene il valore di :envvar:`PYTHONINTMAXSTRDIGITS` o :option:`-X int_max_str_digits <-X>`. Se sia la variabile d'ambiente che l'opzione ``-X`` sono impostate, l'opzione ``-X`` ha la precedenza. Un valore di *-1* indica che entrambi non erano impostati, quindi durante l'inizializzazione è stato utilizzato un valore di :data:`sys.int_info.default_max_str_digits`.

source: From code, you can inspect the current limit and set a new one using these :mod:`sys` APIs:
it_it: Dal codice, puoi ispezionare il limite corrente e impostarne uno nuovo utilizzando queste API del modulo :mod:`sys`:

source: :func:`sys.get_int_max_str_digits` and :func:`sys.set_int_max_str_digits` are a getter and setter for the interpreter-wide limit. Subinterpreters have their own limit.
it_it: :func:`sys.get_int_max_str_digits` e :func:`sys.set_int_max_str_digits` sono un getter e un setter per il limite a livello dell'interprete. I sotto-interpreti hanno il proprio limite.

source: Information about the default and minimum can be found in :data:`sys.int_info`:
it_it: Informazioni sul predefinito e sul minimo possono essere trovate in :data:`sys.int_info`:

source: :data:`sys.int_info.default_max_str_digits <sys.int_info>` is the compiled-in default limit.
it_it: :data:`sys.int_info.default_max_str_digits <sys.int_info>` è il limite predefinito compilato.

source: :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` is the lowest accepted value for the limit (other than 0 which disables it).
it_it: :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` è il valore minimo accettato per il limite (ad eccezione di 0 che lo disabilita).

source: Setting a low limit *can* lead to problems. While rare, code exists that contains integer constants in decimal in their source that exceed the minimum threshold. A consequence of setting the limit is that Python source code containing decimal integer literals longer than the limit will encounter an error during parsing, usually at startup time or import time or even at installation time - anytime an up to date ``.pyc`` does not already exist for the code. A workaround for source that contains such large constants is to convert them to ``0x`` hexadecimal form as it has no limit.
it_it: Impostare un limite basso *può* portare a problemi. Sebbene raro, esiste del codice che contiene costanti intere in decimale nel loro sorgente che superano la soglia minima. Una conseguenza dell'impostazione del limite è che il codice sorgente Python contenente letterali interi decimali più lunghi del limite incontrerà un errore durante l'analisi, solitamente all'avvio o al momento dell'importazione o anche durante l'installazione - ogni volta che un ``.pyc`` non aggiornato non esiste già per il codice. Un workaround per il sorgente che contiene tali costanti grandi è convertirle in forma esadecimale ``0x`` poiché non ha limite.
