Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: Return a copy of the string where all tab characters are replaced by one or more spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* characters (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the string, the current column is set to zero and the string is examined character by character. If the character is a tab (``\t``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the character is a newline (``\n``) or return (``\r``), it is copied and the current column is reset to zero. Any other character is copied unchanged and the current column is incremented by one regardless of how the character is represented when printed.
it_it: Restituisce una copia della stringa in cui tutti i caratteri di tabulazione sono sostituiti da uno o più spazi, a seconda della colonna corrente e della dimensione della tabulazione specificata. Le posizioni delle tabulazioni si verificano ogni *tabsize* caratteri (il default è 8, dando posizioni delle tabulazioni alle colonne 0, 8, 16 e così via). Per espandere la stringa, la colonna corrente viene impostata a zero e la stringa viene esaminata carattere per carattere. Se il carattere è una tabulazione (``\t``), uno o più caratteri di spazio vengono inseriti nel risultato fino a quando la colonna corrente è uguale alla successiva posizione di tabulazione. (Il carattere di tabulazione stesso non viene copiato.) Se il carattere è una nuova linea (``\n``) o ritorno a capo (``\r``), viene copiato e la colonna corrente viene reimpostata a zero. Qualsiasi altro carattere viene copiato senza modifiche e la colonna corrente viene incrementata di uno indipendentemente da come viene rappresentato il carattere quando stampato.

source: Return the lowest index in the string where substring *sub* is found within the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
it_it: Restituisce l'indice più basso nella stringa in cui la sottostringa *sub* è trovata all'interno dell'intervallo ``s[start:end]``. Gli argomenti opzionali *start* e *end* sono interpretati come nella notazione delle slice. Restituisce ``-1`` se *sub* non viene trovata.

source: The :meth:`~str.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
it_it: Il metodo :meth:`~str.find` dovrebbe essere utilizzato solo se si ha bisogno di conoscere la posizione di *sub*. Per verificare se *sub* è una sottostringa o meno, usa l'operatore :keyword:`in`::

source: Perform a string formatting operation. The string on which this method is called can contain literal text or replacement fields delimited by braces ``{}``. Each replacement field contains either the numeric index of a positional argument, or the name of a keyword argument. Returns a copy of the string where each replacement field is replaced with the string value of the corresponding argument.
it_it: Esegui un'operazione di formattazione della stringa. La stringa su cui viene chiamato questo metodo può contenere testo letterale o campi di sostituzione delimitati da parentesi graffe ``{}``. Ogni campo di sostituzione contiene l'indice numerico di un argomento posizionale o il nome di un argomento keyword. Restituisce una copia della stringa dove ogni campo di sostituzione è sostituito con il valore della stringa dell'argomento corrispondente.

source: See :ref:`formatstrings` for a description of the various formatting options that can be specified in format strings.
it_it: Vedi :ref:`formatstrings` per una descrizione delle varie opzioni di formattazione che possono essere specificate nelle stringhe di formattazione.

source: When formatting a number (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` and subclasses) with the ``n`` type (ex: ``'{:n}'.format(1234)``), the function temporarily sets the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale to decode ``decimal_point`` and ``thousands_sep`` fields of :c:func:`localeconv` if they are non-ASCII or longer than 1 byte, and the ``LC_NUMERIC`` locale is different than the ``LC_CTYPE`` locale. This temporary change affects other threads.
it_it: Quando si formatta un numero (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` e sottoclassi) con il tipo ``n`` (es: ``'{:n}'.format(1234)``), la funzione imposta temporaneamente il locale ``LC_CTYPE`` sul locale ``LC_NUMERIC`` per decodificare i campi ``decimal_point`` e ``thousands_sep`` di :c:func:`localeconv` se sono non-ASCII o più lunghi di 1 byte, e il locale ``LC_NUMERIC`` è diverso dal locale ``LC_CTYPE``. Questo cambiamento temporaneo influisce su altri thread.

source: When formatting a number with the ``n`` type, the function sets temporarily the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases.
it_it: Quando si formatta un numero con il tipo ``n``, la funzione imposta temporaneamente il locale ``LC_CTYPE`` sul locale ``LC_NUMERIC`` in alcuni casi.

source: Similar to ``str.format(**mapping)``, except that ``mapping`` is used directly and not copied to a :class:`dict`. This is useful if for example ``mapping`` is a dict subclass:
it_it: Simile a ``str.format(**mapping)``, tranne che ``mapping`` viene utilizzato direttamente e non copiato in un :class:`dict`. Questo è utile se, per esempio, ``mapping`` è una sottoclasse di dict:

source: Like :meth:`~str.find`, but raise :exc:`ValueError` when the substring is not found.
it_it: Come :meth:`~str.find`, ma solleva :exc:`ValueError` quando la sottostringa non viene trovata.

source: Return ``True`` if all characters in the string are alphanumeric and there is at least one character, ``False`` otherwise. A character ``c`` is alphanumeric if one of the following returns ``True``: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()``, or ``c.isnumeric()``.
it_it: Restituisce ``True`` se tutti i caratteri della stringa sono alfanumerici e c'è almeno un carattere, ``False`` altrimenti. Un carattere ``c`` è alfanumerico se uno dei seguenti restituisce ``True``: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()``, o ``c.isnumeric()``.

source: Return ``True`` if the string is empty or all characters in the string are ASCII, ``False`` otherwise. ASCII characters have code points in the range U+0000-U+007F.
it_it: Restituisce ``True`` se la stringa è vuota o tutti i caratteri della stringa sono ASCII, ``False`` altrimenti. I caratteri ASCII hanno punti di codice nell'intervallo U+0000-U+007F.

source: Return ``True`` if all characters in the string are decimal characters and there is at least one character, ``False`` otherwise. Decimal characters are those that can be used to form numbers in base 10, e.g. U+0660, ARABIC-INDIC DIGIT ZERO. Formally a decimal character is a character in the Unicode General Category "Nd".
it_it: Restituisce ``True`` se tutti i caratteri della stringa sono caratteri decimali e c'è almeno un carattere, ``False`` altrimenti. I caratteri decimali sono quelli che possono essere usati per formare numeri in base 10, ad es. U+0660, NUMERO ZERO ARABICO-INDICO. Formalmente, un carattere decimale è un carattere nella categoria generale Unicode "Nd".

source: Return ``True`` if all characters in the string are digits and there is at least one character, ``False`` otherwise. Digits include decimal characters and digits that need special handling, such as the compatibility superscript digits. This covers digits which cannot be used to form numbers in base 10, like the Kharosthi numbers. Formally, a digit is a character that has the property value Numeric_Type=Digit or Numeric_Type=Decimal.
it_it: Restituisce ``True`` se tutti i caratteri della stringa sono cifre e c'è almeno un carattere, ``False`` altrimenti. Le cifre includono i caratteri decimali e le cifre che necessitano di una gestione speciale, come le cifre in apice di compatibilità. Questo copre le cifre che non possono essere usate per formare numeri in base 10, come i numeri Kharosthi. Formalmente, una cifra è un carattere che ha la proprietà Numeric_Type=Digit o Numeric_Type=Decimal.

source: Return ``True`` if the string is a valid identifier according to the language definition, section :ref:`identifiers`.
it_it: Restituisce ``True`` se la stringa è un identificatore valido secondo la definizione del linguaggio, sezione :ref:`identifiers`.

source: :func:`keyword.iskeyword` can be used to test whether string ``s`` is a reserved identifier, such as :keyword:`def` and :keyword:`class`.
it_it: :func:`keyword.iskeyword` può essere utilizzata per testare se la stringa ``s`` è un identificatore riservato, come :keyword:`def` e :keyword:`class`.

source: Example: ::
it_it: Esempio: ::

source: Return ``True`` if all cased characters [4]_ in the string are lowercase and there is at least one cased character, ``False`` otherwise.
it_it: Restituisce ``True`` se tutti i caratteri con distinzione di maiuscole e minuscole [4]_ della stringa sono minuscoli e c'è almeno un carattere con distinzione di maiuscole e minuscole, ``False`` altrimenti.

source: Return ``True`` if all characters in the string are numeric characters, and there is at least one character, ``False`` otherwise. Numeric characters include digit characters, and all characters that have the Unicode numeric value property, e.g. U+2155, VULGAR FRACTION ONE FIFTH. Formally, numeric characters are those with the property value Numeric_Type=Digit, Numeric_Type=Decimal or Numeric_Type=Numeric.
it_it: Restituisce ``True`` se tutti i caratteri della stringa sono caratteri numerici, e c'è almeno un carattere, ``False`` altrimenti. I caratteri numerici includono i caratteri delle cifre, e tutti i caratteri che hanno la proprietà valore numerico Unicode, ad es. U+2155, FRAZIONE VOLGARE UN QUINTO. Formalmente, i caratteri numerici sono quelli con la proprietà valore Numeric_Type=Digit, Numeric_Type=Decimal o Numeric_Type=Numeric.

source: Return ``True`` if all characters in the string are printable or the string is empty, ``False`` otherwise. Nonprintable characters are those characters defined in the Unicode character database as "Other" or "Separator", excepting the ASCII space (0x20) which is considered printable. (Note that printable characters in this context are those which should not be escaped when :func:`repr` is invoked on a string. It has no bearing on the handling of strings written to :data:`sys.stdout` or :data:`sys.stderr`.)
it_it: Restituisce ``True`` se tutti i caratteri nella stringa sono stampabili o se la stringa è vuota, altrimenti ``False``. I caratteri non stampabili sono quelli definiti nel database dei caratteri Unicode come "Other" o "Separator", eccetto lo spazio ASCII (0x20) che è considerato stampabile. (Si noti che i caratteri stampabili in questo contesto sono quelli che non devono essere escape quando la funzione :func:`repr` viene invocata su una stringa. Non influisce sulla gestione delle stringhe scritte su :data:`sys.stdout` o :data:`sys.stderr`).

source: Return ``True`` if there are only whitespace characters in the string and there is at least one character, ``False`` otherwise.
it_it: Restituisce ``True`` se ci sono solo caratteri di spazio nella stringa e c'è almeno un carattere, altrimenti ``False``.

source: A character is *whitespace* if in the Unicode character database (see :mod:`unicodedata`), either its general category is ``Zs`` ("Separator, space"), or its bidirectional class is one of ``WS``, ``B``, or ``S``.
it_it: Un carattere è *spazio* se nel database dei caratteri Unicode (vedi :mod:`unicodedata`) la sua categoria generale è ``Zs`` ("Separator, space"), o se la sua classe bidirezionale è una delle seguenti ``WS``, ``B``, o ``S``.

source: Return ``True`` if the string is a titlecased string and there is at least one character, for example uppercase characters may only follow uncased characters and lowercase characters only cased ones. Return ``False`` otherwise.
it_it: Restituisce ``True`` se la stringa è una stringa con iniziale maiuscola e c'è almeno un carattere; ad esempio, i caratteri maiuscoli possono seguire solo caratteri senza distinzione maiuscola o minuscola e i caratteri minuscoli solo quelli con distinzione. Restituisce ``False`` altrimenti.

source: Return ``True`` if all cased characters [4]_ in the string are uppercase and there is at least one cased character, ``False`` otherwise.
it_it: Restituisce ``True`` se tutti i caratteri con distinzione [4]_ nella stringa sono maiuscoli e c'è almeno un carattere con distinzione, altrimenti ``False``.

source: Return a string which is the concatenation of the strings in *iterable*. A :exc:`TypeError` will be raised if there are any non-string values in *iterable*, including :class:`bytes` objects. The separator between elements is the string providing this method.
it_it: Restituisce una stringa che è la concatenazione delle stringhe in *iterable*. Verrà sollevato un :exc:`TypeError` se ci sono valori non stringa in *iterable*, inclusi gli oggetti di tipo :class:`bytes`. Il separatore tra gli elementi è la stringa che fornisce questo metodo.

source: Return the string left justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
it_it: Restituisce la stringa allineata a sinistra in una stringa di lunghezza *width*. La spaziatura viene eseguita utilizzando il *fillchar* specificato (il valore predefinito è uno spazio ASCII). La stringa originale viene restituita se *width* è minore o uguale alla lunghezza di ``len(s)``.

source: Return a copy of the string with all the cased characters [4]_ converted to lowercase.
it_it: Restituisce una copia della stringa con tutti i caratteri con distinzione [4]_ convertiti in minuscolo.

source: Return a copy of the string with leading characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
it_it: Restituisce una copia della stringa con i caratteri iniziali rimossi. L'argomento *chars* è una stringa che specifica l'insieme di caratteri da rimuovere. Se omesso o ``None``, l'argomento *chars* predefinito rimuove gli spazi bianchi. L'argomento *chars* non è un prefisso; piuttosto, tutte le combinazioni dei suoi valori vengono rimosse::

source: See :meth:`str.removeprefix` for a method that will remove a single prefix string rather than all of a set of characters. For example::
it_it: Vedi :meth:`str.removeprefix` per un metodo che rimuova un singolo prefisso stringa piuttosto che tutti i caratteri di un insieme. Ad esempio::

source: This static method returns a translation table usable for :meth:`str.translate`.
it_it: Questo metodo statico restituisce una tabella di traduzione utilizzabile per :meth:`str.translate`.

source: If there is only one argument, it must be a dictionary mapping Unicode ordinals (integers) or characters (strings of length 1) to Unicode ordinals, strings (of arbitrary lengths) or ``None``. Character keys will then be converted to ordinals.
it_it: Se c'è solo un argomento, deve essere un dizionario che mappa gli ordinali Unicode (interi) o caratteri (stringhe di lunghezza 1) a ordinali Unicode, stringhe (di lunghezza arbitraria) o ``None``. Le chiavi dei caratteri verranno quindi convertite in ordinali.

source: If there are two arguments, they must be strings of equal length, and in the resulting dictionary, each character in x will be mapped to the character at the same position in y. If there is a third argument, it must be a string, whose characters will be mapped to ``None`` in the result.
it_it: Se ci sono due argomenti, devono essere stringhe della stessa lunghezza, e nel dizionario risultante, ciascun carattere in x sarà mappato al carattere nella stessa posizione in y. Se c'è un terzo argomento, deve essere una stringa, i cui caratteri verranno mappati a ``None`` nel risultato.

source: Split the string at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing the string itself, followed by two empty strings.
it_it: Divide la stringa alla prima occorrenza di *sep*, e restituisce una tuple a 3 elementi contenente la parte prima del separatore, il separatore stesso, e la parte dopo il separatore. Se il separatore non viene trovato, restituisce una tuple a 3 elementi contenente la stringa stessa, seguita da due stringhe vuote.

source: If the string starts with the *prefix* string, return ``string[len(prefix):]``. Otherwise, return a copy of the original string::
it_it: Se la stringa inizia con la stringa *prefix*, restituisce ``string[len(prefix):]``. Altrimenti, restituisce una copia della stringa originale::

source: If the string ends with the *suffix* string and that *suffix* is not empty, return ``string[:-len(suffix)]``. Otherwise, return a copy of the original string::
it_it: Se la stringa termina con la stringa *suffix* e tale *suffix* non è vuota, restituisce ``string[:-len(suffix)]``. Altrimenti, restituisce una copia della stringa originale::

source: Return the highest index in the string where substring *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
it_it: Restituisce l'indice più alto nella stringa dove la sottostringa *sub* viene trovata, in modo tale che *sub* sia contenuta in ``s[start:end]``. Gli argomenti opzionali *start* e *end* sono interpretati come nella notazione delle sezioni. Restituisce ``-1`` in caso di fallimento.

source: Like :meth:`rfind` but raises :exc:`ValueError` when the substring *sub* is not found.
it_it: Come :meth:`rfind` ma solleva :exc:`ValueError` quando la sottostringa *sub* non viene trovata.

source: Return the string right justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
it_it: Restituisce la stringa allineata a destra in una stringa di lunghezza *width*. La spaziatura viene eseguita utilizzando il *fillchar* specificato (il valore predefinito è uno spazio ASCII). La stringa originale viene restituita se *width* è minore o uguale alla lunghezza di ``len(s)``.

source: Split the string at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty strings, followed by the string itself.
it_it: Divide la stringa all'ultima occorrenza di *sep*, e restituisce una tuple a 3 elementi contenente la parte prima del separatore, il separatore stesso, e la parte dopo il separatore. Se il separatore non viene trovato, restituisce una tuple a 3 elementi contenente due stringhe vuote, seguite dalla stringa stessa.

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any whitespace string is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
it_it: Restituisce un elenco delle parole nella stringa, utilizzando *sep* come stringa delimitante. Se è dato *maxsplit*, sono eseguite al massimo *maxsplit* divisioni, quelle più a destra. Se *sep* non è specificato o è ``None``, qualsiasi stringa di spazi bianchi è un separatore. A eccezione della divisione da destra, :meth:`rsplit` si comporta come :meth:`split` che viene descritto in dettaglio sotto.

source: Return a copy of the string with trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
it_it: Restituisce una copia della stringa con i caratteri finali rimossi. L'argomento *chars* è una stringa che specifica l'insieme di caratteri da rimuovere. Se omesso o ``None``, l'argomento *chars* predefinito rimuove gli spazi bianchi. L'argomento *chars* non è un suffisso; piuttosto, tutte le combinazioni dei suoi valori vengono rimosse::

source: See :meth:`str.removesuffix` for a method that will remove a single suffix string rather than all of a set of characters. For example::
it_it: Vedi :meth:`str.removesuffix` per un metodo che rimuova un singolo suffisso stringa piuttosto che tutti i caratteri di un insieme. Ad esempio::

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or ``-1``, then there is no limit on the number of splits (all possible splits are made).
it_it: Restituisce un elenco delle parole nella stringa, utilizzando *sep* come stringa delimitante. Se è dato *maxsplit*, sono eseguite al massimo *maxsplit* divisioni (quindi, l'elenco avrà al massimo ``maxsplit+1`` elementi). Se *maxsplit* non è specificato o è ``-1``, allora non c'è limite al numero di divisioni (vengono eseguite tutte le divisioni possibili).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty strings (for example, ``'1,,2'.split(',')`` returns ``['1', '', '2']``). The *sep* argument may consist of multiple characters (for example, ``'1<>2<>3'.split('<>')`` returns ``['1', '2', '3']``). Splitting an empty string with a specified separator returns ``['']``.
it_it: Se è fornito *sep*, i delimitatori consecutivi non sono raggruppati insieme e si ritiene delimitino stringhe vuote (ad esempio, ``'1,,2'.split(',')`` restituisce ``['1', '', '2']``). L'argomento *sep* può consistere di più caratteri (ad esempio, ``'1<>2<>3'.split('<>')`` restituisce ``['1', '2', '3']``). Dividendo una stringa vuota con un separatore specificato si ottiene ``['']``.

source: For example::
it_it: Ad esempio::

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the string has leading or trailing whitespace. Consequently, splitting an empty string or a string consisting of just whitespace with a ``None`` separator returns ``[]``.
it_it: Se *sep* non è specificato o è ``None``, viene applicato un algoritmo di divisione diverso: sequenze di spazi bianchi consecutivi sono considerate come un unico separatore, e il risultato non conterrà stringhe vuote all'inizio o alla fine se la stringa ha spazi bianchi iniziali o finali. Di conseguenza, dividendo una stringa vuota o una stringa composta solo di spazi bianchi con un separatore ``None`` si ottiene ``[]``.

source: Return a list of the lines in the string, breaking at line boundaries. Line breaks are not included in the resulting list unless *keepends* is given and true.
it_it: Restituisce un elenco delle righe nella stringa, suddividendo alle linee di demarcazione. Le interruzioni di linea non sono incluse nell'elenco risultante a meno che *keepends* non sia dato e vero.
