Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: This method splits on the following line boundaries. In particular, the boundaries are a superset of :term:`universal newlines`.
it_it: Questo metodo divide sulle seguenti linee di demarcazione. In particolare, i confini sono un sovrainsieme delle :term:`universal newlines`.

source: Representation
it_it: Rappresentazione

source: Description
it_it: Descrizione

source: ``\v`` or ``\x0b``
it_it: ``\v`` o ``\x0b``

source: ``\f`` or ``\x0c``
it_it: ``\f`` o ``\x0c``

source: Next Line (C1 Control Code)
it_it: Codice di controllo C1 "Next Line"

source: Line Separator
it_it: Separatore di riga

source: Paragraph Separator
it_it: Separatore di paragrafo

source: ``\v`` and ``\f`` added to list of line boundaries.
it_it: ``\v`` e ``\f`` aggiunti all'elenco dei limiti di riga.

source: Unlike :meth:`~str.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
it_it: A differenza del metodo :meth:`~str.split` quando viene fornita una stringa delimitatore *sep*, questo metodo restituisce una lista vuota per la stringa vuota e un'interruzione di riga terminale non comporta una linea aggiuntiva::

source: For comparison, ``split('\n')`` gives::
it_it: Per confronto, ``split('\n')`` restituisce::

source: Return ``True`` if string starts with the *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test string beginning at that position. With optional *end*, stop comparing string at that position.
it_it: Restituisce ``True`` se la stringa inizia con il *prefisso*, altrimenti restituisce ``False``. *prefix* può essere anche una tupla di prefissi da cercare. Con *start* opzionale, testa la stringa iniziando da quella posizione. Con *end* opzionale, smette di confrontare la stringa in quella posizione.

source: Return a copy of the string with the leading and trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
it_it: Restituisce una copia della stringa con i caratteri iniziali e finali rimossi. L'argomento *chars* è una stringa che specifica l'insieme dei caratteri da rimuovere. Se omesso o ``None``, l'argomento *chars* predefinisce la rimozione degli spazi bianchi. L'argomento *chars* non è un prefisso o un suffisso; piuttosto, tutte le combinazioni dei suoi valori vengono eliminate::

source: The outermost leading and trailing *chars* argument values are stripped from the string. Characters are removed from the leading end until reaching a string character that is not contained in the set of characters in *chars*. A similar action takes place on the trailing end. For example::
it_it: I valori esterni iniziali e finali dell'argomento *chars* vengono rimossi dalla stringa. I caratteri vengono rimossi dall'inizio fino a raggiungere un carattere della stringa che non è contenuto nel set di caratteri in *chars*. Un'azione simile avviene alla fine. Per esempio::

source: Return a copy of the string with uppercase characters converted to lowercase and vice versa. Note that it is not necessarily true that ``s.swapcase().swapcase() == s``.
it_it: Restituisce una copia della stringa con i caratteri maiuscoli convertiti in minuscoli e viceversa. Nota che non è necessariamente vero che ``s.swapcase().swapcase() == s``.

source: Return a titlecased version of the string where words start with an uppercase character and the remaining characters are lowercase.
it_it: Restituisce una versione della stringa con iniziali maiuscole, dove le parole iniziano con un carattere maiuscolo e i caratteri rimanenti sono minuscoli.

source: The algorithm uses a simple language-independent definition of a word as groups of consecutive letters. The definition works in many contexts but it means that apostrophes in contractions and possessives form word boundaries, which may not be the desired result::
it_it: L'algoritmo utilizza una semplice definizione indipendente dalla lingua di una parola come gruppi di lettere consecutive. La definizione funziona in molti contesti, ma ciò significa che gli apostrofi nelle contrazioni e nei possessivi formano confini di parola, il che potrebbe non essere il risultato desiderato::

source: The :func:`string.capwords` function does not have this problem, as it splits words on spaces only.
it_it: La funzione :func:`string.capwords` non ha questo problema, poiché divide le parole solo sugli spazi.

source: Alternatively, a workaround for apostrophes can be constructed using regular expressions::
it_it: In alternativa, è possibile costruire una soluzione per gli apostrofi utilizzando le espressioni regolari::

source: Return a copy of the string in which each character has been mapped through the given translation table. The table must be an object that implements indexing via :meth:`~object.__getitem__`, typically a :term:`mapping` or :term:`sequence`. When indexed by a Unicode ordinal (an integer), the table object can do any of the following: return a Unicode ordinal or a string, to map the character to one or more other characters; return ``None``, to delete the character from the return string; or raise a :exc:`LookupError` exception, to map the character to itself.
it_it: Restituisce una copia della stringa in cui ciascun carattere è stato mappato attraverso la tabella di traduzione fornita. La tabella deve essere un oggetto che implementa l'indicizzazione tramite :meth:`~object.__getitem__`, tipicamente un :term:`mapping` o una :term:`sequence`. Quando indicizzato tramite un ordinale Unicode (un intero), l'oggetto tabella può fare una delle seguenti azioni: restituire un ordinale Unicode o una stringa, per mappare il carattere a uno o più altri caratteri; restituire ``None``, per eliminare il carattere dalla stringa di ritorno; o lanciare un'eccezione :exc:`LookupError`, per mappare il carattere a se stesso.

source: You can use :meth:`str.maketrans` to create a translation map from character-to-character mappings in different formats.
it_it: Puoi usare :meth:`str.maketrans` per creare una mappa di traduzione da mappature carattere-a-carattere in diversi formati.

source: See also the :mod:`codecs` module for a more flexible approach to custom character mappings.
it_it: Vedi anche il modulo :mod:`codecs` per un approccio più flessibile alle mappature personalizzate dei caratteri.

source: Return a copy of the string with all the cased characters [4]_ converted to uppercase. Note that ``s.upper().isupper()`` might be ``False`` if ``s`` contains uncased characters or if the Unicode category of the resulting character(s) is not "Lu" (Letter, uppercase), but e.g. "Lt" (Letter, titlecase).
it_it: Restituisce una copia della stringa con tutti i caratteri [4]_ in maiuscolo convertiti in maiuscolo. Nota che ``s.upper().isupper()`` potrebbe essere ``False`` se ``s`` contiene caratteri non maiuscoli o se la categoria Unicode dei caratteri risultanti non è "Lu" (Lettera, maiuscolo), ma ad esempio "Lt" (Lettera, titolo).

source: Return a copy of the string left filled with ASCII ``'0'`` digits to make a string of length *width*. A leading sign prefix (``'+'``/``'-'``) is handled by inserting the padding *after* the sign character rather than before. The original string is returned if *width* is less than or equal to ``len(s)``.
it_it: Restituisce una copia della stringa riempita a sinistra con cifre ASCII ``'0'`` per fare una stringa della lunghezza *width*. Un prefisso di segno principale (``'+'``/``'-'``) viene gestito inserendo il padding *dopo* il carattere del segno piuttosto che prima. La stringa originale viene restituita se *width* è minore o uguale a ``len(s)``.

source: ``printf``-style String Formatting
it_it: Formattazione delle stringhe in stile ``printf``

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). Using the newer :ref:`formatted string literals <f-strings>`, the :meth:`str.format` interface, or :ref:`template strings <template-strings>` may help avoid these errors. Each of these alternatives provides their own trade-offs and benefits of simplicity, flexibility, and/or extensibility.
it_it: Le operazioni di formattazione descritte qui mostrano una varietà di caratteristiche particolari che portano a numerosi errori comuni (come il fallimento nel visualizzare correttamente tuple e dizionari). Utilizzare le più recenti :ref:`stringhe letterali formattate <f-strings>`, l'interfaccia :meth:`str.format`, o :ref:`stringhe template <template-strings>` potrebbe aiutare a evitare questi errori. Ciascuna di queste alternative offre i propri compromessi e vantaggi di semplicità, flessibilità e/o estensibilità.

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format string, or a single mapping object (for example, a dictionary).
it_it: Se *format* richiede un singolo argomento, *values* può essere un singolo oggetto che non è una tupla. [5]_ Altrimenti, *values* deve essere una tupla con esattamente il numero di elementi specificati dalla stringa di formattazione, o un singolo oggetto di mappatura (ad esempio, un dizionario).

source: A conversion specifier contains two or more characters and has the following components, which must occur in this order:
it_it: Uno specificatore di conversione contiene due o più caratteri e ha i seguenti componenti, che devono apparire in questo ordine:

source: The ``'%'`` character, which marks the start of the specifier.
it_it: Il carattere ``'%'``, che segna l'inizio dello specificatore.

source: Mapping key (optional), consisting of a parenthesised sequence of characters (for example, ``(somename)``).
it_it: Chiave di mappatura (opzionale), costituita da una sequenza tra parentesi di caratteri (ad esempio, ``(somename)``).

source: Conversion flags (optional), which affect the result of some conversion types.
it_it: Flag di conversione (opzionali), che influiscono sul risultato di alcuni tipi di conversione.

source: Minimum field width (optional). If specified as an ``'*'`` (asterisk), the actual width is read from the next element of the tuple in *values*, and the object to convert comes after the minimum field width and optional precision.
it_it: Larghezza minima del campo (opzionale). Se specificata come ``'*'`` (asterisco), la larghezza effettiva viene letta dal prossimo elemento della tupla in *values*, e l'oggetto da convertire viene dopo la larghezza minima del campo e la precisione opzionale.

source: Precision (optional), given as a ``'.'`` (dot) followed by the precision. If specified as ``'*'`` (an asterisk), the actual precision is read from the next element of the tuple in *values*, and the value to convert comes after the precision.
it_it: Precisione (opzionale), data come ``'.'`` (punto) seguita dalla precisione. Se specificata come ``'*'`` (un asterisco), la precisione effettiva viene letta dal prossimo elemento della tupla in *values*, e il valore da convertire viene dopo la precisione.

source: Length modifier (optional).
it_it: Modificatore di lunghezza (opzionale).

source: Conversion type.
it_it: Tipo di conversione.

source: When the right argument is a dictionary (or other mapping type), then the formats in the string *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
it_it: Quando l'argomento di destra è un dizionario (o un altro tipo di mappatura), i formati nella stringa *devono* includere una chiave di mappatura tra parentesi in quel dizionario inserita immediatamente dopo il carattere ``'%'``. La chiave di mappatura seleziona il valore da formattare dalla mappatura. Ad esempio:

source: In this case no ``*`` specifiers may occur in a format (since they require a sequential parameter list).
it_it: In questo caso non possono comparire specificatori ``*`` in un formato (poiché richiedono un elenco di parametri sequenziale).

source: The conversion flag characters are:
it_it: I caratteri di flag di conversione sono:

source: The value conversion will use the "alternate form" (where defined below).
it_it: La conversione del valore utilizzerà la "forma alternativa" (dove definita di seguito).

source: The conversion will be zero padded for numeric values.
it_it: La conversione sarà riempita di zeri per i valori numerici.

source: The converted value is left adjusted (overrides the ``'0'`` conversion if both are given).
it_it: Il valore convertito è allineato a sinistra (sovrascrive la conversione ``'0'`` se entrambi sono forniti).

source: (a space) A blank should be left before a positive number (or empty string) produced by a signed conversion.
it_it: (uno spazio) Uno spazio vuoto dovrebbe essere lasciato prima di un numero positivo (o stringa vuota) prodotto da una conversione con segno.

source: A sign character (``'+'`` or ``'-'``) will precede the conversion (overrides a "space" flag).
it_it: Un carattere di segno (``'+'`` o ``'-'``) precederà la conversione (sovrascrive un flag "spazio").

source: A length modifier (``h``, ``l``, or ``L``) may be present, but is ignored as it is not necessary for Python -- so e.g. ``%ld`` is identical to ``%d``.
it_it: Un modificatore di lunghezza (``h``, ``l``, o ``L``) può essere presente, ma viene ignorato poiché non è necessario per Python -- quindi ad esempio ``%ld`` è identico a ``%d``.

source: The conversion types are:
it_it: I tipi di conversione sono:

source: Conversion
it_it: Conversione

source: Signed integer decimal.
it_it: Intero con segno decimale.

source: Signed octal value.
it_it: Valore ottale con segno.

source: Obsolete type -- it is identical to ``'d'``.
it_it: Tipo obsoleto -- è identico a ``'d'``.

source: Signed hexadecimal (lowercase).
it_it: Esadecimale con segno (minuscolo).

source: Signed hexadecimal (uppercase).
it_it: Esadecimale con segno (maiuscolo).

source: Floating point exponential format (lowercase).
it_it: Formato esponenziale a virgola mobile (minuscolo).

source: Floating point exponential format (uppercase).
it_it: Formato esponenziale a virgola mobile (maiuscolo).

source: Floating point decimal format.
it_it: Formato decimale a virgola mobile.

source: Floating point format. Uses lowercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
it_it: Formato a virgola mobile. Usa formato esponenziale minuscolo se l'esponente è inferiore a -4 o non inferiore alla precisione, altrimenti formato decimale.

source: Floating point format. Uses uppercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
it_it: Formato a virgola mobile. Usa formato esponenziale maiuscolo se l'esponente è inferiore a -4 o non inferiore alla precisione, altrimenti formato decimale.

source: Single character (accepts integer or single character string).
it_it: Singolo carattere (accetta un intero o una stringa di un singolo carattere).

source: String (converts any Python object using :func:`repr`).
it_it: Stringa (converte qualsiasi oggetto Python usando :func:`repr`).

source: String (converts any Python object using :func:`str`).
it_it: Stringa (converte qualsiasi oggetto Python usando :func:`str`).

source: String (converts any Python object using :func:`ascii`).
it_it: Stringa (converte qualsiasi oggetto Python usando :func:`ascii`).

source: No argument is converted, results in a ``'%'`` character in the result.
it_it: Nessun argomento viene convertito, il risultato è un carattere ``'%'`` nel risultato.

source: The alternate form causes a leading octal specifier (``'0o'``) to be inserted before the first digit.
it_it: La forma alternativa fa sì che venga inserito un prefisso ottale (``'0o'``) prima della prima cifra.

source: The alternate form causes a leading ``'0x'`` or ``'0X'`` (depending on whether the ``'x'`` or ``'X'`` format was used) to be inserted before the first digit.
it_it: La forma alternativa fa sì che venga inserito un prefisso ``'0x'`` o ``'0X'`` (a seconda che sia stato usato il formato ``'x'`` o ``'X'``) prima della prima cifra.

source: The alternate form causes the result to always contain a decimal point, even if no digits follow it.
it_it: La forma alternativa fa sì che il risultato contenga sempre un punto decimale, anche se non ci sono cifre che seguono.

source: The precision determines the number of digits after the decimal point and defaults to 6.
it_it: La precisione determina il numero di cifre dopo il punto decimale e il valore predefinito è 6.

source: The alternate form causes the result to always contain a decimal point, and trailing zeroes are not removed as they would otherwise be.
it_it: La forma alternativa fa sì che il risultato contenga sempre un punto decimale e gli zeri finali non vengono rimossi come avverrebbe altrimenti.

source: The precision determines the number of significant digits before and after the decimal point and defaults to 6.
it_it: La precisione determina il numero di cifre significative prima e dopo il punto decimale e il valore predefinito è 6.

source: If precision is ``N``, the output is truncated to ``N`` characters.
it_it: Se la precisione è ``N``, l'output è troncato a ``N`` caratteri.

source: See :pep:`237`.
it_it: Vedi :pep:`237`.

source: Since Python strings have an explicit length, ``%s`` conversions do not assume that ``'\0'`` is the end of the string.
it_it: Poiché le stringhe Python hanno una lunghezza esplicita, le conversioni ``%s`` non assumono che ``'\0'`` sia la fine della stringa.

source: ``%f`` conversions for numbers whose absolute value is over 1e50 are no longer replaced by ``%g`` conversions.
it_it: Le conversioni ``%f`` per i numeri il cui valore assoluto è superiore a 1e50 non vengono più sostituite dalle conversioni ``%g``.

source: Binary Sequence Types --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`
it_it: Tipi di sequenze binarie --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`

source: The core built-in types for manipulating binary data are :class:`bytes` and :class:`bytearray`. They are supported by :class:`memoryview` which uses the :ref:`buffer protocol <bufferobjects>` to access the memory of other binary objects without needing to make a copy.
it_it: I tipi incorporati principali per manipolare i dati binari sono :class:`bytes` e :class:`bytearray`. Sono supportati da :class:`memoryview` che utilizza il :ref:`protocollo buffer <bufferobjects>` per accedere alla memoria di altri oggetti binari senza necessità di fare una copia.

source: The :mod:`array` module supports efficient storage of basic data types like 32-bit integers and IEEE754 double-precision floating values.
it_it: Il modulo :mod:`array` supporta l'archiviazione efficiente di tipi di dati di base come interi a 32 bit e valori a virgola mobile a doppia precisione IEEE754.

source: Bytes Objects
it_it: Oggetti bytes

source: Bytes objects are immutable sequences of single bytes. Since many major binary protocols are based on the ASCII text encoding, bytes objects offer several methods that are only valid when working with ASCII compatible data and are closely related to string objects in a variety of other ways.
it_it: Gli oggetti bytes sono sequenze immutabili di singoli byte. Poiché molti protocolli binari principali sono basati sulla codifica del testo ASCII, gli oggetti bytes offrono diversi metodi validi solo quando si lavora con dati compatibili con ASCII e sono strettamente correlati agli oggetti stringa in vari altri modi.

source: Firstly, the syntax for bytes literals is largely the same as that for string literals, except that a ``b`` prefix is added:
it_it: In primo luogo, la sintassi per i letterali bytes è sostanzialmente la stessa di quella per i letterali stringa, tranne per il fatto che viene aggiunto un prefisso ``b``:

source: Single quotes: ``b'still allows embedded "double" quotes'``
it_it: Virgolette singole: ``b'still allows embedded "double" quotes'``

source: Double quotes: ``b"still allows embedded 'single' quotes"``
it_it: Virgolette doppie: ``b"still allows embedded 'single' quotes"``

source: Triple quoted: ``b'''3 single quotes'''``, ``b"""3 double quotes"""``
it_it: Virgolette triple: ``b'''3 single quotes'''``, ``b"""3 double quotes"""``

source: Only ASCII characters are permitted in bytes literals (regardless of the declared source code encoding). Any binary values over 127 must be entered into bytes literals using the appropriate escape sequence.
it_it: Sono permessi solo caratteri ASCII nei letterali bytes (indipendentemente dalla codifica dichiarata del codice sorgente). Qualsiasi valore binario superiore a 127 deve essere inserito nei letterali bytes usando la sequenza di escape appropriata.

source: As with string literals, bytes literals may also use a ``r`` prefix to disable processing of escape sequences. See :ref:`strings` for more about the various forms of bytes literal, including supported escape sequences.
it_it: Come per i letterali stringa, i letterali bytes possono anche usare il prefisso ``r`` per disabilitare l'elaborazione delle sequenze di escape. Vedi :ref:`strings` per maggiori informazioni sulle varie forme di letterali bytes, comprese le sequenze di escape supportate.

source: While bytes literals and representations are based on ASCII text, bytes objects actually behave like immutable sequences of integers, with each value in the sequence restricted such that ``0 <= x < 256`` (attempts to violate this restriction will trigger :exc:`ValueError`). This is done deliberately to emphasise that while many binary formats include ASCII based elements and can be usefully manipulated with some text-oriented algorithms, this is not generally the case for arbitrary binary data (blindly applying text processing algorithms to binary data formats that are not ASCII compatible will usually lead to data corruption).
it_it: Sebbene i letterali bytes e le loro rappresentazioni si basino sul testo ASCII, gli oggetti bytes si comportano effettivamente come sequenze immutabili di interi, con ciascun valore nella sequenza limitato in modo tale che ``0 <= x < 256`` (i tentativi di violare questa restrizione attiveranno :exc:`ValueError`). Questo viene fatto deliberatamente per enfatizzare che, sebbene molti formati binari includano elementi basati su ASCII e possano essere utilmente manipolati con alcuni algoritmi orientati al testo, questo non è generalmente il caso per dati binari arbitrari (applicare ciecamente algoritmi di elaborazione del testo a formati di dati binari non compatibili con ASCII di solito porta a corruzione dei dati).

source: In addition to the literal forms, bytes objects can be created in a number of other ways:
it_it: Oltre alle forme letterali, gli oggetti bytes possono essere creati in diversi altri modi:

source: A zero-filled bytes object of a specified length: ``bytes(10)``
it_it: Un oggetto bytes riempito di zeri di una lunghezza specificata: ``bytes(10)``

source: From an iterable of integers: ``bytes(range(20))``
it_it: Da un iterable di interi: ``bytes(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytes(obj)``
it_it: Copiando dati binari esistenti tramite il protocollo buffer: ``bytes(obj)``

source: Also see the :ref:`bytes <func-bytes>` built-in.
it_it: Vedi anche il built-in :ref:`bytes <func-bytes>`.
