Repository: Addivsyou/python-docs-it
Catalog: library/stdtypes.po
Languages: it_it

source: The *signed* argument determines whether two's complement is used to represent the integer. If *signed* is ``False`` and a negative integer is given, an :exc:`OverflowError` is raised. The default value for *signed* is ``False``.
it_it: L'argomento *signed* determina se viene utilizzato il complemento a due per rappresentare l'intero. Se *signed* è ``False`` e viene fornito un intero negativo, viene sollevata un'eccezione :exc:`OverflowError`. Il valore predefinito di *signed* è ``False``.

source: The default values can be used to conveniently turn an integer into a single byte object::
it_it: I valori predefiniti possono essere utilizzati per convertire comodamente un intero in un singolo oggetto byte::

source: However, when using the default arguments, don't try to convert a value greater than 255 or you'll get an :exc:`OverflowError`.
it_it: Tuttavia, quando si utilizzano gli argomenti predefiniti, non tentare di convertire un valore maggiore di 255 o si otterrà un'eccezione :exc:`OverflowError`.

source: Added default argument values for ``length`` and ``byteorder``.
it_it: Aggiunti i valori predefiniti degli argomenti per ``length`` e ``byteorder``.

source: Return the integer represented by the given array of bytes.
it_it: Restituisce l'intero rappresentato dall'array di byte fornito.

source: The argument *bytes* must either be a :term:`bytes-like object` or an iterable producing bytes.
it_it: L'argomento *bytes* deve essere un :term:`bytes-like object` o un iterabile che produce byte.

source: The *byteorder* argument determines the byte order used to represent the integer, and defaults to ``"big"``. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array. To request the native byte order of the host system, use :data:`sys.byteorder` as the byte order value.
it_it: L'argomento *byteorder* determina l'ordine dei byte utilizzato per rappresentare l'intero, e il valore predefinito è ``"big"``. Se *byteorder* è ``"big"``, il byte più significativo è all'inizio dell'array di byte. Se *byteorder* è ``"little"``, il byte più significativo è alla fine dell'array di byte. Per richiedere l'ordine dei byte nativo del sistema host, utilizzare :data:`sys.byteorder` come valore dell'ordine dei byte.

source: The *signed* argument indicates whether two's complement is used to represent the integer.
it_it: L'argomento *signed* indica se viene utilizzato il complemento a due per rappresentare l'intero.

source: Added default argument value for ``byteorder``.
it_it: Aggiunto valore predefinito per l'argomento ``byteorder``.

source: Return a pair of integers whose ratio is equal to the original integer and has a positive denominator. The integer ratio of integers (whole numbers) is always the integer as the numerator and ``1`` as the denominator.
it_it: Restituisce una coppia di interi il cui rapporto è uguale all'intero originale e ha un denominatore positivo. Il rapporto di numeri interi (numeri interi) è sempre l'intero come numeratore e ``1`` come denominatore.

source: Returns ``True``. Exists for duck type compatibility with :meth:`float.is_integer`.
it_it: Restituisce ``True``. Esiste per compatibilità con il tipo anatropomorfico con :meth:`float.is_integer`.

source: Additional Methods on Float
it_it: Metodi aggiuntivi su Float

source: The float type implements the :class:`numbers.Real` :term:`abstract base class`. float also has the following additional methods.
it_it: Il tipo float implementa la classe :class:`numbers.Real` :term:`abstract base class`. float ha anche i seguenti metodi aggiuntivi.

source: Return a pair of integers whose ratio is exactly equal to the original float. The ratio is in lowest terms and has a positive denominator. Raises :exc:`OverflowError` on infinities and a :exc:`ValueError` on NaNs.
it_it: Restituisce una coppia di interi il cui rapporto è esattamente uguale al float originale. Il rapporto è in termini minimi e ha un denominatore positivo. Solleva :exc:`OverflowError` su infiniti e una :exc:`ValueError` su NaN.

source: Return ``True`` if the float instance is finite with integral value, and ``False`` otherwise::
it_it: Restituisce ``True`` se l'istanza float è finita con valore intero, e ``False`` altrimenti::

source: Two methods support conversion to and from hexadecimal strings. Since Python's floats are stored internally as binary numbers, converting a float to or from a *decimal* string usually involves a small rounding error. In contrast, hexadecimal strings allow exact representation and specification of floating-point numbers. This can be useful when debugging, and in numerical work.
it_it: Due metodi supportano la conversione da e verso stringhe esadecimali. Poiché i float di Python sono memorizzati internamente come numeri binari, la conversione di un float da o verso una stringa *decimale* di solito comporta un piccolo errore di arrotondamento. Al contrario, le stringhe esadecimali consentono una rappresentazione e specifica esatta dei numeri in virgola mobile. Questo può essere utile durante il debugging e nel lavoro numerico.

source: Return a representation of a floating-point number as a hexadecimal string. For finite floating-point numbers, this representation will always include a leading ``0x`` and a trailing ``p`` and exponent.
it_it: Restituisce una rappresentazione di un numero in virgola mobile come una stringa esadecimale. Per i numeri in virgola mobile finiti, questa rappresentazione includerà sempre un ``0x`` iniziale e un ``p`` finale con l'esponente.

source: Class method to return the float represented by a hexadecimal string *s*. The string *s* may have leading and trailing whitespace.
it_it: Metodo di classe per restituire il float rappresentato da una stringa esadecimale *s*. La stringa *s* può avere spazi bianchi iniziali e finali.

source: Note that :meth:`float.hex` is an instance method, while :meth:`float.fromhex` is a class method.
it_it: Nota che :meth:`float.hex` è un metodo di istanza, mentre :meth:`float.fromhex` è un metodo di classe.

source: A hexadecimal string takes the form::
it_it: Una stringa esadecimale prende la forma::

source: where the optional ``sign`` may by either ``+`` or ``-``, ``integer`` and ``fraction`` are strings of hexadecimal digits, and ``exponent`` is a decimal integer with an optional leading sign. Case is not significant, and there must be at least one hexadecimal digit in either the integer or the fraction. This syntax is similar to the syntax specified in section 6.4.4.2 of the C99 standard, and also to the syntax used in Java 1.5 onwards. In particular, the output of :meth:`float.hex` is usable as a hexadecimal floating-point literal in C or Java code, and hexadecimal strings produced by C's ``%a`` format character or Java's ``Double.toHexString`` are accepted by :meth:`float.fromhex`.
it_it: dove il ``segno`` opzionale può essere ``+`` o ``-``, ``intero`` e ``frazione`` sono stringhe di cifre esadecimali, e l'``esponente`` è un intero decimale con un segno iniziale opzionale. Il caso non è significativo, e ci deve essere almeno una cifra esadecimale nell'intero o nella frazione. Questa sintassi è simile a quella specificata nella sezione 6.4.4.2 dello standard C99, e anche a quella utilizzata in Java 1.5 in poi. In particolare, l'output di :meth:`float.hex` può essere utilizzato come letterale a virgola mobile esadecimale nel codice C o Java, e le stringhe esadecimali prodotte dal carattere di formato ``%a`` di C o da ``Double.toHexString`` di Java sono accettate da :meth:`float.fromhex`.

source: Note that the exponent is written in decimal rather than hexadecimal, and that it gives the power of 2 by which to multiply the coefficient. For example, the hexadecimal string ``0x3.a7p10`` represents the floating-point number ``(3 + 10./16 + 7./16**2) * 2.0**10``, or ``3740.0``::
it_it: Nota che l'esponente è scritto in decimale piuttosto che in esadecimale, e che fornisce la potenza di 2 con cui moltiplicare il coefficiente. Ad esempio, la stringa esadecimale ``0x3.a7p10`` rappresenta il numero in virgola mobile ``(3 + 10./16 + 7./16**2) * 2.0**10``, o ``3740.0``::

source: Applying the reverse conversion to ``3740.0`` gives a different hexadecimal string representing the same number::
it_it: Applicando la conversione inversa a ``3740.0`` si ottiene una stringa esadecimale diversa che rappresenta lo stesso numero::

source: Hashing of numeric types
it_it: Hashing dei tipi numerici

source: For numbers ``x`` and ``y``, possibly of different types, it's a requirement that ``hash(x) == hash(y)`` whenever ``x == y`` (see the :meth:`~object.__hash__` method documentation for more details). For ease of implementation and efficiency across a variety of numeric types (including :class:`int`, :class:`float`, :class:`decimal.Decimal` and :class:`fractions.Fraction`) Python's hash for numeric types is based on a single mathematical function that's defined for any rational number, and hence applies to all instances of :class:`int` and :class:`fractions.Fraction`, and all finite instances of :class:`float` and :class:`decimal.Decimal`. Essentially, this function is given by reduction modulo ``P`` for a fixed prime ``P``. The value of ``P`` is made available to Python as the :attr:`~sys.hash_info.modulus` attribute of :data:`sys.hash_info`.
it_it: Per i numeri ``x`` e ``y``, possibilmente di tipi diversi, è un requisito che ``hash(x) == hash(y)`` ogni volta che ``x == y`` (vedi la documentazione del metodo :meth:`~object.__hash__` per ulteriori dettagli). Per facilità di implementazione e efficienza in una varietà di tipi numerici (inclusi :class:`int`, :class:`float`, :class:`decimal.Decimal` e :class:`fractions.Fraction`) l'hash di Python per i tipi numerici si basa su una singola funzione matematica definita per qualsiasi numero razionale, e quindi si applica a tutte le istanze di :class:`int` e :class:`fractions.Fraction`, e tutte le istanze finite di :class:`float` e :class:`decimal.Decimal`. Essenzialmente, questa funzione è data dalla riduzione modulo ``P`` per un primo fisso ``P``. Il valore di ``P`` è reso disponibile a Python come l'attributo :attr:`~sys.hash_info.modulus` di :data:`sys.hash_info`.

source: Currently, the prime used is ``P = 2**31 - 1`` on machines with 32-bit C longs and ``P = 2**61 - 1`` on machines with 64-bit C longs.
it_it: Attualmente, il primo utilizzato è ``P = 2**31 - 1`` su macchine con long C a 32 bit e ``P = 2**61 - 1`` su macchine con long C a 64 bit.

source: Here are the rules in detail:
it_it: Ecco le regole in dettaglio:

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is not divisible by ``P``, define ``hash(x)`` as ``m * invmod(n, P) % P``, where ``invmod(n, P)`` gives the inverse of ``n`` modulo ``P``.
it_it: Se ``x = m / n`` è un numero razionale non negativo e ``n`` non è divisibile per ``P``, definire ``hash(x)`` come ``m * invmod(n, P) % P``, dove ``invmod(n, P)`` fornisce l'inverso di ``n`` modulo ``P``.

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is divisible by ``P`` (but ``m`` is not) then ``n`` has no inverse modulo ``P`` and the rule above doesn't apply; in this case define ``hash(x)`` to be the constant value ``sys.hash_info.inf``.
it_it: Se ``x = m / n`` è un numero razionale non negativo e ``n`` è divisibile per ``P`` (ma ``m`` non lo è), allora ``n`` non ha inverso modulo ``P`` e la regola sopra non si applica; in questo caso, definire ``hash(x)`` come il valore costante ``sys.hash_info.inf``.

source: If ``x = m / n`` is a negative rational number define ``hash(x)`` as ``-hash(-x)``. If the resulting hash is ``-1``, replace it with ``-2``.
it_it: Se ``x = m / n`` è un numero razionale negativo, definire ``hash(x)`` come ``-hash(-x)``. Se l'hash risultante è ``-1``, sostituirlo con ``-2``.

source: The particular values ``sys.hash_info.inf`` and ``-sys.hash_info.inf`` are used as hash values for positive infinity or negative infinity (respectively).
it_it: I valori particolari ``sys.hash_info.inf`` e ``-sys.hash_info.inf`` sono utilizzati come valori hash per l'infinito positivo o negativo (rispettivamente).

source: For a :class:`complex` number ``z``, the hash values of the real and imaginary parts are combined by computing ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, reduced modulo ``2**sys.hash_info.width`` so that it lies in ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Again, if the result is ``-1``, it's replaced with ``-2``.
it_it: Per un numero :class:`complex` ``z``, i valori hash delle parti reale e immaginaria sono combinati calcolando ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, ridotto modulo ``2**sys.hash_info.width`` in modo che rientri in ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Ancora una volta, se il risultato è ``-1``, viene sostituito con ``-2``.

source: To clarify the above rules, here's some example Python code, equivalent to the built-in hash, for computing the hash of a rational number, :class:`float`, or :class:`complex`::
it_it: Per chiarire le regole sopra, ecco un esempio di codice Python, equivalente all'hash integrato, per calcolare l'hash di un numero razionale, :class:`float` o :class:`complex`::

source: Boolean Type - :class:`bool`
it_it: Tipo Booleano - :class:`bool`

source: Booleans represent truth values. The :class:`bool` type has exactly two constant instances: ``True`` and ``False``.
it_it: I booleani rappresentano valori di verità. Il tipo :class:`bool` ha esattamente due istanze costanti: ``True`` e ``False``.

source: The built-in function :func:`bool` converts any value to a boolean, if the value can be interpreted as a truth value (see section :ref:`truth` above).
it_it: La funzione integrata :func:`bool` converte qualsiasi valore in un booleano, se il valore può essere interpretato come un valore di verità (vedi la sezione :ref:`truth` sopra).

source: For logical operations, use the :ref:`boolean operators <boolean>` ``and``, ``or`` and ``not``. When applying the bitwise operators ``&``, ``|``, ``^`` to two booleans, they return a bool equivalent to the logical operations "and", "or", "xor". However, the logical operators ``and``, ``or`` and ``!=`` should be preferred over ``&``, ``|`` and ``^``.
it_it: Per le operazioni logiche, utilizzare gli :ref:`operatori booleani <boolean>` ``and``, ``or`` e ``not``. Quando si applicano gli operatori bitwise ``&``, ``|``, ``^`` a due booleani, restituiscono un booleano equivalente alle operazioni logiche "and", "or", "xor". Tuttavia, gli operatori logici ``and``, ``or`` e ``!=`` dovrebbero essere preferiti a ``&``, ``|`` e ``^``.

source: The use of the bitwise inversion operator ``~`` is deprecated and will raise an error in Python 3.14.
it_it: L'uso dell'operatore di inversione bitwise ``~`` è deprecato e genererà un errore in Python 3.14.

source: :class:`bool` is a subclass of :class:`int` (see :ref:`typesnumeric`). In many numeric contexts, ``False`` and ``True`` behave like the integers 0 and 1, respectively. However, relying on this is discouraged; explicitly convert using :func:`int` instead.
it_it: :class:`bool` è una sottoclasse di :class:`int` (vedi :ref:`typesnumeric`). In molti contesti numerici, ``False`` e ``True`` si comportano come gli interi 0 e 1, rispettivamente. Tuttavia, affidarsi a ciò è sconsigliato; convertire esplicitamente utilizzando :func:`int`.

source: Iterator Types
it_it: Tipi di Iteratore

source: Python supports a concept of iteration over containers. This is implemented using two distinct methods; these are used to allow user-defined classes to support iteration. Sequences, described below in more detail, always support the iteration methods.
it_it: Python supporta un concetto di iterazione sui contenitori. Questo è implementato utilizzando due metodi distinti; questi sono utilizzati per consentire alle classi definite dall'utente di supportare l'iterazione. Le sequenze, descritte più dettagliatamente di seguito, supportano sempre i metodi di iterazione.

source: One method needs to be defined for container objects to provide :term:`iterable` support:
it_it: Un metodo deve essere definito per gli oggetti contenitore per fornire il supporto :term:`iterable`:

source: Return an :term:`iterator` object. The object is required to support the iterator protocol described below. If a container supports different types of iteration, additional methods can be provided to specifically request iterators for those iteration types. (An example of an object supporting multiple forms of iteration would be a tree structure which supports both breadth-first and depth-first traversal.) This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
it_it: Restituisce un oggetto :term:`iterator`. È richiesto che l'oggetto supporti il protocollo dell'iteratore descritto di seguito. Se un contenitore supporta diversi tipi di iterazione, possono essere forniti ulteriori metodi per richiedere specificamente iteratori per quei tipi di iterazione. (Un esempio di oggetto che supporta più forme di iterazione potrebbe essere una struttura ad albero che supporta sia l'attraversamento in ampiezza sia quello in profondità.) Questo metodo corrisponde allo slot :c:member:`~PyTypeObject.tp_iter` della struttura dei tipi per oggetti Python nell'API Python/C.

source: The iterator objects themselves are required to support the following two methods, which together form the :dfn:`iterator protocol`:
it_it: Gli oggetti iteratore stessi devono supportare i seguenti due metodi, che insieme formano il :dfn:`protocollo dell'iteratore`:

source: Return the :term:`iterator` object itself. This is required to allow both containers and iterators to be used with the :keyword:`for` and :keyword:`in` statements. This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
it_it: Restituisce l'oggetto :term:`iterator` stesso. Questo è richiesto per consentire sia ai contenitori che agli iteratori di essere utilizzati con le dichiarazioni :keyword:`for` e :keyword:`in`. Questo metodo corrisponde allo slot :c:member:`~PyTypeObject.tp_iter` della struttura dei tipi per oggetti Python nell'API Python/C.

source: Return the next item from the :term:`iterator`. If there are no further items, raise the :exc:`StopIteration` exception. This method corresponds to the :c:member:`~PyTypeObject.tp_iternext` slot of the type structure for Python objects in the Python/C API.
it_it: Restituisce il prossimo elemento dall':term:`iterator`. Se non ci sono ulteriori elementi, solleva l'eccezione :exc:`StopIteration`. Questo metodo corrisponde allo slot :c:member:`~PyTypeObject.tp_iternext` della struttura dei tipi per oggetti Python nell'API Python/C.

source: Python defines several iterator objects to support iteration over general and specific sequence types, dictionaries, and other more specialized forms. The specific types are not important beyond their implementation of the iterator protocol.
it_it: Python definisce diversi oggetti iteratore per supportare l'iterazione su tipi di sequenze generali e specifici, dizionari e altre forme più specializzate. I tipi specifici non sono importanti oltre la loro implementazione del protocollo dell'iteratore.

source: Once an iterator's :meth:`~iterator.__next__` method raises :exc:`StopIteration`, it must continue to do so on subsequent calls. Implementations that do not obey this property are deemed broken.
it_it: Una volta che il metodo :meth:`~iterator.__next__` di un iteratore solleva :exc:`StopIteration`, deve continuare a farlo nelle chiamate successive. Implementazioni che non rispettano questa proprietà sono considerate difettose.

source: Generator Types
it_it: Tipi di Generatore

source: Python's :term:`generator`\s provide a convenient way to implement the iterator protocol. If a container object's :meth:`~iterator.__iter__` method is implemented as a generator, it will automatically return an iterator object (technically, a generator object) supplying the :meth:`!__iter__` and :meth:`~generator.__next__` methods. More information about generators can be found in :ref:`the documentation for the yield expression <yieldexpr>`.
it_it: I :term:`generator`\i di Python forniscono un modo conveniente per implementare il protocollo iterator. Se il metodo :meth:`~iterator.__iter__` di un oggetto contenitore è implementato come un generatore, restituirà automaticamente un oggetto iteratore (tecnicamente, un oggetto generatore) che fornisce i metodi :meth:`!__iter__` e :meth:`~generator.__next__`. Maggiori informazioni sui generatori si possono trovare nella :ref:`documentazione sull'espressione yield <yieldexpr>`.

source: Sequence Types --- :class:`list`, :class:`tuple`, :class:`range`
it_it: Tipi di Sequenza --- :class:`list`, :class:`tuple`, :class:`range`

source: There are three basic sequence types: lists, tuples, and range objects. Additional sequence types tailored for processing of :ref:`binary data <binaryseq>` and :ref:`text strings <textseq>` are described in dedicated sections.
it_it: Esistono tre tipi di sequenza fondamentali: liste, tuple e oggetti range. Ulteriori tipi di sequenza adatti per l'elaborazione di :ref:`dati binari <binaryseq>` e :ref:`stringhe di testo <textseq>` sono descritti in sezioni dedicate.

source: Common Sequence Operations
it_it: Operazioni Comuni sulle Sequenze

source: The operations in the following table are supported by most sequence types, both mutable and immutable. The :class:`collections.abc.Sequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
it_it: Le operazioni nella tabella seguente sono supportate dalla maggior parte dei tipi di sequenza, sia mutabili che immutabili. La ABC :class:`collections.abc.Sequence` è fornita per facilitare l'implementazione corretta di queste operazioni su tipi di sequenza personalizzati.

source: This table lists the sequence operations sorted in ascending priority. In the table, *s* and *t* are sequences of the same type, *n*, *i*, *j* and *k* are integers and *x* is an arbitrary object that meets any type and value restrictions imposed by *s*.
it_it: Questa tabella elenca le operazioni di sequenza ordinate in ordine crescente di priorità. Nella tabella, *s* e *t* sono sequenze dello stesso tipo, *n*, *i*, *j* e *k* sono interi e *x* è un oggetto arbitrario che soddisfa eventuali restrizioni di tipo e valore imposte da *s*.

source: The ``in`` and ``not in`` operations have the same priorities as the comparison operations. The ``+`` (concatenation) and ``*`` (repetition) operations have the same priority as the corresponding numeric operations. [3]_
it_it: Le operazioni ``in`` e ``not in`` hanno le stesse priorità delle operazioni di confronto. Le operazioni ``+`` (concatenazione) e ``*`` (ripetizione) hanno la stessa priorità delle corrispondenti operazioni numeriche. [3]_

source: ``True`` if an item of *s* is equal to *x*, else ``False``
it_it: ``True`` se un elemento di *s* è uguale a *x*, altrimenti ``False``

source: ``False`` if an item of *s* is equal to *x*, else ``True``
it_it: ``False`` se un elemento di *s* è uguale a *x*, altrimenti ``True``

source: the concatenation of *s* and *t*
it_it: la concatenazione di *s* e *t*

source: ``s * n`` or ``n * s``
it_it: ``s * n`` o ``n * s``

source: equivalent to adding *s* to itself *n* times
it_it: equivalente ad aggiungere *s* a se stesso *n* volte

source: *i*\ th item of *s*, origin 0
it_it: *i*-esimo elemento di *s*, origine 0

source: slice of *s* from *i* to *j*
it_it: fetta di *s* da *i* a *j*
