Repository: Addivsyou/python-docs-it
Catalog: install/index.po
Languages: it_it

source: This subsection describes the necessary steps to use Distutils with the Borland C++ compiler version 5.5. First you have to know that Borland's object file format (OMF) is different from the format used by the Python version you can download from the Python or ActiveState web site. (Python is built with Microsoft Visual C++, which uses COFF as the object file format.) For this reason you have to convert Python's library :file:`python25.lib` into the Borland format. You can do this as follows:
it_it: Questa sottosezione descrive i passaggi necessari per utilizzare Distutils con il compilatore Borland C++ versione 5.5. Prima devi sapere che il formato dei file oggetto di Borland (OMF) è diverso dal formato utilizzato dalla versione di Python che puoi scaricare dal sito web di Python o ActiveState. (Python è compilato con Microsoft Visual C++, che usa COFF come formato di file oggetto.) Per questo motivo devi convertire la libreria di Python :file:`python25.lib` nel formato Borland. Puoi farlo come segue:

source: The :file:`coff2omf` program comes with the Borland compiler. The file :file:`python25.lib` is in the :file:`Libs` directory of your Python installation. If your extension uses other libraries (zlib, ...) you have to convert them too.
it_it: Il programma :file:`coff2omf` è fornito con il compilatore Borland. Il file :file:`python25.lib` si trova nella directory :file:`Libs` della tua installazione di Python. Se la tua estensione utilizza altre librerie (zlib, ...) devi convertirle anche tu.

source: The converted files have to reside in the same directories as the normal libraries.
it_it: I file convertiti devono risiedere nelle stesse directory delle librerie normali.

source: How does Distutils manage to use these libraries with their changed names? If the extension needs a library (eg. :file:`foo`) Distutils checks first if it finds a library with suffix :file:`_bcpp` (eg. :file:`foo_bcpp.lib`) and then uses this library. In the case it doesn't find such a special library it uses the default name (:file:`foo.lib`.) [#]_
it_it: Come fa Distutils a usare queste librerie con i loro nomi cambiati? Se l'estensione necessita di una libreria (ad es. :file:`foo`), Distutils verifica prima se trova una libreria con il suffisso :file:`_bcpp` (ad es. :file:`foo_bcpp.lib`) e poi usa questa libreria. Nel caso in cui non trovi una libreria speciale, utilizza il nome predefinito (:file:`foo.lib`). [#]_

source: To let Distutils compile your extension with Borland C++ you now have to type::
it_it: Per far compilare la tua estensione a Distutils con Borland C++, ora devi digitare::

source: If you want to use the Borland C++ compiler as the default, you could specify this in your personal or system-wide configuration file for Distutils (see section :ref:`inst-config-files`.)
it_it: Se desideri usare il compilatore Borland C++ come predefinito, potresti specificarlo nel tuo file di configurazione personale o di sistema per Distutils (vedi sezione :ref:`inst-config-files`).

source: Information about the free C++ compiler from Borland, including links to the download pages.
it_it: Informazioni sul compilatore C++ gratuito di Borland, inclusi i link alle pagine di download.

source: `Creating Python Extensions Using Borland's Free Compiler <http://www.cyberus.ca/~g_will/pyExtenDL.shtml>`_
it_it: `Creare Estensioni Python Usando il Compilatore Gratuito di Borland <http://www.cyberus.ca/~g_will/pyExtenDL.shtml>`_

source: Document describing how to use Borland's free command-line C++ compiler to build Python.
it_it: Documento che descrive come usare il compilatore C++ a riga di comando gratuito di Borland per costruire Python.

source: This section describes the necessary steps to use Distutils with the GNU C/C++ compilers in their Cygwin and MinGW distributions. [#]_ For a Python interpreter that was built with Cygwin, everything should work without any of these following steps.
it_it: Questa sezione descrive i passaggi necessari per usare Distutils con i compilatori GNU C/C++ nelle loro distribuzioni Cygwin e MinGW. [#]_ Per un interprete Python costruito con Cygwin, tutto dovrebbe funzionare senza nessuno dei seguenti passaggi.

source: Not all extensions can be built with MinGW or Cygwin, but many can. Extensions most likely to not work are those that use C++ or depend on Microsoft Visual C extensions.
it_it: Non tutte le estensioni possono essere costruite con MinGW o Cygwin, ma molte sì. Le estensioni che probabilmente non funzioneranno sono quelle che usano C++ o dipendono dalle estensioni Microsoft Visual C.

source: To let Distutils compile your extension with Cygwin you have to type::
it_it: Per far compilare la tua estensione a Distutils con Cygwin devi digitare::

source: and for Cygwin in no-cygwin mode [#]_ or for MinGW type::
it_it: e per Cygwin in modalità no-cygwin [#]_ o per MinGW digitare::

source: If you want to use any of these options/compilers as default, you should consider writing it in your personal or system-wide configuration file for Distutils (see section :ref:`inst-config-files`.)
it_it: Se desideri usare una di queste opzioni/compilatori come predefinito, dovresti considerare di scriverlo nel tuo file di configurazione personale o di sistema per Distutils (vedi sezione :ref:`inst-config-files`).

source: Older Versions of Python and MinGW
it_it: Versioni Precedenti di Python e MinGW

source: The following instructions only apply if you're using a version of Python inferior to 2.4.1 with a MinGW inferior to 3.0.0 (with binutils-2.13.90-20030111-1).
it_it: Le seguenti istruzioni si applicano solo se stai usando una versione di Python inferiore alla 2.4.1 con un MinGW inferiore alla 3.0.0 (con binutils-2.13.90-20030111-1).

source: These compilers require some special libraries. This task is more complex than for Borland's C++, because there is no program to convert the library. First you have to create a list of symbols which the Python DLL exports. (You can find a good program for this task at https://sourceforge.net/projects/mingw/files/MinGW/Extension/pexports/).
it_it: Questi compilatori richiedono alcune librerie speciali. Questo compito è più complesso rispetto a Borland C++, perché non esiste un programma per convertire la libreria. Prima devi creare un elenco di simboli che la DLL di Python esporta. (Puoi trovare un buon programma per questo compito su https://sourceforge.net/projects/mingw/files/MinGW/Extension/pexports/).

source: The location of an installed :file:`python25.dll` will depend on the installation options and the version and language of Windows. In a "just for me" installation, it will appear in the root of the installation directory. In a shared installation, it will be located in the system directory.
it_it: La posizione di un :file:`python25.dll` installato dipenderà dalle opzioni di installazione, dalla versione e dalla lingua di Windows. In un'installazione "solo per me", apparirà nella radice della directory di installazione. In un'installazione condivisa, si troverà nella directory di sistema.

source: Then you can create from these information an import library for gcc. ::
it_it: Poi puoi creare da queste informazioni una libreria di importazione per gcc. ::

source: The resulting library has to be placed in the same directory as :file:`python25.lib`. (Should be the :file:`libs` directory under your Python installation directory.)
it_it: La libreria risultante deve essere posizionata nella stessa directory di :file:`python25.lib` (dovrebbe essere la directory :file:`libs` sotto la directory di installazione di Python).

source: If your extension uses other libraries (zlib,...) you might have to convert them too. The converted files have to reside in the same directories as the normal libraries do.
it_it: Se la tua estensione utilizza altre librerie (zlib,...) potrebbe essere necessario convertirle anch'esse. I file convertiti devono risiedere nelle stesse directory delle librerie normali.

source: `Building Python modules on MS Windows platform with MinGW <https://old.zope.dev/Members/als/tips/win32_mingw_modules>`_
it_it: `Costruire moduli Python sulla piattaforma MS Windows con MinGW <https://old.zope.dev/Members/als/tips/win32_mingw_modules>`_

source: Information about building the required libraries for the MinGW environment.
it_it: Informazioni sulla costruzione delle librerie richieste per l'ambiente MinGW.

source: Footnotes
it_it: Note (Footnotes)

source: This also means you could replace all existing COFF-libraries with OMF-libraries of the same name.
it_it: Questo significa anche che potresti sostituire tutte le librerie COFF esistenti con librerie OMF dello stesso nome.

source: Check https://www.sourceware.org/cygwin/ for more information
it_it: Controlla https://www.sourceware.org/cygwin/ per ulteriori informazioni

source: Then you have no POSIX emulation available, but you also don't need :file:`cygwin1.dll`.
it_it: Poi non avrai l'emulazione POSIX disponibile, ma non ti servirà neanche :file:`cygwin1.dll`.
