Repository: Addivsyou/python-docs-it
Catalog: install/index.po
Languages: it_it

source: Installing Python Modules (Legacy version)
it_it: Installazione di Moduli Python (Versione Legacy)

source: Author
it_it: Autore

source: The entire ``distutils`` package has been deprecated and will be removed in Python 3.12. This documentation is retained as a reference only, and will be removed with the package. See the :ref:`What's New <distutils-deprecated>` entry for more information.
it_it: L'intero pacchetto ``distutils`` è stato deprecato e sarà rimosso in Python 3.12. Questa documentazione è conservata solo come riferimento e sarà rimossa insieme al pacchetto. Vedi l'entrata :ref:`What's New <distutils-deprecated>` per maggiori informazioni.

source: The up to date module installation documentation. For regular Python usage, you almost certainly want that document rather than this one.
it_it: La documentazione aggiornata sull'installazione dei moduli. Per l'uso regolare di Python, sicuramente vorrai quel documento piuttosto che questo.

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
it_it: Questo documento è mantenuto esclusivamente fino a quando la documentazione di ``setuptools`` su https://setuptools.readthedocs.io/en/latest/setuptools.html coprirà autonomamente tutte le informazioni rilevanti attualmente incluse qui.

source: This guide only covers the basic tools for building and distributing extensions that are provided as part of this version of Python. Third party tools offer easier to use and more secure alternatives. Refer to the `quick recommendations section <https://packaging.python.org/guides/tool-recommendations/>`__ in the Python Packaging User Guide for more information.
it_it: Questa guida copre solo gli strumenti di base per costruire e distribuire estensioni forniti come parte di questa versione di Python. Strumenti di terze parti offrono alternative più facili da usare e più sicure. Consulta la `sezione raccomandazioni rapide <https://packaging.python.org/guides/tool-recommendations/>`__ nella Python Packaging User Guide per maggiori informazioni.

source: Introduction
it_it: Introduzione

source: In Python 2.0, the ``distutils`` API was first added to the standard library. This provided Linux distro maintainers with a standard way of converting Python projects into Linux distro packages, and system administrators with a standard way of installing them directly onto target systems.
it_it: In Python 2.0, l'API ``distutils`` è stata aggiunta per la prima volta alla libreria standard. Questo ha fornito ai manutentori delle distro Linux un modo standard di convertire i progetti Python in pacchetti delle distro Linux, e agli amministratori di sistema un modo standard di installarli direttamente sui sistemi target.

source: In the many years since Python 2.0 was released, tightly coupling the build system and package installer to the language runtime release cycle has turned out to be problematic, and it is now recommended that projects use the ``pip`` package installer and the ``setuptools`` build system, rather than using ``distutils`` directly.
it_it: Nei molti anni successivi al rilascio di Python 2.0, il legame stretto tra sistema di build e installatore di pacchetti al ciclo di rilascio del runtime linguistico si è rivelato problematico, ed è ora raccomandato che i progetti usino l'installatore di pacchetti ``pip`` e il sistema di build ``setuptools``, piuttosto che usare direttamente ``distutils``.

source: See :ref:`installing-index` and :ref:`distributing-index` for more details.
it_it: Vedi :ref:`installing-index` e :ref:`distributing-index` per maggiori dettagli.

source: This legacy documentation is being retained only until we're confident that the ``setuptools`` documentation covers everything needed.
it_it: Questa documentazione legacy viene mantenuta solo fino a quando non saremo sicuri che la documentazione di ``setuptools`` copre tutto ciò che è necessario.

source: Distutils based source distributions
it_it: Distribuzioni sorgente basate su Distutils

source: If you download a module source distribution, you can tell pretty quickly if it was packaged and distributed in the standard way, i.e. using the Distutils. First, the distribution's name and version number will be featured prominently in the name of the downloaded archive, e.g. :file:`foo-1.0.tar.gz` or :file:`widget-0.9.7.zip`. Next, the archive will unpack into a similarly named directory: :file:`foo-1.0` or :file:`widget-0.9.7`. Additionally, the distribution will contain a setup script :file:`setup.py`, and a file named :file:`README.txt` or possibly just :file:`README`, which should explain that building and installing the module distribution is a simple matter of running one command from a terminal::
it_it: Se scarichi una distribuzione sorgente di un modulo, puoi capire rapidamente se è stata confezionata e distribuita nel modo standard, cioè usando Distutils. Innanzitutto, il nome della distribuzione e il numero di versione saranno chiaramente indicati nel nome dell'archivio scaricato, ad esempio :file:`foo-1.0.tar.gz` o :file:`widget-0.9.7.zip`. Successivamente, l'archivio si decomprimerà in una directory con un nome simile: :file:`foo-1.0` o :file:`widget-0.9.7`. Inoltre, la distribuzione conterrà uno script di setup :file:`setup.py`, e un file denominato :file:`README.txt` o possibilmente solo :file:`README`, che dovrebbe spiegare che costruire e installare la distribuzione del modulo è una questione semplice di eseguire un comando da un terminale::

source: For Windows, this command should be run from a command prompt window (:menuselection:`Start --> Accessories`)::
it_it: Per Windows, questo comando dovrebbe essere eseguito da una finestra del prompt dei comandi (:menuselection:`Start --> Accessories`)::

source: If all these things are true, then you already know how to build and install the modules you've just downloaded: Run the command above. Unless you need to install things in a non-standard way or customize the build process, you don't really need this manual. Or rather, the above command is everything you need to get out of this manual.
it_it: Se tutte queste cose sono vere, allora sai già come costruire e installare i moduli che hai appena scaricato: esegui il comando sopra. A meno che tu non abbia bisogno di installare le cose in un modo non standard o di personalizzare il processo di build, non hai veramente bisogno di questo manuale. O meglio, il comando sopra è tutto ciò che ti serve ottenere da questo manuale.

source: Standard Build and Install
it_it: Costruzione e Installazione Standard

source: As described in section :ref:`inst-new-standard`, building and installing a module distribution using the Distutils is usually one simple command to run from a terminal::
it_it: Come descritto nella sezione :ref:`inst-new-standard`, costruire e installare una distribuzione di moduli utilizzando Distutils è solitamente un semplice comando da eseguire da un terminale::

source: Platform variations
it_it: Variazioni della piattaforma

source: You should always run the setup command from the distribution root directory, i.e. the top-level subdirectory that the module source distribution unpacks into. For example, if you've just downloaded a module source distribution :file:`foo-1.0.tar.gz` onto a Unix system, the normal thing to do is::
it_it: Dovresti sempre eseguire il comando di setup dalla directory radice della distribuzione, cioè la sottodirectory di livello più alto in cui si decomprime la distribuzione sorgente del modulo. Ad esempio, se hai appena scaricato una distribuzione sorgente di un modulo :file:`foo-1.0.tar.gz` su un sistema Unix, la cosa normale da fare è::

source: On Windows, you'd probably download :file:`foo-1.0.zip`. If you downloaded the archive file to :file:`C:\\Temp`, then it would unpack into :file:`C:\\Temp\\foo-1.0`; you can use either an archive manipulator with a graphical user interface (such as WinZip) or a command-line tool (such as :program:`unzip` or :program:`pkunzip`) to unpack the archive. Then, open a command prompt window and run::
it_it: Su Windows, probabilmente scaricherai :file:`foo-1.0.zip`. Se hai scaricato il file archivio in :file:`C:\\Temp`, si decomprimerà in :file:`C:\\Temp\\foo-1.0`; puoi usare un manipolatore di archivi con interfaccia grafica (come WinZip) o uno strumento a riga di comando (come :program:`unzip` o :program:`pkunzip`) per decomprimere l'archivio. Poi, apri una finestra del prompt dei comandi e esegui::

source: Splitting the job up
it_it: Suddividere il lavoro

source: Running ``setup.py install`` builds and installs all modules in one run. If you prefer to work incrementally---especially useful if you want to customize the build process, or if things are going wrong---you can use the setup script to do one thing at a time. This is particularly helpful when the build and install will be done by different users---for example, you might want to build a module distribution and hand it off to a system administrator for installation (or do it yourself, with super-user privileges).
it_it: Eseguire ``setup.py install`` costruisce e installa tutti i moduli in una sola esecuzione. Se preferisci lavorare incrementamente—particolarmente utile se vuoi personalizzare il processo di build, o se le cose vanno male—puoi usare lo script di setup per fare una cosa alla volta. Questo è particolarmente utile quando la costruzione e l'installazione saranno eseguite da utenti diversi—ad esempio, potresti voler costruire una distribuzione di moduli e passarla a un amministratore di sistema per l'installazione (o farlo tu stesso, con privilegi da superutente).

source: For example, you can build everything in one step, and then install everything in a second step, by invoking the setup script twice::
it_it: Ad esempio, puoi costruire tutto in un passaggio, e poi installare tutto in un secondo passaggio, chiamando due volte lo script di setup::

source: If you do this, you will notice that running the :command:`install` command first runs the :command:`build` command, which---in this case---quickly notices that it has nothing to do, since everything in the :file:`build` directory is up-to-date.
it_it: Se fai questo, noterai che eseguire il comando :command:`install` eseguirà prima il comando :command:`build`, il quale—in questo caso—nota rapidamente che non ha nulla da fare, poiché tutto nella directory :file:`build` è aggiornato.

source: You may not need this ability to break things down often if all you do is install modules downloaded off the 'net, but it's very handy for more advanced tasks. If you get into distributing your own Python modules and extensions, you'll run lots of individual Distutils commands on their own.
it_it: Potresti non aver bisogno spesso di questa capacità di suddividere le cose se tutto ciò che fai è installare moduli scaricati da Internet, ma è molto utile per compiti più avanzati. Se ti occupi della distribuzione dei tuoi moduli Python ed estensioni, eseguirai molti comandi individuali di Distutils da soli.

source: How building works
it_it: Come funziona la costruzione

source: As implied above, the :command:`build` command is responsible for putting the files to install into a *build directory*. By default, this is :file:`build` under the distribution root; if you're excessively concerned with speed, or want to keep the source tree pristine, you can change the build directory with the :option:`!--build-base` option. For example::
it_it: Come implicato sopra, il comando :command:`build` è responsabile di mettere i file da installare in una *build directory*. Per impostazione predefinita, questa è :file:`build` sotto la radice della distribuzione; se sei eccessivamente preoccupato per la velocità, o vuoi mantenere l'albero delle sorgenti pulito, puoi cambiare la build directory con l'opzione :option:`!--build-base`. Ad esempio::

source: (Or you could do this permanently with a directive in your system or personal Distutils configuration file; see section :ref:`inst-config-files`.) Normally, this isn't necessary.
it_it: (Oppure potresti farlo permanentemente con una direttiva nel file di configurazione del sistema o personale di Distutils; vedi la sezione :ref:`inst-config-files`.) Normalmente, questo non è necessario.

source: The default layout for the build tree is as follows::
it_it: Il layout predefinito dell'albero di build è il seguente::

source: where ``<plat>`` expands to a brief description of the current OS/hardware platform and Python version. The first form, with just a :file:`lib` directory, is used for "pure module distributions"---that is, module distributions that include only pure Python modules. If a module distribution contains any extensions (modules written in C/C++), then the second form, with two ``<plat>`` directories, is used. In that case, the :file:`temp.{plat}` directory holds temporary files generated by the compile/link process that don't actually get installed. In either case, the :file:`lib` (or :file:`lib.{plat}`) directory contains all Python modules (pure Python and extensions) that will be installed.
it_it: dove ``<plat>`` si espande a una breve descrizione del piattaforma OS/hardware corrente e versione di Python. La prima forma, con solo una directory :file:`lib`, è utilizzata per "distribuzioni di moduli puri"—cioè, distribuzioni di moduli che includono solo moduli Python puri. Se una distribuzione di moduli contiene estensioni (moduli scritti in C/C++), allora la seconda forma, con due directory ``<plat>``, è utilizzata. In tal caso, la directory :file:`temp.{plat}` contiene file temporanei generati dal processo di compilazione/collegamento che non vengono effettivamente installati. In entrambi i casi, la directory :file:`lib` (o :file:`lib.{plat}`) contiene tutti i moduli Python (Python puri ed estensioni) che saranno installati.

source: In the future, more directories will be added to handle Python scripts, documentation, binary executables, and whatever else is needed to handle the job of installing Python modules and applications.
it_it: In futuro, verranno aggiunte più directory per gestire script Python, documentazione, eseguibili binari e tutto ciò che è necessario per gestire l'installazione di moduli e applicazioni Python.

source: How installation works
it_it: Come funziona l'installazione

source: After the :command:`build` command runs (whether you run it explicitly, or the :command:`install` command does it for you), the work of the :command:`install` command is relatively simple: all it has to do is copy everything under :file:`build/lib` (or :file:`build/lib.{plat}`) to your chosen installation directory.
it_it: Dopo che il comando :command:`build` viene eseguito (che tu lo esegua esplicitamente o che lo faccia il comando :command:`install` per te), il lavoro del comando :command:`install` è relativamente semplice: tutto ciò che deve fare è copiare tutto sotto :file:`build/lib` (o :file:`build/lib.{plat}`) nella directory di installazione scelta.

source: If you don't choose an installation directory---i.e., if you just run ``setup.py install``\ ---then the :command:`install` command installs to the standard location for third-party Python modules. This location varies by platform and by how you built/installed Python itself. On Unix (and macOS, which is also Unix-based), it also depends on whether the module distribution being installed is pure Python or contains extensions ("non-pure"):
it_it: Se non scegli una directory di installazione—cioè, se esegui semplicemente ``setup.py install``\ ---allora il comando :command:`install` installerà nella posizione standard per i moduli Python di terze parti. Questa posizione varia in base alla piattaforma e a come hai costruito/installato Python stesso. Su Unix (e macOS, che è anche basato su Unix), dipende anche dal fatto che la distribuzione dei moduli installata sia pura Python o contenga estensioni ("non puri"):

source: Platform
it_it: Piattaforma

source: Standard installation location
it_it: Posizione di installazione standard

source: Default value
it_it: Valore predefinito

source: Notes
it_it: Note

source: Unix (pure)
it_it: Unix (puro)

source: Unix (non-pure)
it_it: Unix (non puro)

source: Notes:
it_it: Note:

source: Most Linux distributions include Python as a standard part of the system, so :file:`{prefix}` and :file:`{exec-prefix}` are usually both :file:`/usr` on Linux. If you build Python yourself on Linux (or any Unix-like system), the default :file:`{prefix}` and :file:`{exec-prefix}` are :file:`/usr/local`.
it_it: La maggior parte delle distribuzioni Linux include Python come parte standard del sistema, quindi :file:`{prefix}` e :file:`{exec-prefix}` sono solitamente entrambi :file:`/usr` su Linux. Se compili Python da te su Linux (o qualsiasi sistema simile a Unix), i valori predefiniti per :file:`{prefix}` e :file:`{exec-prefix}` sono :file:`/usr/local`.

source: The default installation directory on Windows was :file:`C:\\Program Files\\Python` under Python 1.6a1, 1.5.2, and earlier.
it_it: La directory di installazione predefinita su Windows era :file:`C:\\Program Files\\Python` nelle versioni Python 1.6a1, 1.5.2 e precedenti.

source: :file:`{prefix}` and :file:`{exec-prefix}` stand for the directories that Python is installed to, and where it finds its libraries at run-time. They are always the same under Windows, and very often the same under Unix and macOS. You can find out what your Python installation uses for :file:`{prefix}` and :file:`{exec-prefix}` by running Python in interactive mode and typing a few simple commands. Under Unix, just type ``python`` at the shell prompt. Under Windows, choose :menuselection:`Start --> Programs --> Python X.Y --> Python (command line)`. Once the interpreter is started, you type Python code at the prompt. For example, on my Linux system, I type the three Python statements shown below, and get the output as shown, to find out my :file:`{prefix}` and :file:`{exec-prefix}`:
it_it: :file:`{prefix}` e :file:`{exec-prefix}` rappresentano le directory in cui Python è installato e dove trova le sue librerie durante l'esecuzione. Sono sempre uguali su Windows e molto spesso uguali su Unix e macOS. Puoi scoprire quali sono i valori di :file:`{prefix}` e :file:`{exec-prefix}` per la tua installazione di Python eseguendo Python in modalità interattiva e digitando alcuni semplici comandi. Su Unix, basta digitare ``python`` al prompt della shell. Su Windows, scegliere :menuselection:`Start --> Programs --> Python X.Y --> Python (command line)`. Una volta avviato l'interprete, si digita il codice Python al prompt. Ad esempio, sul mio sistema Linux, digito i tre comandi Python mostrati di seguito e ottengo l'output come mostrato, per trovare :file:`{prefix}` e :file:`{exec-prefix}`:

source: A few other placeholders are used in this document: :file:`{X.Y}` stands for the version of Python, for example ``3.2``; :file:`{abiflags}` will be replaced by the value of :data:`sys.abiflags` or the empty string for platforms which don't define ABI flags; :file:`{distname}` will be replaced by the name of the module distribution being installed. Dots and capitalization are important in the paths; for example, a value that uses ``python3.2`` on UNIX will typically use ``Python32`` on Windows.
it_it: In questo documento sono utilizzati anche alcuni altri segnaposto: :file:`{X.Y}` rappresenta la versione di Python, ad esempio ``3.2``; :file:`{abiflags}` verrà sostituito con il valore di :data:`sys.abiflags` o con la stringa vuota per le piattaforme che non definiscono flag ABI; :file:`{distname}` verrà sostituito con il nome della distribuzione del modulo in installazione. I punti e la capitalizzazione sono importanti nei percorsi; ad esempio, un valore che utilizza ``python3.2`` su UNIX utilizzerà tipicamente ``Python32`` su Windows.

source: If you don't want to install modules to the standard location, or if you don't have permission to write there, then you need to read about alternate installations in section :ref:`inst-alt-install`. If you want to customize your installation directories more heavily, see section :ref:`inst-custom-install` on custom installations.
it_it: Se non vuoi installare moduli nella posizione standard, o se non hai il permesso di scrivere lì, allora devi leggere delle installazioni alternative nella sezione :ref:`inst-alt-install`. Se vuoi personalizzare maggiormente le directory di installazione, consulta la sezione :ref:`inst-custom-install` sulle installazioni personalizzate.

source: Alternate Installation
it_it: Installazione alternativa

source: Often, it is necessary or desirable to install modules to a location other than the standard location for third-party Python modules. For example, on a Unix system you might not have permission to write to the standard third-party module directory. Or you might wish to try out a module before making it a standard part of your local Python installation. This is especially true when upgrading a distribution already present: you want to make sure your existing base of scripts still works with the new version before actually upgrading.
it_it: Spesso è necessario o desiderabile installare moduli in una posizione diversa da quella standard per i moduli Python di terze parti. Ad esempio, su un sistema Unix potresti non avere il permesso di scrivere nella directory standard dei moduli di terze parti. Oppure potresti voler provare un modulo prima di renderlo parte standard dell'installazione locale di Python. Questo è particolarmente vero quando si aggiorna una distribuzione già presente: si vuole assicurarsi che la base di script esistente funzioni ancora con la nuova versione prima di procedere effettivamente con l'aggiornamento.

source: The Distutils :command:`install` command is designed to make installing module distributions to an alternate location simple and painless. The basic idea is that you supply a base directory for the installation, and the :command:`install` command picks a set of directories (called an *installation scheme*) under this base directory in which to install files. The details differ across platforms, so read whichever of the following sections applies to you.
it_it: Il comando :command:`install` di Distutils è progettato per rendere l'installazione di distribuzioni di moduli in una posizione alternativa semplice e senza problemi. L'idea di base è che si fornisce una directory di base per l'installazione e il comando :command:`install` sceglie un insieme di directory (chiamato uno *schema di installazione*) sotto questa directory di base in cui installare i file. I dettagli differiscono tra le piattaforme, quindi leggi la sezione che si applica al tuo caso.

source: Note that the various alternate installation schemes are mutually exclusive: you can pass ``--user``, or ``--home``, or ``--prefix`` and ``--exec-prefix``, or ``--install-base`` and ``--install-platbase``, but you can't mix from these groups.
it_it: Nota che i vari schemi di installazione alternativi sono mutuamente esclusivi: puoi passare ``--user``, o ``--home``, o ``--prefix`` e ``--exec-prefix``, o ``--install-base`` e ``--install-platbase``, ma non puoi mescolare questi gruppi.

source: Alternate installation: the user scheme
it_it: Installazione alternativa: lo schema utente
