Repository: Addivsyou/python-docs-it
Catalog: install/index.po
Languages: it_it

source: This scheme is designed to be the most convenient solution for users that don't have write permission to the global site-packages directory or don't want to install into it. It is enabled with a simple option::
it_it: Questo schema è progettato per essere la soluzione più conveniente per gli utenti che non hanno il permesso di scrivere nella directory globale site-packages o non vogliono installare in essa. È abilitato con una semplice opzione::

source: Files will be installed into subdirectories of :data:`site.USER_BASE` (written as :file:`{userbase}` hereafter). This scheme installs pure Python modules and extension modules in the same location (also known as :data:`site.USER_SITE`). Here are the values for UNIX, including macOS:
it_it: I file verranno installati nelle sottodirectory di :data:`site.USER_BASE` (qui scritto come :file:`{userbase}` in seguito). Questo schema installa moduli Python puri e moduli di estensione nello stesso luogo (anche noto come :data:`site.USER_SITE`). Ecco i valori per UNIX, incluso macOS:

source: Type of file
it_it: Tipo di file

source: Installation directory
it_it: Directory di installazione

source: modules
it_it: moduli

source: scripts
it_it: script

source: data
it_it: dati

source: C headers
it_it: Intestazioni C

source: And here are the values used on Windows:
it_it: Ecco i valori usati su Windows:

source: The advantage of using this scheme compared to the other ones described below is that the user site-packages directory is under normal conditions always included in :data:`sys.path` (see :mod:`site` for more information), which means that there is no additional step to perform after running the :file:`setup.py` script to finalize the installation.
it_it: Il vantaggio di utilizzare questo schema rispetto a quelli descritti di seguito è che la directory user site-packages è sotto condizioni normali sempre inclusa in :data:`sys.path` (vedi :mod:`site` per maggiori informazioni), il che significa che non c'è un ulteriore passaggio da eseguire dopo l'esecuzione dello script :file:`setup.py` per finalizzare l'installazione.

source: The :command:`build_ext` command also has a ``--user`` option to add :file:`{userbase}/include` to the compiler search path for header files and :file:`{userbase}/lib` to the compiler search path for libraries as well as to the runtime search path for shared C libraries (rpath).
it_it: Il comando :command:`build_ext` ha anche un'opzione ``--user`` per aggiungere :file:`{userbase}/include` al percorso di ricerca del compilatore per i file header e :file:`{userbase}/lib` al percorso di ricerca del compilatore per le librerie, nonché al percorso di ricerca runtime per le librerie C condivise (rpath).

source: Alternate installation: the home scheme
it_it: Installazione alternativa: lo schema home

source: The idea behind the "home scheme" is that you build and maintain a personal stash of Python modules. This scheme's name is derived from the idea of a "home" directory on Unix, since it's not unusual for a Unix user to make their home directory have a layout similar to :file:`/usr/` or :file:`/usr/local/`. This scheme can be used by anyone, regardless of the operating system they are installing for.
it_it: L'idea alla base dello "schema home" è di costruire e mantenere una raccolta personale di moduli Python. Il nome di questo schema deriva dall'idea di una directory "home" su Unix, poiché non è insolito per un utente Unix far sì che la propria directory home abbia una disposizione simile a :file:`/usr/` o :file:`/usr/local/`. Questo schema può essere utilizzato da chiunque, indipendentemente dal sistema operativo su cui si sta installando.

source: Installing a new module distribution is as simple as ::
it_it: Installare una nuova distribuzione di moduli è semplice come::

source: where you can supply any directory you like for the :option:`!--home` option. On Unix, lazy typists can just type a tilde (``~``); the :command:`install` command will expand this to your home directory::
it_it: dove puoi fornire qualsiasi directory ti piaccia per l'opzione :option:`!--home`. Su Unix, i dattilografi pigri possono semplicemente digitare una tilde (``~``); il comando :command:`install` espanderà questo alla tua directory home::

source: To make Python find the distributions installed with this scheme, you may have to :ref:`modify Python's search path <inst-search-path>` or edit :mod:`sitecustomize` (see :mod:`site`) to call :func:`site.addsitedir` or edit :data:`sys.path`.
it_it: Per fare in modo che Python trovi le distribuzioni installate con questo schema, potrebbe essere necessario :ref:`modificare il percorso di ricerca di Python <inst-search-path>` o modificare :mod:`sitecustomize` (vedi :mod:`site`) per chiamare :func:`site.addsitedir` o modificare :data:`sys.path`.

source: The :option:`!--home` option defines the installation base directory. Files are installed to the following directories under the installation base as follows:
it_it: L'opzione :option:`!--home` definisce la directory di base dell'installazione. I file sono installati nelle seguenti directory sotto la base dell'installazione come segue:

source: (Mentally replace slashes with backslashes if you're on Windows.)
it_it: (Mentalmente sostituisci le barre con le backslash se sei su Windows.)

source: Alternate installation: Unix (the prefix scheme)
it_it: Installazione alternativa: Unix (lo schema prefix)

source: The "prefix scheme" is useful when you wish to use one Python installation to perform the build/install (i.e., to run the setup script), but install modules into the third-party module directory of a different Python installation (or something that looks like a different Python installation). If this sounds a trifle unusual, it is---that's why the user and home schemes come before. However, there are at least two known cases where the prefix scheme will be useful.
it_it: Lo "schema prefix" è utile quando si vuole utilizzare un'installazione di Python per eseguire la build/install (cioè per eseguire lo script di setup), ma installare i moduli nella directory dei moduli di terze parti di un'altra installazione di Python (o qualcosa che assomiglia a un'altra installazione di Python). Se questo sembra un po' insolito, lo è, ecco perché gli schemi utente e home vengono prima. Tuttavia, ci sono almeno due casi noti in cui lo schema prefix sarà utile.

source: First, consider that many Linux distributions put Python in :file:`/usr`, rather than the more traditional :file:`/usr/local`. This is entirely appropriate, since in those cases Python is part of "the system" rather than a local add-on. However, if you are installing Python modules from source, you probably want them to go in :file:`/usr/local/lib/python2.{X}` rather than :file:`/usr/lib/python2.{X}`. This can be done with ::
it_it: Innanzitutto, considera che molte distribuzioni Linux mettono Python in :file:`/usr`, piuttosto che nel più tradizionale :file:`/usr/local`. Questo è del tutto appropriato, dal momento che in quei casi Python fa parte del "sistema" piuttosto che di un'aggiunta locale. Tuttavia, se stai installando moduli Python dal sorgente, probabilmente vuoi che vadano in :file:`/usr/local/lib/python2.{X}` piuttosto che in :file:`/usr/lib/python2.{X}`. Questo può essere fatto con::

source: Another possibility is a network filesystem where the name used to write to a remote directory is different from the name used to read it: for example, the Python interpreter accessed as :file:`/usr/local/bin/python` might search for modules in :file:`/usr/local/lib/python2.{X}`, but those modules would have to be installed to, say, :file:`/mnt/{@server}/export/lib/python2.{X}`. This could be done with ::
it_it: Un'altra possibilità è un file system di rete dove il nome usato per scrivere in una directory remota è diverso dal nome usato per leggerlo: ad esempio, l'interprete Python accessibile come :file:`/usr/local/bin/python` potrebbe cercare moduli in :file:`/usr/local/lib/python2.{X}`, ma quei moduli dovrebbero essere installati in, per esempio, :file:`/mnt/{@server}/export/lib/python2.{X}`. Questo potrebbe essere fatto con::

source: In either case, the :option:`!--prefix` option defines the installation base, and the :option:`!--exec-prefix` option defines the platform-specific installation base, which is used for platform-specific files. (Currently, this just means non-pure module distributions, but could be expanded to C libraries, binary executables, etc.) If :option:`!--exec-prefix` is not supplied, it defaults to :option:`!--prefix`. Files are installed as follows:
it_it: In entrambi i casi, l'opzione :option:`!--prefix` definisce la base dell'installazione e l'opzione :option:`!--exec-prefix` definisce la base dell'installazione specifica della piattaforma, che viene utilizzata per i file specifici della piattaforma. (Attualmente, questo significa solo distribuzioni di moduli non puri, ma potrebbe essere esteso alle librerie C, eseguibili binari, ecc.) Se l'opzione :option:`!--exec-prefix` non è fornita, il valore predefinito è :option:`!--prefix`. I file vengono installati come segue:

source: Python modules
it_it: Moduli Python

source: extension modules
it_it: Moduli di estensione

source: There is no requirement that :option:`!--prefix` or :option:`!--exec-prefix` actually point to an alternate Python installation; if the directories listed above do not already exist, they are created at installation time.
it_it: Non è necessario che :option:`!--prefix` o :option:`!--exec-prefix` puntino effettivamente a un'installazione Python alternativa; se le directory elencate sopra non esistono già, vengono create al momento dell'installazione.

source: Incidentally, the real reason the prefix scheme is important is simply that a standard Unix installation uses the prefix scheme, but with :option:`!--prefix` and :option:`!--exec-prefix` supplied by Python itself as ``sys.prefix`` and ``sys.exec_prefix``. Thus, you might think you'll never use the prefix scheme, but every time you run ``python setup.py install`` without any other options, you're using it.
it_it: La vera ragione per cui lo schema del prefisso è importante è semplicemente che un'installazione standard di Unix utilizza lo schema del prefisso, ma con :option:`!--prefix` e :option:`!--exec-prefix` fornite da Python stesso come ``sys.prefix`` e ``sys.exec_prefix``. Quindi, potresti pensare di non utilizzare mai lo schema del prefisso, ma ogni volta che esegui ``python setup.py install`` senza altre opzioni, lo stai utilizzando.

source: Note that installing extensions to an alternate Python installation has no effect on how those extensions are built: in particular, the Python header files (:file:`Python.h` and friends) installed with the Python interpreter used to run the setup script will be used in compiling extensions. It is your responsibility to ensure that the interpreter used to run extensions installed in this way is compatible with the interpreter used to build them. The best way to do this is to ensure that the two interpreters are the same version of Python (possibly different builds, or possibly copies of the same build). (Of course, if your :option:`!--prefix` and :option:`!--exec-prefix` don't even point to an alternate Python installation, this is immaterial.)
it_it: Nota che installare estensioni a un'installazione Python alternativa non ha alcun effetto su come queste estensioni sono costruite: in particolare, i file di intestazione Python (:file:`Python.h` e simili) installati con l'interprete Python utilizzato per eseguire lo script di setup saranno utilizzati nella compilazione delle estensioni. È tua responsabilità assicurarti che l'interprete utilizzato per eseguire le estensioni installate in questo modo sia compatibile con l'interprete utilizzato per costruirle. Il modo migliore per farlo è assicurarti che i due interpreti siano della stessa versione di Python (possibilmente con build diverse, o possibilmente copie dello stesso build). (Ovviamente, se il tuo :option:`!--prefix` e :option:`!--exec-prefix` non puntano nemmeno a un'installazione Python alternativa, questo è irrilevante.)

source: Alternate installation: Windows (the prefix scheme)
it_it: Installazione alternativa: Windows (lo schema del prefisso)

source: Windows has no concept of a user's home directory, and since the standard Python installation under Windows is simpler than under Unix, the :option:`!--prefix` option has traditionally been used to install additional packages in separate locations on Windows. ::
it_it: Windows non ha il concetto di directory home dell'utente, e poiché l'installazione standard di Python su Windows è più semplice rispetto a Unix, l'opzione :option:`!--prefix` è stata tradizionalmente utilizzata per installare pacchetti aggiuntivi in posizioni separate su Windows.::

source: to install modules to the :file:`\\Temp\\Python` directory on the current drive.
it_it: per installare moduli nella directory :file:`\\Temp\\Python` sull'unità corrente.

source: The installation base is defined by the :option:`!--prefix` option; the :option:`!--exec-prefix` option is not supported under Windows, which means that pure Python modules and extension modules are installed into the same location. Files are installed as follows:
it_it: La base dell'installazione è definita dall'opzione :option:`!--prefix`; l'opzione :option:`!--exec-prefix` non è supportata su Windows, il che significa che i moduli Python puri e i moduli di estensione sono installati nello stesso luogo. I file sono installati come segue:

source: Custom Installation
it_it: Installazione Personalizzata

source: Sometimes, the alternate installation schemes described in section :ref:`inst-alt-install` just don't do what you want. You might want to tweak just one or two directories while keeping everything under the same base directory, or you might want to completely redefine the installation scheme. In either case, you're creating a *custom installation scheme*.
it_it: A volte, gli schemi di installazione alternativa descritti nella sezione :ref:`inst-alt-install` semplicemente non fanno quello che vuoi. Potresti voler modificare solo una o due directory mantenendo tutto sotto la stessa directory base, o potresti voler ridefinire completamente lo schema di installazione. In entrambi i casi, stai creando uno *schema di installazione personalizzato*.

source: To create a custom installation scheme, you start with one of the alternate schemes and override some of the installation directories used for the various types of files, using these options:
it_it: Per creare uno schema di installazione personalizzato, parti da uno degli schemi alternativi e sovrascrivi alcune delle directory di installazione utilizzate per i vari tipi di file, utilizzando queste opzioni:

source: Override option
it_it: Opzione di sovrascrittura

source: all modules
it_it: tutti i moduli

source: These override options can be relative, absolute, or explicitly defined in terms of one of the installation base directories. (There are two installation base directories, and they are normally the same---they only differ when you use the Unix "prefix scheme" and supply different ``--prefix`` and ``--exec-prefix`` options; using ``--install-lib`` will override values computed or given for ``--install-purelib`` and ``--install-platlib``, and is recommended for schemes that don't make a difference between Python and extension modules.)
it_it: Queste opzioni di sovrascrittura possono essere relative, assolute o esplicitamente definite in termini di una delle directory di base dell'installazione. (Ci sono due directory di base dell'installazione, e normalmente sono le stesse - differiscono solo quando si utilizza lo "schema del prefisso" di Unix e si forniscono diverse opzioni ``--prefix`` e ``--exec-prefix``; l'uso di ``--install-lib`` sovrascriverà i valori calcolati o forniti per ``--install-purelib`` e ``--install-platlib``, ed è raccomandato per gli schemi che non fanno differenze tra moduli Python e moduli di estensione.)

source: For example, say you're installing a module distribution to your home directory under Unix---but you want scripts to go in :file:`~/scripts` rather than :file:`~/bin`. As you might expect, you can override this directory with the :option:`!--install-scripts` option; in this case, it makes most sense to supply a relative path, which will be interpreted relative to the installation base directory (your home directory, in this case)::
it_it: Per esempio, diciamo che stai installando una distribuzione di moduli nella tua directory home su Unix - ma vuoi che gli script vadano in :file:`~/scripts` invece che in :file:`~/bin`. Come potresti aspettarti, puoi sovrascrivere questa directory con l'opzione :option:`!--install-scripts`; in questo caso, ha più senso fornire un percorso relativo, che sarà interpretato relativo alla directory base dell'installazione (la tua directory home, in questo caso)::

source: Another Unix example: suppose your Python installation was built and installed with a prefix of :file:`/usr/local/python`, so under a standard installation scripts will wind up in :file:`/usr/local/python/bin`. If you want them in :file:`/usr/local/bin` instead, you would supply this absolute directory for the :option:`!--install-scripts` option::
it_it: Un altro esempio Unix: supponiamo che la tua installazione Python sia stata costruita e installata con un prefisso di :file:`/usr/local/python`, quindi sotto un'installazione standard gli script finiranno in :file:`/usr/local/python/bin`. Se li vuoi in :file:`/usr/local/bin` invece, dovresti fornire questa directory assoluta per l'opzione :option:`!--install-scripts`::

source: (This performs an installation using the "prefix scheme", where the prefix is whatever your Python interpreter was installed with--- :file:`/usr/local/python` in this case.)
it_it: (Questo esegue un'installazione utilizzando lo "schema del prefisso", dove il prefisso è qualsiasi cosa con cui è stato installato il tuo interprete Python - :file:`/usr/local/python` in questo caso).

source: If you maintain Python on Windows, you might want third-party modules to live in a subdirectory of :file:`{prefix}`, rather than right in :file:`{prefix}` itself. This is almost as easy as customizing the script installation directory---you just have to remember that there are two types of modules to worry about, Python and extension modules, which can conveniently be both controlled by one option::
it_it: Se mantieni Python su Windows, potresti volere che i moduli di terze parti vivano in una sottodirectory di :file:`{prefix}`, piuttosto che direttamente in :file:`{prefix}` stesso. Questo è quasi facile quanto personalizzare la directory di installazione degli script - devi solo ricordare che ci sono due tipi di moduli da considerare, moduli Python e moduli di estensione, che possono convenientemente essere entrambi controllati da una sola opzione::

source: The specified installation directory is relative to :file:`{prefix}`. Of course, you also have to ensure that this directory is in Python's module search path, such as by putting a :file:`.pth` file in a site directory (see :mod:`site`). See section :ref:`inst-search-path` to find out how to modify Python's search path.
it_it: La directory di installazione specificata è relativa a :file:`{prefix}`. Ovviamente, devi anche assicurarti che questa directory sia nel percorso dei moduli di Python, ad esempio mettendo un file :file:`.pth` in una directory del sito (vedi :mod:`site`). Vedi la sezione :ref:`inst-search-path` per scoprire come modificare il percorso di ricerca di Python.

source: If you want to define an entire installation scheme, you just have to supply all of the installation directory options. The recommended way to do this is to supply relative paths; for example, if you want to maintain all Python module-related files under :file:`python` in your home directory, and you want a separate directory for each platform that you use your home directory from, you might define the following installation scheme::
it_it: Se vuoi definire un intero schema di installazione, devi solo fornire tutte le opzioni delle directory di installazione. Il modo raccomandato di farlo è fornire percorsi relativi; per esempio, se vuoi mantenere tutti i file relativi ai moduli Python sotto :file:`python` nella tua directory home, e vuoi una directory separata per ogni piattaforma che usi dalla tua directory home, potresti definire il seguente schema di installazione::

source: or, equivalently, ::
it_it: o, equivalentemente::

source: ``$PLAT`` is not (necessarily) an environment variable---it will be expanded by the Distutils as it parses your command line options, just as it does when parsing your configuration file(s).
it_it: ``$PLAT`` non è (necessariamente) una variabile d'ambiente - sarà espansa dai Distutils mentre analizza le opzioni della linea di comando, proprio come fa quando analizza il/i file di configurazione.

source: Obviously, specifying the entire installation scheme every time you install a new module distribution would be very tedious. Thus, you can put these options into your Distutils config file (see section :ref:`inst-config-files`):
it_it: Ovviamente, specificare l'intero schema di installazione ogni volta che installi una nuova distribuzione di moduli sarebbe molto noioso. Pertanto, puoi mettere queste opzioni nel tuo file di configurazione Distutils (vedi sezione :ref:`inst-config-files`):

source: or, equivalently,
it_it: o, equivalentemente,

source: Note that these two are *not* equivalent if you supply a different installation base directory when you run the setup script. For example, ::
it_it: Nota che questi due non sono *equivalenti* se fornisci una directory base di installazione diversa quando esegui lo script di setup. Per esempio,::

source: would install pure modules to :file:`/tmp/python/lib` in the first case, and to :file:`/tmp/lib` in the second case. (For the second case, you probably want to supply an installation base of :file:`/tmp/python`.)
it_it: installerebbe moduli puri in :file:`/tmp/python/lib` nel primo caso, e in :file:`/tmp/lib` nel secondo caso. (Per il secondo caso, probabilmente vorrai fornire una base di installazione di :file:`/tmp/python`.)

source: You probably noticed the use of ``$HOME`` and ``$PLAT`` in the sample configuration file input. These are Distutils configuration variables, which bear a strong resemblance to environment variables. In fact, you can use environment variables in config files on platforms that have such a notion but the Distutils additionally define a few extra variables that may not be in your environment, such as ``$PLAT``. (And of course, on systems that don't have environment variables, such as Mac OS 9, the configuration variables supplied by the Distutils are the only ones you can use.) See section :ref:`inst-config-files` for details.
it_it: Probabilmente hai notato l'uso di ``$HOME`` e ``$PLAT`` nell'input del file di configurazione di esempio. Questi sono variabili di configurazione dei Distutils, che assomigliano molto alle variabili d'ambiente. In effetti, puoi usare variabili d'ambiente nei file di configurazione su piattaforme che hanno un concetto di questo tipo ma i Distutils definiscono inoltre alcune variabili aggiuntive che possono non essere nel tuo ambiente, come ``$PLAT``. (E naturalmente, sui sistemi che non hanno variabili d'ambiente, come Mac OS 9, le variabili di configurazione fornite dai Distutils sono le uniche che puoi usare.) Vedi la sezione :ref:`inst-config-files` per i dettagli.
