Repository: Addivsyou/python-docs-it
Catalog: install/index.po
Languages: it_it

source: When a :ref:`virtual environment <venv-def>` is activated, any options that change the installation path will be ignored from all distutils configuration files to prevent inadvertently installing projects outside of the virtual environment.
it_it: Quando un :ref:`ambiente virtuale <venv-def>` è attivato, tutte le opzioni che modificano il percorso di installazione saranno ignorate da tutti i file di configurazione dei distutils per evitare di installare inavvertitamente progetti al di fuori dell'ambiente virtuale.

source: Modifying Python's Search Path
it_it: Modificare il percorso di ricerca di Python

source: When the Python interpreter executes an :keyword:`import` statement, it searches for both Python code and extension modules along a search path. A default value for the path is configured into the Python binary when the interpreter is built. You can determine the path by importing the :mod:`sys` module and printing the value of ``sys.path``. ::
it_it: Quando l'interprete Python esegue un'istruzione :keyword:`import`, cerca sia il codice Python che i moduli di estensione lungo un percorso di ricerca. Un valore predefinito per il percorso è configurato nel binario Python quando l'interprete viene costruito. Puoi determinare il percorso importando il modulo :mod:`sys` e stampando il valore di ``sys.path``.::

source: The null string in ``sys.path`` represents the current working directory.
it_it: La stringa nulla in ``sys.path`` rappresenta la directory di lavoro corrente.

source: The expected convention for locally installed packages is to put them in the :file:`{...}/site-packages/` directory, but you may want to install Python modules into some arbitrary directory. For example, your site may have a convention of keeping all software related to the web server under :file:`/www`. Add-on Python modules might then belong in :file:`/www/python`, and in order to import them, this directory must be added to ``sys.path``. There are several different ways to add the directory.
it_it: La convenzione prevista per i pacchetti installati localmente è metterli nella directory :file:`{...}/site-packages/`, ma potresti voler installare moduli Python in una directory arbitraria. Per esempio, il tuo sito potrebbe avere la convenzione di mantenere tutto il software relativo al server web sotto :file:`/www`. I moduli Python aggiuntivi potrebbero quindi appartenere a :file:`/www/python`, e per importarli, questa directory deve essere aggiunta a ``sys.path``. Ci sono diversi modi per aggiungere la directory.

source: The most convenient way is to add a path configuration file to a directory that's already on Python's path, usually to the :file:`.../site-packages/` directory. Path configuration files have an extension of :file:`.pth`, and each line must contain a single path that will be appended to ``sys.path``. (Because the new paths are appended to ``sys.path``, modules in the added directories will not override standard modules. This means you can't use this mechanism for installing fixed versions of standard modules.)
it_it: Il modo più comodo è aggiungere un file di configurazione del percorso a una directory che è già presente nel percorso di Python, di solito nella directory :file:`.../site-packages/`. I file di configurazione del percorso hanno un'estensione di :file:`.pth`, e ogni riga deve contenere un singolo percorso che verrà aggiunto a ``sys.path``. (Poiché i nuovi percorsi vengono aggiunti a ``sys.path``, i moduli nelle directory aggiunte non sovrascriveranno i moduli standard. Questo significa che non puoi usare questo meccanismo per installare versioni fisse di moduli standard.)

source: Paths can be absolute or relative, in which case they're relative to the directory containing the :file:`.pth` file. See the documentation of the :mod:`site` module for more information.
it_it: I percorsi possono essere assoluti o relativi, nel qual caso sono relativi alla directory contenente il file :file:`.pth`. Vedi la documentazione del modulo :mod:`site` per maggiori informazioni.

source: A slightly less convenient way is to edit the :file:`site.py` file in Python's standard library, and modify ``sys.path``. :file:`site.py` is automatically imported when the Python interpreter is executed, unless the :option:`-S` switch is supplied to suppress this behaviour. So you could simply edit :file:`site.py` and add two lines to it:
it_it: Un modo leggermente meno comodo è modificare il file :file:`site.py` nella libreria standard di Python e modificare ``sys.path``. :file:`site.py` viene importato automaticamente quando l'interprete Python viene eseguito, a meno che non viene fornito l'interruttore :option:`-S` per sopprimere questo comportamento. Quindi potresti semplicemente modificare :file:`site.py` e aggiungere due righe:

source: However, if you reinstall the same major version of Python (perhaps when upgrading from 2.2 to 2.2.2, for example) :file:`site.py` will be overwritten by the stock version. You'd have to remember that it was modified and save a copy before doing the installation.
it_it: Tuttavia, se reinstalli la stessa versione principale di Python (forse durante l'aggiornamento dalla versione 2.2 alla 2.2.2, per esempio) :file:`site.py` sarà sovrascritto dalla versione di stock. Dovresti ricordare che è stato modificato e salvare una copia prima di eseguire l'installazione.

source: There are two environment variables that can modify ``sys.path``. :envvar:`PYTHONHOME` sets an alternate value for the prefix of the Python installation. For example, if :envvar:`PYTHONHOME` is set to ``/www/python``, the search path will be set to ``['', '/www/python/lib/pythonX.Y/', '/www/python/lib/pythonX.Y/plat-linux2', ...]``.
it_it: Ci sono due variabili d'ambiente che possono modificare ``sys.path``. :envvar:`PYTHONHOME` imposta un valore alternativo per il prefisso dell'installazione Python. Per esempio, se :envvar:`PYTHONHOME` è impostato a ``/www/python``, il percorso di ricerca sarà impostato a ``['', '/www/python/lib/pythonX.Y/', '/www/python/lib/pythonX.Y/plat-linux2', ...]``.

source: The :envvar:`PYTHONPATH` variable can be set to a list of paths that will be added to the beginning of ``sys.path``. For example, if :envvar:`PYTHONPATH` is set to ``/www/python:/opt/py``, the search path will begin with ``['/www/python', '/opt/py']``. (Note that directories must exist in order to be added to ``sys.path``; the :mod:`site` module removes paths that don't exist.)
it_it: La variabile :envvar:`PYTHONPATH` può essere impostata su un elenco di percorsi che saranno aggiunti all'inizio di ``sys.path``. Per esempio, se :envvar:`PYTHONPATH` è impostata su ``/www/python:/opt/py``, il percorso di ricerca inizierà con ``['/www/python', '/opt/py']``. (Nota che le directory devono esistere per essere aggiunte a ``sys.path``; il modulo :mod:`site` rimuove i percorsi che non esistono.)

source: Finally, ``sys.path`` is just a regular Python list, so any Python application can modify it by adding or removing entries.
it_it: Infine, ``sys.path`` è solo una lista Python regolare, quindi qualsiasi applicazione Python può modificarla aggiungendo o rimuovendo voci.

source: Distutils Configuration Files
it_it: File di configurazione Distutils

source: As mentioned above, you can use Distutils configuration files to record personal or site preferences for any Distutils options. That is, any option to any command can be stored in one of two or three (depending on your platform) configuration files, which will be consulted before the command-line is parsed. This means that configuration files will override default values, and the command-line will in turn override configuration files. Furthermore, if multiple configuration files apply, values from "earlier" files are overridden by "later" files.
it_it: Come accennato in precedenza, puoi utilizzare i file di configurazione Distutils per registrare preferenze personali o del sito per qualsiasi opzione Distutils. Cioè, qualsiasi opzione per qualsiasi comando può essere memorizzata in uno dei due o tre (a seconda della tua piattaforma) file di configurazione, che saranno consultati prima che la linea di comando venga analizzata. Questo significa che i file di configurazione sovrascriveranno i valori predefiniti, e la linea di comando a sua volta sovrascriverà i file di configurazione. Inoltre, se più file di configurazione si applicano, i valori dei file "precedenti" vengono sovrascritti dai file "successivi".

source: Location and names of config files
it_it: Posizione e nomi dei file di configurazione

source: The names and locations of the configuration files vary slightly across platforms. On Unix and macOS, the three configuration files (in the order they are processed) are:
it_it: I nomi e le posizioni dei file di configurazione variano leggermente tra le piattaforme. Su Unix e macOS, i tre file di configurazione (nell'ordine in cui vengono elaborati) sono:

source: Location and filename
it_it: Posizione e nome del file

source: system
it_it: sistema

source: personal
it_it: personale

source: local
it_it: locale

source: And on Windows, the configuration files are:
it_it: E su Windows, i file di configurazione sono:

source: On all platforms, the "personal" file can be temporarily disabled by passing the ``--no-user-cfg`` option.
it_it: Su tutte le piattaforme, il file "personale" può essere temporaneamente disabilitato passando l'opzione ``--no-user-cfg``.

source: Strictly speaking, the system-wide configuration file lives in the directory where the Distutils are installed; under Python 1.6 and later on Unix, this is as shown. For Python 1.5.2, the Distutils will normally be installed to :file:`{prefix}/lib/python1.5/site-packages/distutils`, so the system configuration file should be put there under Python 1.5.2.
it_it: A rigor di termini, il file di configurazione di sistema si trova nella directory in cui sono installati i Distutils; sotto Python 1.6 e successivi su Unix, ciò è come mostrato. Per Python 1.5.2, i Distutils saranno normalmente installati in :file:`{prefix}/lib/python1.5/site-packages/distutils`, quindi il file di configurazione di sistema dovrebbe essere messo lì sotto Python 1.5.2.

source: On Unix, if the :envvar:`HOME` environment variable is not defined, the user's home directory will be determined with the :func:`getpwuid` function from the standard :mod:`pwd` module. This is done by the :func:`os.path.expanduser` function used by Distutils.
it_it: Su Unix, se la variabile d'ambiente :envvar:`HOME` non è definita, la directory home dell'utente sarà determinata con la funzione :func:`getpwuid` del modulo standard :mod:`pwd`. Questo è fatto dalla funzione :func:`os.path.expanduser` utilizzata da Distutils.

source: I.e., in the current directory (usually the location of the setup script).
it_it: Cioè, nella directory corrente (di solito la posizione dello script di setup).

source: (See also note (1).) Under Python 1.6 and later, Python's default "installation prefix" is :file:`C:\\Python`, so the system configuration file is normally :file:`C:\\Python\\Lib\\distutils\\distutils.cfg`. Under Python 1.5.2, the default prefix was :file:`C:\\Program Files\\Python`, and the Distutils were not part of the standard library---so the system configuration file would be :file:`C:\\Program Files\\Python\\distutils\\distutils.cfg` in a standard Python 1.5.2 installation under Windows.
it_it: (Vedi anche la nota (1).) Sotto Python 1.6 e successivi, il "prefisso di installazione" predefinito di Python è :file:`C:\\Python`, quindi il file di configurazione di sistema è normalmente :file:`C:\\Python\\Lib\\distutils\\distutils.cfg`. Sotto Python 1.5.2, il prefisso predefinito era :file:`C:\\Program Files\\Python`, e i Distutils non facevano parte della libreria standard---quindi il file di configurazione di sistema sarebbe :file:`C:\\Program Files\\Python\\distutils\\distutils.cfg` in un'installazione standard di Python 1.5.2 sotto Windows.

source: On Windows, if the :envvar:`HOME` environment variable is not defined, :envvar:`USERPROFILE` then :envvar:`HOMEDRIVE` and :envvar:`HOMEPATH` will be tried. This is done by the :func:`os.path.expanduser` function used by Distutils.
it_it: Su Windows, se la variabile d'ambiente :envvar:`HOME` non è definita, verranno provate :envvar:`USERPROFILE` quindi :envvar:`HOMEDRIVE` e :envvar:`HOMEPATH`. Questo è fatto dalla funzione :func:`os.path.expanduser` utilizzata da Distutils.

source: Syntax of config files
it_it: Sintassi dei file di configurazione

source: The Distutils configuration files all have the same syntax. The config files are grouped into sections. There is one section for each Distutils command, plus a ``global`` section for global options that affect every command. Each section consists of one option per line, specified as ``option=value``.
it_it: I file di configurazione dei Distutils hanno tutti la stessa sintassi. I file di configurazione sono raggruppati in sezioni. C'è una sezione per ogni comando Distutils, oltre a una sezione ``global`` per le opzioni globali che influenzano ogni comando. Ogni sezione consiste di un'opzione per riga, specificata come ``option=value``.

source: For example, the following is a complete config file that just forces all commands to run quietly by default:
it_it: Ad esempio, il seguente è un file di configurazione completo che impone a tutti i comandi di essere eseguiti in modalità silenziosa per impostazione predefinita:

source: If this is installed as the system config file, it will affect all processing of any Python module distribution by any user on the current system. If it is installed as your personal config file (on systems that support them), it will affect only module distributions processed by you. And if it is used as the :file:`setup.cfg` for a particular module distribution, it affects only that distribution.
it_it: Se questo è installato come file di configurazione di sistema, influenzerà tutta l'elaborazione di qualsiasi distribuzione di moduli Python da parte di qualsiasi utente sul sistema corrente. Se è installato come il tuo file di configurazione personale (su sistemi che li supportano), influenzerà solo le distribuzioni di moduli elaborate da te. E se è usato come :file:`setup.cfg` per una particolare distribuzione di moduli, influenzerà solo quella distribuzione.

source: You could override the default "build base" directory and make the :command:`build\*` commands always forcibly rebuild all files with the following:
it_it: Potresti sovrascrivere la directory "base di build" predefinita e rendere i comandi :command:`build\*` sempre ricostruire forzatamente tutti i file con il seguente:

source: which corresponds to the command-line arguments ::
it_it: che corrisponde agli argomenti della riga di comando ::

source: except that including the :command:`build` command on the command-line means that command will be run. Including a particular command in config files has no such implication; it only means that if the command is run, the options in the config file will apply. (Or if other commands that derive values from it are run, they will use the values in the config file.)
it_it: tranne che includere il comando :command:`build` sulla riga di comando significa che quel comando sarà eseguito. Includere un particolare comando nei file di configurazione non ha tale implicazione; significa solo che se il comando viene eseguito, le opzioni nel file di configurazione si applicheranno. (O se altri comandi che derivano valori da esso vengono eseguiti, useranno i valori nel file di configurazione.)

source: You can find out the complete list of options for any command using the :option:`!--help` option, e.g.::
it_it: Puoi scoprire l'elenco completo delle opzioni per qualsiasi comando usando l'opzione :option:`!--help`, ad esempio::

source: and you can find out the complete list of global options by using :option:`!--help` without a command::
it_it: e puoi scoprire l'elenco completo delle opzioni globali usando :option:`!--help` senza un comando::

source: See also the "Reference" section of the "Distributing Python Modules" manual.
it_it: Vedi anche la sezione "Riferimento" del manuale "Distributing Python Modules".

source: Building Extensions: Tips and Tricks
it_it: Compilazione delle Estensioni: Suggerimenti e Trucchi

source: Whenever possible, the Distutils try to use the configuration information made available by the Python interpreter used to run the :file:`setup.py` script. For example, the same compiler and linker flags used to compile Python will also be used for compiling extensions. Usually this will work well, but in complicated situations this might be inappropriate. This section discusses how to override the usual Distutils behaviour.
it_it: Ogni volta che è possibile, i Distutils cercano di utilizzare le informazioni di configurazione rese disponibili dall'interprete Python utilizzato per eseguire lo script :file:`setup.py`. Ad esempio, gli stessi flag del compilatore e del linker utilizzati per compilare Python saranno usati anche per compilare le estensioni. Di solito questo funzionerà bene, ma in situazioni complicate potrebbe essere inappropriato. Questa sezione discute come sovrascrivere il comportamento normale dei Distutils.

source: Tweaking compiler/linker flags
it_it: Modifica dei flag del compilatore/linker

source: Compiling a Python extension written in C or C++ will sometimes require specifying custom flags for the compiler and linker in order to use a particular library or produce a special kind of object code. This is especially true if the extension hasn't been tested on your platform, or if you're trying to cross-compile Python.
it_it: Compilare un'estensione Python scritta in C o C++ richiederà a volte di specificare flag personalizzati per il compilatore e il linker al fine di utilizzare una libreria particolare o produrre un tipo speciale di codice oggetto. Questo è particolarmente vero se l'estensione non è stata testata sulla tua piattaforma, o se stai cercando di cross-compilare Python.

source: In the most general case, the extension author might have foreseen that compiling the extensions would be complicated, and provided a :file:`Setup` file for you to edit. This will likely only be done if the module distribution contains many separate extension modules, or if they often require elaborate sets of compiler flags in order to work.
it_it: Nel caso più generale, l'autore dell'estensione potrebbe aver previsto che compilare le estensioni sarebbe complicato, e fornito un file :file:`Setup` per te da modificare. Questo probabilmente sarà fatto solo se la distribuzione del modulo contiene molti moduli di estensione separati, o se richiedono spesso set elaborati di flag del compilatore per funzionare.

source: A :file:`Setup` file, if present, is parsed in order to get a list of extensions to build. Each line in a :file:`Setup` describes a single module. Lines have the following structure::
it_it: Un file :file:`Setup`, se presente, viene analizzato per ottenere un elenco di estensioni da costruire. Ogni riga in un :file:`Setup` descrive un singolo modulo. Le righe hanno la seguente struttura::

source: Let's examine each of the fields in turn.
it_it: Esaminiamo ogni campo a turno.

source: *module* is the name of the extension module to be built, and should be a valid Python identifier. You can't just change this in order to rename a module (edits to the source code would also be needed), so this should be left alone.
it_it: *module* è il nome del modulo di estensione da costruire e dovrebbe essere un identificatore Python valido. Non puoi semplicemente cambiare questo per rinominare un modulo (sarebbero necessarie modifiche al codice sorgente), quindi dovrebbe essere lasciato così com'è.

source: *sourcefile* is anything that's likely to be a source code file, at least judging by the filename. Filenames ending in :file:`.c` are assumed to be written in C, filenames ending in :file:`.C`, :file:`.cc`, and :file:`.c++` are assumed to be C++, and filenames ending in :file:`.m` or :file:`.mm` are assumed to be in Objective C.
it_it: *sourcefile* è qualsiasi cosa che sia probabilmente un file di codice sorgente, almeno giudicando dal nome del file. I nomi di file che finiscono in :file:`.c` sono considerati scritti in C, i nomi di file che finiscono in :file:`.C`, :file:`.cc`, e :file:`.c++` sono considerati C++, e i nomi di file che finiscono in :file:`.m` o :file:`.mm` sono considerati in Objective C.

source: *cpparg* is an argument for the C preprocessor, and is anything starting with :option:`!-I`, :option:`!-D`, :option:`!-U` or :option:`!-C`.
it_it: *cpparg* è un argomento per il preprocessore C, ed è qualsiasi cosa che inizi con :option:`!-I`, :option:`!-D`, :option:`!-U` o :option:`!-C`.

source: *library* is anything ending in :file:`.a` or beginning with :option:`!-l` or :option:`!-L`.
it_it: *library* è qualsiasi cosa che termini con :file:`.a` o inizi con :option:`!-l` o :option:`!-L`.

source: If a particular platform requires a special library on your platform, you can add it by editing the :file:`Setup` file and running ``python setup.py build``. For example, if the module defined by the line ::
it_it: Se una particolare piattaforma richiede una libreria speciale sulla tua piattaforma, puoi aggiungerla modificando il file :file:`Setup` ed eseguendo ``python setup.py build``. Ad esempio, se il modulo definito dalla riga ::

source: must be linked with the math library :file:`libm.a` on your platform, simply add :option:`!-lm` to the line::
it_it: deve essere collegato alla libreria matematica :file:`libm.a` sulla tua piattaforma, semplicemente aggiungi :option:`!-lm` alla riga::

source: Arbitrary switches intended for the compiler or the linker can be supplied with the :option:`!-Xcompiler` *arg* and :option:`!-Xlinker` *arg* options::
it_it: Gli switch arbitrari destinati al compilatore o al linker possono essere forniti con le opzioni :option:`!-Xcompiler` *arg* e :option:`!-Xlinker` *arg` options::

source: The next option after :option:`!-Xcompiler` and :option:`!-Xlinker` will be appended to the proper command line, so in the above example the compiler will be passed the :option:`!-o32` option, and the linker will be passed :option:`!-shared`. If a compiler option requires an argument, you'll have to supply multiple :option:`!-Xcompiler` options; for example, to pass ``-x c++`` the :file:`Setup` file would have to contain ``-Xcompiler -x -Xcompiler c++``.
it_it: L'opzione successiva dopo :option:`!-Xcompiler` e :option:`!-Xlinker` sarà aggiunta alla linea di comando appropriata, quindi nell'esempio sopra il compilatore riceverà l'opzione :option:`!-o32` e il linker riceverà :option:`!-shared`. Se un'opzione del compilatore richiede un argomento, dovrai fornire multiple opzioni :option:`!-Xcompiler`; ad esempio, per passare ``-x c++`` il file :file:`Setup` dovrà contenere ``-Xcompiler -x -Xcompiler c++``.

source: Compiler flags can also be supplied through setting the :envvar:`CFLAGS` environment variable. If set, the contents of :envvar:`CFLAGS` will be added to the compiler flags specified in the :file:`Setup` file.
it_it: I flag del compilatore possono anche essere forniti impostando la variabile d'ambiente :envvar:`CFLAGS`. Se impostata, il contenuto di :envvar:`CFLAGS` sarà aggiunto ai flag del compilatore specificati nel file :file:`Setup`.

source: Using non-Microsoft compilers on Windows
it_it: Utilizzo di compilatori non Microsoft su Windows
